* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header


*              Check for TEST settings  !!!!!!!!!!       NG

* CRM Admin interface : Synchronize CRM based on monthly CAP approval
*                       process
*********************************************************************
* NAME         : ATSYNCH                                            *
* AUTHOR       : Copyright: MetrostarSystems AAFMAA                 *
* DESCRIPTION  : Synchronize CRM based on monthly CAP approval      *
*                       process                                     *
*********************************************************************
*        MODIFICATION LOG
*        ================
* USER   DATE      TAG  REASON
* NGG    20100616      Initial Creation
*********************************************************************

DEFINE DATA
LOCAL
1 BLANK (A1) CONST <' '>
1 #AT-NUMBER (A6) 1 REDEFINE #AT-NUMBER
  2 #AT-NUMBER-N (N6)
1 #CRM-Result     (A) DYNAMIC
1 #SYNC-DATE      (D)
1 #SYNCH-RECS     (I4)
1 #EFFECTIVE-DATE-A (A8) 1 REDEFINE #EFFECTIVE-DATE-A
  2 #EFFECTIVE-DATE (N8)
1 #TRL-FILE-NAME    (A) DYNAMIC

1 AT-V VIEW OF A-APPL-TRACKING
  2 ID-NUMBER    (N6)
  2 MEMBER-CN    (A6) 2 REDEFINE MEMBER-CN
    3 MEMBER-CN-N (N6)
  2 AT-STATUS
  2 CRM-APPL-ID
1 #LOG-LINE  (A80)
1 #AT-ISN    (P8)
1 #ST-ISN    (P8)
1 STATUS VIEW OF A-STATUS
END-DEFINE
*
* MEMBER-CN-N := 187533
* CALLNAT 'MBRSVCY'    
*   MEMBER-CN-N
*   #CRM-RESULT
* escape routine
* *
FIND AT-V WITH ID-NUMBER = 517375
  IF CRM-APPL-ID NE BLANK
    #AT-ISN := *ISN (0054)
    FIND STATUS WITH ID-NUMBER = 202583
      #ST-ISN := *ISN (0057)
      CALLNAT 'MBRNEWAI'
        #AT-ISN
        #ST-ISN
      PRINT 'MBRNEWAI called'
    END-FIND
  end-if
end-find
escape routine
*
FIND AT-V WITH ID-NUMBER = 578851
  IF CRM-APPL-ID NE BLANK
    #AT-ISN := *ISN (0068)
    FIND STATUS WITH ID-NUMBER = 079502
      #ST-ISN := *ISN (0071)
      CALLNAT 'MBRNEWAI'
        #AT-ISN
        #ST-ISN
    END-FIND
  end-if
end-find
*
FIND AT-V WITH ID-NUMBER = 576491
  IF CRM-APPL-ID NE BLANK
    #AT-ISN := *ISN (0068)
    FIND STATUS WITH ID-NUMBER = 183949
      #ST-ISN := *ISN (0071)
      CALLNAT 'MBRNEWAI'
        #AT-ISN
        #ST-ISN
    END-FIND
  end-if
end-find
*
FIND AT-V WITH ID-NUMBER = 578018
  IF CRM-APPL-ID NE BLANK
    #AT-ISN := *ISN (0068)
    FIND STATUS WITH ID-NUMBER = 184719
      #ST-ISN := *ISN (0071)
      CALLNAT 'MBRNEWAI'
        #AT-ISN
        #ST-ISN
    END-FIND
  end-if
end-find
*
FIND AT-V WITH ID-NUMBER = 578617
  IF CRM-APPL-ID NE BLANK
    #AT-ISN := *ISN (0068)
    FIND STATUS WITH ID-NUMBER = 185022
      #ST-ISN := *ISN (0071)
      CALLNAT 'MBRNEWAI'
        #AT-ISN
        #ST-ISN
    END-FIND
  end-if
end-find
*
FIND AT-V WITH ID-NUMBER = 578978
  IF CRM-APPL-ID NE BLANK
    #AT-ISN := *ISN (0068)
    FIND STATUS WITH ID-NUMBER = 185213
      #ST-ISN := *ISN (0071)
      CALLNAT 'MBRNEWAI'
        #AT-ISN
        #ST-ISN
    END-FIND
  end-if
end-find
*
FIND AT-V WITH ID-NUMBER = 578939
  IF CRM-APPL-ID NE BLANK
    #AT-ISN := *ISN (0068)
    FIND STATUS WITH ID-NUMBER = 185190
      #ST-ISN := *ISN (0071)
      CALLNAT 'MBRNEWAI'
        #AT-ISN
        #ST-ISN
    END-FIND
  end-if
end-find
escape routine
*
ASSIGN #SYNC-DATE = *DATX
MOVE EDITED #SYNC-DATE (EM=YYYYMMDD) TO #EFFECTIVE-DATE-A
assign #TRL-FILE-NAME = '/usr/SAG/tmp/'
compress #TRL-FILE-NAME 'A' #EFFECTIVE-DATE-A '.txt' into
  #TRL-FILE-NAME leaving no
print #TRL-FILE-NAME
DEFINE WORK FILE 2 #TRL-FILE-NAME TYPE 'ASCII'
*
DEFINE WORK FILE 3 '/usr/SAG/AAFMAA/batch/workfiles/PERMDA/ATH/CAP_ATS_APPROVED.TXT'
  TYPE 'ASCII'
*
COMPRESS FULL
  'AT-Number'
  'CN-Number'
  'AT-Status'
  'Quote-ID'
  INTO #LOG-LINE WITH DELIMITERS
WRITE WORK FILE 2 #LOG-LINE
*
READ WORK 3 #AT-NUMBER
  MOVE RIGHT JUSTIFIED #AT-NUMBER TO #AT-NUMBER
  FIND AT-V WITH ID-NUMBER = #AT-NUMBER-N
    IF CRM-APPL-ID NE BLANK
      CALLNAT 'MBRNEWST'
        AT-V.ID-NUMBER
        AT-V.MEMBER-CN-N
        #CRM-Result
      ADD 1 TO #SYNCH-RECS
    ELSE
      ASSIGN AT-V.CRM-APPL-ID = 'Not originated from CRM'
    END-IF
    COMPRESS FULL
      AT-V.ID-NUMBER
      AT-V.MEMBER-CN
      AT-V.AT-STATUS
      AT-V.CRM-APPL-ID
      INTO #LOG-LINE WITH DELIMITERS
    WRITE WORK FILE 2 #LOG-LINE
  END-FIND

  IF #SYNCH-RECS > 10
    ESCAPE BOTTOM
  END-IF

END-WORK
*
ON ERROR
  COMPRESS
    'Error'
    *ERROR-NR
    'Line'
    *ERROR-LINE
    INTO #LOG-LINE WITH DELIMITERS
  WRITE WORK FILE 2 #LOG-LINE
  ESCAPE ROUTINE
END-ERROR

END
