* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA LOCAL
*
1 #AT-NUMBER      (N6)
1 #POLICY-SEGMENT (N1)
1 #E-DEPOSIT-IND  (A1)
1 #ERROR-CODE     (A3)
*
END-DEFINE
*
#AT-NUMBER      := 507506
#POLICY-SEGMENT := 1
#E-DEPOSIT-IND  := 'C' 
CALLNAT 'WEPN0001' 
 #AT-NUMBER      
 #POLICY-SEGMENT 
 #E-DEPOSIT-IND  
 #ERROR-CODE     
*
END
