DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PLANCODE (A3/1:15)
  CONST
  <
  'RT',
  'AL' ,
  'GP2',
  'LT' ,
  '20P',
  '30P',
  '7P' ,
  '99F',
  'OL' ,
  'SP' ,
  'SPF',
  'EZ',
  'LT2',
  'LT2',
  'LT2'
  >
END-DEFINE
