DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PlanDuration (A20/15)
  CONST
  <
  'Five Years reneable',
  'Paid-Up Whole Life',
  'To Age 100',
  'Level Term ',
  '20 Years',
  '30 Years',
  '7 Years',
  '99 Years',
  'To Age 100',
  'Paid-Up Whole Life',
  'Paid-Up Whole Life',
  'No medical to 74',
  'Standard',
  'Select',
  'Super Select'
  >
END-DEFINE
