* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Program: CRMSYN2
*
* This program is to correct selected rtank ID's
* and defailt them to another ID, then push the
* update to CRM using MBRDATA object
*
DEFINE DATA
LOCAL
1 #XML                      (A) DYNAMIC
1 #LINE                     (A) DYNAMIC
1 #RESPONSE                 (A) DYNAMIC
1 #CRM-REQUEST              (I4)
1 STATUS VIEW OF A-STATUS
  2 ID-NUMBER
1 #ISN                      (P8)
1 #INPUT                    (A80) 1 REDEFINE #INPUT 
  2 #ID-NUMBER              (A6) 2 REDEFINE #ID-NUMBER 
    3 #ID-NUMBER-N  (N6)
1 BLANK                     (A1) CONST <' '>
1 P_PARMS
  2 P_ERROR_NUM           (I4)
  2 P_ERROR_LINE          (I4)
  2 P_ERROR_PROGRAM       (A32)
  2 P_ERROR_LIB           (A32)
  2 P_ERROR_DBID          (I4)
  2 P_ERROR_FNR           (I4)
  2 P_ERROR_TIME          (T)
  2 P_ERROR_PGM_TYPE      (A1)
  2 P_ERROR_PGM_TYPE_LONG (A11)
  2 P_ERROR_LANG          (I4)
  2 P_ERROR_LEVEL         (I4)
  2 P_ERROR_CLASS         (I1)
  2 P_ERROR_TYPE          (I1)
1 #ERROR-TIME             (A19)
*
END-DEFINE
*
DEFINE WORK FILE 9 '/usr/SAG/AAFMAA/batch/workfiles/TEMP/CRM-IAS-RANK.TXT' 
* 
ASSIGN #CRM-REQUEST = 2
*
READ WORK 9 #INPUT 
  MOVE RIGHT #ID-NUMBER TO #ID-NUMBER
  PERFORM CALL-CRM
END-WORK
*
DEFINE CALL-CRM
FIND  STATUS WITH ID-NUMBER = #ID-NUMBER-N
  #ISN := *ISN
  CALLNAT 'MBRDATA'
    #ISN
    #XML
    #LINE
    #RESPONSE
    #CRM-REQUEST
  IF #RESPONSE NE 'Succeeded'
    print *PROGRAM #RESPONSE  '***' /
      'CN in Error:' ID-NUMBER
    ESCAPE ROUTINE
  END-IF
END-FIND
END-SUBROUTINE
*
ON ERROR
/*
  CALLNAT 'USR2001N' P_PARMS
/*
  MOVE EDITED P_ERROR_TIME (EM=YYYY'-'MM'-'DD' 'HH':'II':'SS)
    TO #ERROR-TIME
/*
  COMPRESS
    'Error number:' P_ERROR_NUM
    'Error class:' P_ERROR_CLASS
    'Error line:' P_ERROR_LINE
    'Error program:' P_ERROR_PROGRAM
    'Error program type:' P_ERROR_PGM_TYPE
    'Error program type long:' P_ERROR_PGM_TYPE_LONG
    'Error program level:' P_ERROR_LEVEL
    'Language at error time:' P_ERROR_LANG
    'Error library:' P_ERROR_LIB
    'DBID:' P_ERROR_DBID 'FNR:' P_ERROR_FNR
    'Error type:'  P_ERROR_TYPE
    'Error time:' #ERROR-TIME
    INTO #LINE
  PRINT 'Input CN:' #ID-NUMBER
    / #LINE
END-ERROR
*
END
