* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
/** New Program CRMDRV.
/**
/** :author nguentchev
DEFINE DATA LOCAL
1 XML_PARSER_INPUT     (A) DYNAMIC
1 RESPONSE-DATA        (A) Dynamic
1 FUNCTION-NAME        (A) Dynamic
1 #CreateOrder         (A25) CONST <'CreateOrder'>
1 #CREATE-CONTACT      (A24) CONST <'CreateContact'>
1 #AuthenticateMember  (A25) CONST <'AuthenticateMember'> 
1 #CreditCardInfo      (A25) CONST <'CreditCardInfo'>
1 #SERVICE-ELIGIBLE    (A25) CONST <'Service Eligible'>

END-DEFINE
/* 

**DEFINE WORK FILE 12 "/usr/SAG/tmp/CRM/AT556172.txt" TYPE "UNFORMATTED"
**DEFINE WORK FILE 12 "/usr/SAG/tmp/CRM/AT556173.txt" TYPE "UNFORMATTED"
**DEFINE WORK FILE 12 "/usr/SAG/tmp/CRM/AT556175.txt" TYPE "UNFORMATTED"
DEFINE WORK FILE 12 "/usr/SAG/tmp/CRM/CreateContact.txt" TYPE "UNFORMATTED"

*
READ WORK FILE 12 XML_PARSER_INPUT
END-WORK
CLOSE WORK FILE 12
*
FUNCTION-NAME := #CREATE-CONTACT
CALLNAT 'MBRSRV' FUNCTION-NAME XML_PARSER_INPUT RESPONSE-DATA
PRINT RESPONSE-DATA
*
END
