* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
* CALLNAT 'CRMINVOK' XML_SERIALZE_OUTPUT (AD=O) #CRM-Request (AD=O) #CRM-Result (AD=M)
DEFINE DATA
PARAMETER
1 XML_SERIALZE_OUTPUT (A) DYNAMIC
1 #CRM-Request        (I4)
1 #CRM-Result         (A) DYNAMIC
END-DEFINE
*
END

