* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* <Natural Source Header
/** New Program CRMLOGA.
/**
/** :author nguentchev
DEFINE DATA
LOCAL
/*  1...5...10....5...20....25
/*  CRM_SYNCH20161102
/*  CRM-IMPORT20161102
/*  CRM REQUEST: 0002
1 #FN               (A18)
1 #TRL-FILE-NAME      (A) DYNAMIC
1 CRM-LOG           (A32000) 1 REDEFINE CRM-LOG
  2 #DATE (A10)
1 REDEFINE CRM-LOG
  2 #REQUEST  (A13)
  2 #REQ-CODE (A4)
1 #EOF              (L)
1 #XML              (A) DYNAMIC
1 CRM-REQUEST       (I4)
1 CRM-Result        (A) DYNAMIC
1 #DOT              (A1) INIT <'.'>
1 LEN               (I4)
1 REC               (I4)
END-DEFINE
/* 
INPUT 'FILE NAME:' #FN
assign #TRL-FILE-NAME = '/usr/SAG/tmp/'
compress #TRL-FILE-NAME #FN '.txt' into #TRL-FILE-NAME leaving no
DEFINE WORK FILE 1 #TRL-FILE-NAME TYPE 'ASCII-COMPRESSED'
/*
READ WORK 1 CRM-LOG
  ADD 1 TO REC
  PRINT 'NEW' REC 

  IF #DATE = MASK(YYYY.MM.DD)
    IF CRM-REQUEST > 0
      CALLNAT 'CRMSYNC' #XML
        CRM-REQUEST
        CRM-Result
      PRINT '=' LEN '=' CRM-REQUEST '=' CRM-Result
        / #XML
      RESET CRM-REQUEST
    END-IF
    ESCAPE TOP
  END-IF

  IF #REQUEST = 'CRM REQUEST:'
    CRM-REQUEST := VAL ( #REQ-CODE )
    #XML := #DOT
    ESCAPE TOP
  END-IF

  IF #XML = #DOT
    #XML := CRM-LOG
  ELSE
    COMPRESS #XML CRM-LOG INTO #XML LEAVING NO
  END-IF
  #XML := *TRIM(#XML,TRAILING)
  LEN := *LENGTH (#XML)

END-WORK

IF CRM-REQUEST > 0
  CALLNAT 'CRMSYNC' #XML
    CRM-REQUEST
    CRM-Result
  PRINT '=' LEN '=' CRM-REQUEST '=' CRM-Result
    / #XML
END-IF

END
