* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
LOCAL
1 FILE_NAME  (A) DYNAMIC
1 OLD_FILE_NAME (A) DYNAMIC
1 sch_str (A) DYNAMIC
  INIT <"if [ -f @f_name ];then exit 0;else exit 1;fi">
1 #EFFECTIVE-DATE-A   (A8)
1 ERROR-LOG           (A32000)  /* Have a work log file
END-DEFINE
*
MOVE EDITED *DATX (EM=YYYYMMDD) TO #EFFECTIVE-DATE-A
*
assign FILE_NAME = '/usr/SAG/tmp/'
compress FILE_NAME 'CRM_SYNCH' #EFFECTIVE-DATE-A '.txt' into
  FILE_NAME leaving no
*
EXAMINE sch_str FOR "@f_name" REPLACE FILE_NAME
call 'shcmd' sch_str
IF RET('shcmd') = 0
  PRINT FILE_NAME ': Exist'
  assign OLD_FILE_NAME = '/usr/SAG/tmp/'
  compress OLD_FILE_NAME 'CRM_SYNCH' #EFFECTIVE-DATE-A 'OLD' '.txt' into
    OLD_FILE_NAME leaving no
  COMPRESS 'mv' FILE_NAME OLD_FILE_NAME INTO sch_str
  call 'shcmd' sch_str
ELSE
  PRINT FILE_NAME ': Does not Exist'
END-IF
DEFINE WORK FILE 6 FILE_NAME TYPE 'ASCII-COMPRESSED' ATTRIBUTES 'APPEND'
COMPRESS *TIMN #EFFECTIVE-DATE-A 'CREATED' INTO ERROR-LOG
WRITE WORK 6 ERROR-LOG
*
END
