DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
* New Parameter Data Area MBR00PDA.
*
* :author nguentchev
* TODO: Enter your data definitions here
1 #EMAIL-SP (I4)
1 #EMAIL-IDS (N8/9)
1 #PHONE-SP (I4)
1 #PHONE-IDS (N8/9)
1 #ADDRESS-SP (I4)
1 #ADDRESS-IDS (N8/9)
END-DEFINE
