* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
PARAMETER
1 #CN    (N6)
1 #FOUND (L)
LOCAL
1 #CN-PART-1 (N6/210) INIT < 1002,
  47913,50045,  54834,57943,  61089,64070,  64469,65877,
  66831,67069,  67663,69628,  69988,71165,  71568,73122,
  74376,77382,  77728,77780,  78460,79108,  79646,79812,
  80769,81000,  81359,82167,  82234,82238,  83276,84090,
  84358,85239,  85329,85560,  85651,85668,  85730,86452,
  86702,88931,  90230,90522,  90714,90867,  90956,91029,
  91161,91319,  91357,92268,  93577,93620,  93694,93768,
  93777,93787,  93804,93814,  93826,93827,  93833,93877,
  93879,93970,  93979,93980,  94180,94197,  94203,94212,
  94215,94342,  94404,94422,  94426,94444,  94446,94568,
  94582,94796,  94810,94812,  94815,94886,  94914,95109,
  95328,95340,  95940,96304,  96305,96577,  96595,96650,
  96712,96719,  96723,96833,  96860,96883,  97057,97082,
  97117,97163,  97202,97356,  97416,97504,  97613,97814,
  98054,98372,  98419,98987,  99461,99549,  99651,99944,
  100301,100367,  100405,100549,  100750,101640,  101665,103553,
  103743,103769,  104042,104048,  104333,104341,  104342,104529,
  104538,104645,  104864,104872,  104989,104992,  105008,105013,
  105025,105031,  105231,105232,  105234,105256,  105262,105333,
  105342,105422,  105456,105585,  105607,105617,  105630,105700,
  105721,105744,  105745,105960,  105963,106624,  106786,106802,
  106929,107113,  107173,107199,  107249,107250,  107298,107434,
  107592,107702,  107915,107922,  107927,107934,  107983,108162,
  108168,108170,  108181,108225,  108258,108358,  108473,108567,
  108572,108585,  108587,108608,  108648,108891,  109359,109920,
  110050,110449,  110520,110587,  110759,110819,  110944,111039
  >
1 #CN-PART-2  (N6/272) INIT <
  111222, 111299,  111334,111349,  111532,111871,  111978,112428,
  112701, 113456,  113573,113620,  113759,113829,  114568,
  114632, 114910,  115003,115023,  115526,115677,  115687,115760,
  116997, 117076,  117176,118616,  118623,118630,  118746,118867,
  119222, 119524,  119850,119870,  120624,120757,  121111,121580,
  121961, 122104,  122136,122198,  122214,122292,  122804,122828,
  123644, 123680,  124298,124423,  125021,125098,  125284,125295,
  125537, 125779,  125794,125958,  126131,126356,  126419,126559,
  126642, 126799,  126970,127085,  127094,127165,  127211,127212,
  127574, 127595,  127665,127753,  127826,127857,  127908,127984,
  128096, 128588,  128871,128914,  128939,129449,  129565,129640,
  129804, 129874,  129965,129976,  130385,130478,  131304,131331,
  131442, 131494,  131606,131661,  131663,131795,  131854,132172,
  132214, 132265,  132332,132471,  132525,132854,  133281,133465,
  133511, 133535,  133645,133698,  134000,134129,  134132,134253,
  134492, 134513,  135016,135439,  135847,136059,  136341,
  136511,  136764,  136800,  137203,  137214,  137726,  137729,  137732,
  137949,  137957,  138072,  138608,  138791,  139392,  139958,  139999,
  140027,  140037,  140119,  140241,  140886,  141093,  141190,  141595,
  141734,  141760,  141820,  142219,  142265,  142360,  142575,  142814,
  142824,  143016,  143194,  143421,  143686,  143857,  144231,  144352,
  144459,  144684,  144695,  145014,  145079,  145118,  145139,  145572,
  145868,  145898,  146019,  146047,  146373,  146539,  146541,  146857,
  147006,  147055,  147137,  147894,  148072,  148589,  148682,  148752,
  149482,  149879,  150007,  150191,  150215,  150236,  150302,  150542,
  150645,  150684,  151858,  152205,  153170,  153436,  153601,  154256,
  154643,  154655,  154965,  154984,  154988,  155052,  155335,  156058,
  157000,  157009,  157262,  157309,  158101,  158124,  158633,  159089,
  159162,  159753,  159989,  160101,  160343,  161146,  161192,  161309,
  161581,  161971,  162202,  162611,  162809,  162979,  163354,  163931,
  164241,  164384,  164649,  165875,  166442,  166534,  166624,  166913,
  166982,  167050,  167062,  167120,  167490,  167534,  167626,  167745,
  168021,  168676,  168866,  168921,  169092,  169187,  169671,  169929,
  170067,  170396,  171031,  171035,  171348,  171369,  171550,  172250,
  172472,  172569  >

1 L    (I4)
1 M    (I4)
1 N    (I4)

END-DEFINE

RESET #FOUND
IF #CN LE #CN-PART-1 (209)
  ASSIGN L = 1
  ASSIGN N = 210
  REPEAT
    UNTIL L > N
    ASSIGN M = ( L + N ) / 2
    IF #CN <= #CN-PART-1 (M)
      ASSIGN N = M - 1
    END-IF
    IF #CN >= #CN-PART-1 (M)
      ASSIGN L = M + 1
    END-IF
  END-REPEAT
  IF #CN = #CN-PART-1 (M)
    ASSIGN #FOUND = TRUE
  END-IF
ELSE
  IF #CN LE #CN-PART-2 (272)
    ASSIGN L = 1
    ASSIGN N = 272
    REPEAT
      UNTIL L > N
      ASSIGN M = ( L + N ) / 2
      IF #CN <= #CN-PART-2 (M)
        ASSIGN N = M - 1
      END-IF
      IF #CN >= #CN-PART-2 (M)
        ASSIGN L = M + 1
      END-IF
    END-REPEAT
    IF #CN = #CN-PART-2 (M)
      ASSIGN #FOUND = TRUE
    END-IF
  END-IF
END-IF

END
