* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
**************
* readat
* vxt 02/02/2012
****************
define data local
1 at view of a-appl-tracking
  2 member-cn
  2 id-number
  2 at-status
  2 ssn
end-define
find  at with id-number = 181817
  if at-status = 'A'
      move 572877 to id-number
     update
     end transaction
    display id-number member-cn at-status ssn
  end-if
end-find
end
