* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL
1 BLANK   (A1) CONST <' '>
1 #TAB    (A1) CONST <H'09'>

1 CNT VIEW OF A-CONTACTS
  2 CONTACT-ID (N8)            /* D
  2 SSN (N9)                   /* D
  2 ID-NUMBER (N6)             /* D
  2 FIRST-NAME  (A25)
  2 MIDDLE-NAME (A25)
  2 LAST-NAME   (A25)
  2 GENDER-CD   (A1)
  2 DATE-OF-BIRTH   (N8)
  2 BIRTH-CERT-CODE (A1)
  2 CONTACT-REMARKS (A75/1:10)
  2 LAST-USER-UPD (A8)
  2 LAST-DATE-UPD (N8)
  2 LAST-TIME-UPD (N7)
*
1 CNT-REL VIEW OF A-CONTACT-RELATIONSHIPS
  2 CONTACT-1-ID                      (N8.0) /* Descriptor
  2 ROLE-1-CD                         (A1)
  2 CONTACT-2-ID                      (N8.0) /* Descriptor
  2 ROLE-2-CD                         (A1)
  2 LAST-USER-UPD                     (A8)
  2 ACCESS-AUTH-SVC                   (A1)   /* Insurance IAS database
  2 ACCESS-AUTH-INS                   (A1)   /* Services  SAS database
  2 LAST-DATE-UPD                     (N8.0)
  2 LAST-TIME-UPD                     (N7.0)
*
1 #ID-NUMBER  (N6)
1 #LIMIT      (N6)

1 #J          (I4)
1 #cnt-sent   (I4)
1 #MEMBERS    (I4)
1 #START-TIME (A17)
1 #END-TIME   (A17)
1 #FOUND      (L)
1 #CR         (N8/99)
1 #CR-TOP     (I4)
1 #REL-REC    (A80)

1 #CURRENT-CONTACT (N8)
1 #CONTACT-REC     (A79)

1 MEMBER VIEW OF A-STATUS
  2 ID-NUMBER
  2 MEMBER-CONTACT-ID
  2 MEMBER-FLAG
  2 WIDOW-FLAG
  2 DATE-OF-BIRTH 2 redefine DATE-OF-BIRTH
    3 FILLER 4X
    3 #MMDD  (A4)
  2 ISSUE-DATE (1)

1 XML_SERIALZE_OUTPUT (A) DYNAMIC
1 #CSV-LINE           (A) DYNAMIC
1 #CRM-Result         (A) DYNAMIC
1 #CONTACT            (I4) CONST <2>
1 #RELATIONS          (I4) CONST <3>
1 #REL-CN             (A6) 1 REDEFINE #REL-CN
  2 #REL-CN-N  (N6)
END-DEFINE

DEFINE WORK FILE 5 '/usr/SAG/tmp/CNRelFixLog.txt'
  TYPE 'ASCII'

DEFINE WORK FILE 4 '/usr/SAG/tmp/CNRelFix.txt'
  TYPE 'ASCII'

R1.
READ WORK 4 #REL-CN
  move right #REL-CN to #REL-CN
  FIND MEMBER WITH ID-NUMBER = #REL-CN-N
    CALLNAT 'MBRREL'
      MEMBER-CONTACT-ID
      XML_SERIALZE_OUTPUT
      #CSV-LINE
      #CRM-RESULT
      #RELATIONS
  END-FIND
END-WORK

ON ERROR
  MOVE EDITED *TIMX (EM=YYYYMMDD,HH:II:SS) TO #END-TIME
  COMPRESS  *PROGRAM *ERROR-NR *ERROR-LINE  #END-TIME INTO #REL-REC
  WRITE WORK 5 #REL-REC
  CLOSE WORK 5
END-ERROR

END
