* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Request from SSRS - List of policies/emails to be sent
* Object name - RQSTN001
***********************************************************************
*        MODIFICATION LOG
***********************************************************************
* USER   DATE      TAG  REASON
* YAK    08032010       Initial Creation
***********************************************************************
*
DEFINE DATA PARAMETER
*
1 REQUEST-DATA      (A) DYNAMIC
1 RESPONSE-DATA     (A) DYNAMIC         /* Out
*
LOCAL
1 LT-V VIEW OF A-LETTERS
  2 LAST-LOAD-DATE
  2 INSURED-CN
  2 POLICY-NUMBER
  2 TEMPLATE-NAME                     
  2 EMAIL-ADDRESS            
  2 DATE-SENT         
  2 IS-SENT
*
1 #ErrorMessage                       (A) DYNAMIC
1 #REQUEST-DATE                       (N8)
1 #REQUEST-DATE-START                 (N8)
1 REDEFINE #REQUEST-DATE-START
  2 #REQUEST-YYYYMM                   (N6)
  2 #REQUEST-DD                       (N2)
1 XML                                 (A) DYNAMIC
1 #END-OF-LINE                        (A1) CONST <H'0A'> 
*
END-DEFINE
*
XML := REQUEST-DATA
EXAMINE XML FOR '<EmailList>'  DELETE
EXAMINE XML FOR '</EmailList>' DELETE
XML   := *TRIM(XML)
IF XML IS (N8)
  #REQUEST-DATE := VAL(XML)
ELSE
  COMPRESS '<EmailList>' '<ErrorMessage>' #ErrorMessage '</ErrorMessage>' '</EmailList>'
    INTO RESPONSE-DATA LEAVING NO
  ESCAPE ROUTINE
END-IF
*
XML := '<EmailList>'
COMPRESS XML #END-OF-LINE INTO XML LEAVING NO
* #REQUEST-DATE-START := #REQUEST-DATE
RESET #REQUEST-DD
READ LT-V WITH LAST-LOAD-DATE = #REQUEST-DATE
*   WHERE IS-SENT = ' ' AND (TEMPLATE-NAME = 'PP_PAPER_EML' OR TEMPLATE-NAME = 'PP_SAT_ALL_EML' OR TEMPLATE-NAME = 'PP_E_DEL_ALL_EML' OR
*   TEMPLATE-NAME = 'RT_EML_REN_5M' OR TEMPLATE-NAME = 'RT_EML_REN_3M' OR TEMPLATE-NAME = 'FBR_EML'
*      OR = 'EZ_EML_INC_2M' OR = 'LTII_EML_1M_' OR = 'LTII_EML_3M_' OR = 'LTII_PLUS_EML')
*  WHERE IS-SENT = ' ' AND (TEMPLATE-NAME = 'BDAY_EML' OR TEMPLATE-NAME = SCAN('AT'))
*   WHERE IS-SENT = ' ' AND TEMPLATE-NAME = 'BDAY_EML'
*   WHERE IS-SENT = ' ' AND (TEMPLATE-NAME = 'RT_EML_REN_5M' OR TEMPLATE-NAME = 'RT_EML_REN_3M' OR TEMPLATE-NAME = 'FBR_EML' 
*    OR = 'EZ_EML_INC_2M' OR = 'LTII_EML_1M_' OR = 'LTII_EML_3M_' ) 
* WHERE IS-SENT = ' ' AND (TEMPLATE-NAME = 'LTII_EML_1M_' OR TEMPLATE-NAME = 'LTII_EML_3M_')
 WHERE IS-SENT = ' ' AND TEMPLATE-NAME = 'LTI_EML_48Y_5M_N'
*
*  run before 1:30 pm
*   WHERE IS-SENT = ' ' AND (TEMPLATE-NAME = 'LTI_EML_50Y_5M_N' OR TEMPLATE-NAME = 'LTI_EML_50Y_3M_N' OR
*                            TEMPLATE-NAME = 'LTI_EML_50Y_1M_N' OR TEMPLATE-NAME = 'LTI_EML_55Y_5M_N' OR 
*                            TEMPLATE-NAME = 'LTI_EML_55Y_3M_N' OR TEMPLATE-NAME = 'LTI_EML_55Y_1M_N' OR 
*                            TEMPLATE-NAME = 'LTI_EML_60Y_1M_N' OR TEMPLATE-NAME = 'LTI_EML_60Y_3M_N' OR 
*                            TEMPLATE-NAME = 'LTI_EML_60Y_5M_N' OR TEMPLATE-NAME = 'LTI_EML_50Y_3M_S' OR 
*                            TEMPLATE-NAME = 'LTI_EML_50Y_3M_S' OR TEMPLATE-NAME = 'LTI_EML_50Y_5M_S' OR
*                            TEMPLATE-NAME = 'LTI_EML_38Y_5M_S' OR TEMPLATE-NAME = 'LTI_EML_38Y_3M_S' OR 
*                           TEMPLATE-NAME = 'LTI_EML_40Y_3M_S' OR TEMPLATE-NAME = 'LTI_EML_40Y_1M_S' OR 
*                           TEMPLATE-NAME = 'LTI_EML_40Y_5M_S' OR TEMPLATE-NAME = 'LTI_EML_48Y_5M_N' OR
*                           TEMPLATE-NAME = 'LTI_EML_50Y_3M_S' OR TEMPLATE-NAME = 'LTI_EML_50Y_5M_S' OR 
*                           TEMPLATE-NAME = 'LTI_EML_45Y_3M_S' OR TEMPLATE-NAME = 'LTI_EML_45Y_1M_S' OR
*                           TEMPLATE-NAME = 'LTII_EML_1M_' OR TEMPLATE-NAME = 'LTII_EML_3M_' OR
*                           TEMPLATE-NAME = 'FBR_EML' OR TEMPLATE-NAME = 'EZ_EML_INC_2M' ) 
*
*                          
*   WHERE IS-SENT = ' ' AND (TEMPLATE-NAME = 'BDAY_EML' OR TEMPLATE-NAME = 'FBR_EML' OR = 'EZ_EML_INC_2M' OR = 'GP2_DB_EML' OR = 'GPL_DB_EML' 
*                 OR = 'GPL_DB_EML_30' OR = 'GPL_GIPO_EML_60_30' )
  IF LAST-LOAD-DATE > #REQUEST-DATE
    ESCAPE BOTTOM
  END-IF
  IF LT-V.EMAIL-ADDRESS <> ' '
*     COMPRESS XML '<Policy number="' LT-V.POLICY-NUMBER '"' INTO XML LEAVING NO
*     COMPRESS XML 'email=' INTO XML 
*     COMPRESS XML '"' LT-V.EMAIL-ADDRESS '"/>' INTO XML LEAVING NO
    COMPRESS XML '<EmailItem>'
                 '<PolicyNumber>' LT-V.POLICY-NUMBER '</PolicyNumber>'
                 '<EmailAddress><![CDATA[' LT-V.EMAIL-ADDRESS ']]></EmailAddress>'
                 '</EmailItem>' INTO XML LEAVING NO
  END-IF   
END-READ
COMPRESS XML '</EmailList>' INTO XML LEAVING NO
RESPONSE-DATA := XML
*
END
