* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
LOCAL
1 #CN                 (N6)
1 #CRM-Result         (A) DYNAMIC
END-DEFINE
*
INPUT #CN
IF #CN > 0
  CALLNAT 'MBRSVCY'
    #CN
    #CRM-RESULT
END-IF
PRINT #CRM-RESULT
END

