* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Web Application Online
* Member Information module
*
********************************************************
*        MODIFICATION LOG
********************************************************
* USER   DATE      TAG  REASON
* YAK    03092009       Initial Creation
********************************************************
*
* DEFINE DATA PARAMETER
*
define data
*
LOCAL USING PARSER-X
LOCAL USING GPRA0003
LOCAL
1 PROCESS-NAME      (A8)
1 REQUEST-DATA      (A1024)
1 RESPONSE-DATA     (A1024)        /* Out
1 RETURN-CODE       (A4)           /* Out
1 RETURN-MESSAGE    (A100)         /* Out
1 RETURN-MSG        (A78)         
*
* 1 POLICY-NUMBER (A) DYNAMIC
* 1 MEMBER-CN     (A) DYNAMIC
* 1 OWNER-CN      (A) DYNAMIC
1 RequestInfo
  2 PolicyNumber  (A16)
  2 SSN4          (A4)
*
LOCAL
1 XML_PARSER_XPATH             (A) DYNAMIC
1 XML_PARSER_XPATH_TYPE        (A1)
1 XML_PARSER_CONTENT           (A) DYNAMIC
1 XML_PARSER_CONTENT_IS_EMPTY  (L)
1 XML_PARSER_INPUT   (A) DYNAMIC
1 XML_PARSER_ERROR_TEXT        (A253)
1 XML_PARSER_RESPONSE          (I2)
*
END-DEFINE
*
* EDS PERM ADDR. 6710 BETHLEHEM RD RICHMOND VA 23230
* EDS (804-266-6261) LOAN TO AFB
* into request-data leaving no
*
* RESET RESPONSE-DATA
* COMPRESS
* '<CNInfo><CN>57387</CN></CNInfo>'
* '<MemberPhones>'
*   '<ActionType>0</ActionType>'
*   '<ErrorCode>0</ErrorCode>'
*   '<CN>67781</CN>'
* '</MemberPhones>'
* '<Members>'
*   '<CN>121429</CN>'
* '</Members>'
*
* '<MemberPhones>'
*   '<ActionType>0</ActionType>'
*   '<ErrorCode>0</ErrorCode>'
*   '<UserID />'
*   '<CN>146857</CN>'
*   '<PhoneInfo>'
*     '<ActionType>2</ActionType>'
*     '<ErrorCode>0</ErrorCode>'
*     '<PhoneID>64513</PhoneID>'
*     '<DialNumber>6104654</DialNumber>'
*     '<AreaCode>904</AreaCode>'
*     '<PhoneType>C</PhoneType>'
*     '<Type>D</Type>'
*     '<Preferred>N</Preferred>'
*     '<Extension />'
*   '</PhoneInfo>'
*   '<PhoneInfo>'
*     '<ActionType>2</ActionType>'
*     '<ErrorCode>0</ErrorCode>'
*     '<PhoneID>64515</PhoneID>'
*     '<DialNumber>2918194</DialNumber>'
*     '<AreaCode>904</AreaCode>'
*     '<PhoneType>H</PhoneType>'
*     '<Type>D</Type>'
*     '<Preferred>Y</Preferred>'
*     '<Extension />'
*   '</PhoneInfo>'
* '</MemberPhones>'
* '<CNInfo>'
*   '<CN>42080</CN>'
* '</CNInfo>'
* INTO REQUEST-DATA LEAVING NO
REQUEST-DATA := '186144'
*
* PROCESS-NAME := 'UpdateContactInfo'
* PROCESS-NAME := 'UpdateAddress'
* PROCESS-NAME := 'GetAddress'
* PROCESS-NAME := 'UpdateFamilyInfo'
* PROCESS-NAME := 'UpdateEmail'
* PROCESS-NAME := 'GetPolicyInfo'
* PROCESS-NAME := 'UpdatePhone'
* PROCESS-NAME := 'GetPayments'
PROCESS-NAME := 'OAPPMINF'
*
CALLNAT 'NATSERV1' PROCESS-NAME REQUEST-DATA RESPONSE-DATA RETURN-CODE RETURN-MESSAGE
* repeat
RETURN-Msg := RESPONSE-DATA
WRITE RETURN-MSG
* if *length(RESPONSE-DATA) > 78
*  RETURN-MESSAGE := substr(RESPONSE-DATA,79)
* else
*   escape bottom
* end-if
* end-repeat
END

