* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Request from SSRS - List of policies/emails to be sent
* Object name - RQSTN001
***********************************************************************
*        MODIFICATION LOG
***********************************************************************
* USER   DATE      TAG  REASON
* YAK    08032010       Initial Creation
***********************************************************************
*
DEFINE DATA PARAMETER
*
1 REQUEST-DATA      (A) DYNAMIC
1 RESPONSE-DATA     (A) DYNAMIC         /* Out
*
LOCAL
1 LT-V VIEW OF A-LETTERS
  2 LAST-LOAD-DATE
  2 INSURED-CN
  2 POLICY-NUMBER                     
  2 EMAIL-ADDRESS            
  2 DATE-SENT         
*
1 #ErrorMessage                       (A) DYNAMIC
1 #REQUEST-DATE                       (N8)
1 #REQUEST-DATE-START                 (N8)
1 REDEFINE #REQUEST-DATE-START
  2 #REQUEST-YYYYMM                   (N6)
  2 #REQUEST-DD                       (N2)
1 XML                                 (A) DYNAMIC
1 #END-OF-LINE                        (A1) CONST <H'0A'> 
*
END-DEFINE
*
XML := '<EmailList>'
COMPRESS XML '<Policy number="' '200521-1' '"' INTO XML LEAVING NO
    COMPRESS XML 'email=' INTO XML 
    COMPRESS XML '"' 'ykegeles@aafmaa.com' '"/>' INTO XML LEAVING NO
    COMPRESS XML '</EmailList>' INTO XML LEAVING NO
*
RESPONSE-DATA := XML
*
END
