DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 CC-PAYMENT /*
  2 USER (A) DYNAMIC
  2 ID-NUMBER (N6.0) /*
  2 C@PAY-POLICY (N2.0) /*
  2 PAY-POLICY (1:9)
    3 POLICY-NBR (A) DYNAMIC
    3 C@APPLIED-PAYMENT (N2)
    3 APPLIED-PAYMENT (1:10)
      4 RESULT-MESSAGE (A100)
      4 TRAN-TYPE (A6) /*
      4 DUE-AMOUNT (N5.2) /*
      4 PLAN-TYPE (A3)
  2 CASH-CODE (A1)
END-DEFINE
