DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #CC-STORAGE-FIELDS
  2 Action (A) DYNAMIC
  2 CNumber (A) DYNAMIC
  2 CardNumber (A) DYNAMIC
  2 CardExpDate (A) DYNAMIC
  2 CardGUID (A) DYNAMIC
  2 ApplicationSource (A) DYNAMIC
  2 UserId (A) DYNAMIC
  2 ResultStatus (A) DYNAMIC
  2 ResultMessage (A) DYNAMIC
END-DEFINE
