* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Start "Preliminary Credit Card Apply" Job
* Called from Credit Card console application to
* start a job on UNIX
*
********************************************************
*        MODIFICATION LOG
********************************************************
* USER   DATE      TAG  REASON
* YAK    02162010       Initial Creation
* YAK    02162010  YK1  Changes for Bill Cycle runs
********************************************************
*
DEFINE DATA PARAMETER
1 PROCESS-NAME      (A8)
LOCAL
1 #I                (N1)
1 #COMMAND          (A) DYNAMIC
1 #CC-RUN-CMD       (A) DYNAMIC
  INIT <'/usr/SAG/cronus/.scripts/T4CYCCRD.bsh'>
1 #PRINT-DOC-CMD    (A) DYNAMIC
  INIT <'/usr/SAG/cronus/.scripts/printDocuments.bsh'>
1 #DATE              (A) DYNAMIC      /* YK1
1 #LAST-BUSINESS-DAY (N8)             /* YK1
1 #DATN              (N8)             /* YK1
END-DEFINE
*
#DATN := *DATN
DECIDE ON FIRST VALUE PROCESS-NAME
  VALUE 'CCARDRUN'
* YK1 >
    #DATE := FUNCTION-CALENDAR(<#DATN,'8'>)
    #LAST-BUSINESS-DAY := VAL(#DATE)
    IF #LAST-BUSINESS-DAY = #DATN
      #I := 7               /* To indicate to run T4CYCCR7
    ELSE
      #I := 8
    END-IF
* < YK1
    COMPRESS #CC-RUN-CMD #I '>/dev/null' INTO #COMMAND
    CALL 'SHCMD' #COMMAND
  VALUE 'PRINTDOC'
    COMPRESS #PRINT-DOC-CMD '>/dev/null' INTO #COMMAND
    CALL 'SHCMD' #COMMAND
  NONE
    IGNORE
END-DECIDE
*
END
