DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 MEMBER-INFO
  2 CN (A6)
  2 RANK (A3)
  2 ANN-REP-MAIL-CODE (A1)
  2 FAX (A10)
  2 FAX-SUFFIX (A6)
  2 WORK-PHONE (A10)
  2 WORK-PHONE-SUFFIX (A6)
  2 HOME-PHONE (A10)
  2 HOME-PHONE-SUFFIX (A6)
  2 EMAIL (A) DYNAMIC
  2 ZIP (A10)
  2 ADDRESS2 (A) DYNAMIC
  2 ADDRESS1 (A) DYNAMIC
  2 ADDRESS3 (A) DYNAMIC
END-DEFINE
