* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* WS_TEST - test E-Check request to SAGE
* Accepts Request Data from IAS and calls WebService that communicates with SAGE
* Called from - RUN_TEST
*
**********************************************************
*        MODIFICATION LOG
**********************************************************
DEFINE DATA
LOCAL
*
1 #RESPONSE-MSG   (A)  DYNAMIC
1 #RC             (N4)
1 v_Env            (A) DYNAMIC
1 v_Res            (A) DYNAMIC
1 v_RC             (I4)
1 v_NAT_RC         (I4)
1 URL_Test         (A)  DYNAMIC  INIT <"http://172.16.7.173:6666/api/checksale/PostCheckSaleIAS">
* 1 URL_Prod         (A)  DYNAMIC  INIT <"http://192.168.50.22:443/api/checksale/PostCheckSaleIAS">
1 URL_Prod         (A) DYNAMIC INIT <"https://sagewebapiservice.aafmaa.com/api/checksale/PostCheckSaleIAS">
1 #request (a) dynamic
1 ErrorText               (A55)
1 Message                 (A) DYNAMIC
1 #DISPLAY-MSG            (A78)
1 #ERROR-CODE             (A3)
1 Result                  (A152)
1 ParsedResult            (A150)
1 REDEFINE ParsedResult
  2 Field1                (A21)
  2 ApprovalIndicator     (A1)
  2 Field2                (A13)
  2 EMessage              (A32)
  2 Field3                (A10)
  2 Code                  (A6)
  2 Field4                (A15)
  2 Reference             (A10)
  2 Field5                (A19)
  2 RiskIndicator         (A2)
  2 Field6                (A13)
  2 Invoice               (A6)
*
END-DEFINE
*
* DEFINE sbr_Test_wsIAS
* #request := '={"RoutingNumber":"051000017","AccountNumber":"1223124241241","AccountType":"SAV","Amount":"1","UserLoginName":"ngorbatovskikh","ApplicationSource":"WebCharge",'
* compress #request '"FirstName":"Natasha","LastName":"Gorbatovskikh","Street":"1090 Old Reston Ave","City":"Reston","State":"VA","ZipCode":"20190","CNumber":"12222"}'
* #request := '={"RoutingNumber":"111111111","AccountNumber":"1223124241241","AccountType":"DDS","Amount":"1","UserLoginName":"ngorbatovskikh","ApplicationSource":"WebCharge",'
* compress #request '"FirstName":"Natasha","LastName":"Gorbatovskikh","Street":"1090 Old Reston Ave","City":"Reston","State":"VA","ZipCode":"20190","CNumber":"12222"}'
#request := '={"RoutingNumber":"031302777","AccountNumber":"3217111347","AccountType":"DDA","Amount":"1","UserLoginName":"ngorbatovskikh","ApplicationSource":"WebCharge",'
compress #request '"FirstName":"Natasha","LastName":"Gorbatovskikh","Street":"1090 Old Reston Ave","City":"Reston","State":"VA","ZipCode":"20190","CNumber":"12222"}'
  into #request leaving no
REQUEST DOCUMENT FROM URL_Prod
  WITH DATA
      NAME ' ' VALUE #request
  RETURN
    PAGE v_Res
RESPONSE v_RC
*
WRITE 'Response Code = ' v_RC
REPEAT
#DISPLAY-MSG := v_Res
WRITE #DISPLAY-MSG
IF *LENGTH(v_Res) > 78
 v_Res := SUBSTR(v_Res,79)
ELSE
  ESCAPE BOTTOM
END-IF
END-REPEAT
* ApprovalIndicator := SUBSTR(v_Res,23,1)
* Message           := SUBSTR(v_Res,37,25)
* RESET ErrorText
* EXAMINE v_Res FOR '{' DELETE
* EXAMINE v_Res FOR '}' DELETE
* EXAMINE v_Res FOR '"' DELETE
* ParsedResult := v_Res
* write Field1
* write  ApprovalIndicator 
* write Field2
* write  EMessage
* write Field3
* write  Code 
* write Field4                 
* write  Reference
* write Field5
* write  RiskIndicator
* write Field6
* write  Invoice
* Code := 900016
* #ERROR-CODE       := SUBSTR(Code,4,3)
* ErrorText := F-ERROR-DESCRIPTION(<#ERROR-CODE>)
* write 'text = ' ErrorText
* END-SUBROUTINE
*
END
