* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program ADHSOLA1.
/**
/** :author nguentchev
/* TODO Enter your code here
DEFINE DATA LOCAL
1 AT-V VIEW OF A-APPL-TRACKING
  2 PLAN (A3)
  2 AT-STATUS (A2)
END-DEFINE
FIND AT-V WITH ID-NUMBER = 551174
print at-v
*  AT-STATUS := 'U6'
    PLAN := 'LT'
   UPDATE
   END TRANSACTION
END-FIND
END
