* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program ADHSOLA1.
/**
/** :author nguentchev
/* TODO Enter your code here
DEFINE DATA LOCAL
1 AT-V VIEW OF A-APPL-TRACKING
  2 ID-NUMBER (N6)
  2 PLAN      (A3)
  2 AT-STATUS (A2)
END-DEFINE
**FIND AT-V WITH ID-NUMBER = 551174
FIND AT-V WITH AT-GUID = 'c03e3780-19eb-e711-80dc-005056a21fa2'
print at-v
*  AT-STATUS := 'U6'
*     PLAN := 'LT'
*    UPDATE
*    END TRANSACTION
END-FIND
END
