DB: 000 FILE: 063  - A-BENEFIT-EXPLANATIONS           DEFAULT SEQUENCE:

T L DB Name                              F Leng  S D Remark
- - -- --------------------------------  - ----  - - ------------------------
*      >Natural Source Header 000000
*      :CP
*      ISO_8859-1:1987
*      
*      :LineIncrement 10
*      <Natural Source Header
*   CREATED 08/23/88 DRW
P 1 AA BENE-EXPL-LINES
  2 BA BENE-EXPLANATION                  A   75  N
