* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program ADHSOLA4.
/**
/** :author nguentchev
define data
local
1 cnt-v view of a-contacts
  2 contact-id
  2 id-number
  2 CRM-CONTACT-GUI
  2 first-name
  2 last-name
end-define
/* 
find cnt-v with CRM-CONTACT-GUI = '80ec84e3-1359-e811-80d0-005056a25fd8'
  print cnt-v
  DELETE
  END TRANSACTION
end-find
END
