* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program ADHSOLA6.
/**
/** :author nguentchev
/* TODO Enter your code here
define data
local
1 #Insured-CN  (N6)
1 #Payer-CN    (N6)
1 CCSageGuid   (A32)
1 #Msg         (A) Dynamic
end-define
CCSageGuid := '3eefbe1832bb4f7eb0a2601d4a82dd2a'
#Insured-CN := 215232
END
