* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program ATSYNC.
/**
/** :author nguentchev
/* 
define data 
LOCAL USING LWSLRQST
local
1 AP-Tracking view of A-APPL-TRACKING
  2 ID-NUMBER      (N6)
  2 CONTACT-ID     (N8)
  2 DATE-RECEIVED  (N8)
  2 USER-SOURCE    (A3)
  2 AT-STATUS      (A2)
  2 INTRO-FLAG     (A1)
  2 SMOKER-FLAG    (A1)
  2 INS-ONLY       (A1)
  2 POLICY-TYPE    (A1)
  2 MIL-SERVICE    (A3)
  2 MIL-STATUS     (A1)
  2 NAME           (A25)
  2 RANK           (A3)
  2 SSN            (N9)
  2 DATE-OF-BIRTH  (N8)
  2 SEX            (A1)
  2 MEMBER-CN      (A6) 2 REDEFINE MEMBER-CN
    3 MEMBER-CN-N  (N6)
  2 REFERING-ID-NUMBER (N6/1:9)
  2 NOTES          (A75/40) 2 REDEFINE NOTES
    3 NOTES-A (I1/3000)
  2 ST-NOTE-USER   (A3/1)
  2 ST-NOTE-STATUS (A2/1)
  2 ST-NOTE-DATE (N8/1) 2 redefine ST-NOTE-DATE
    3 ST-NOTE-DATE-A (A8)

  2 PLAN           (A3)
  2 FACE-AMT-DOLS  (N3.0)
  2 FACE-AMT-UNITS (N4.0)
  2 RATING-CODE    (A1)
  2 RATE-DATE      (N8)
  2 WEIGHT         (N3.0)
  2 HEIGHT-IN      (N2.0)
  2 HEIGHT-FT      (N2.0)
  2 MODE           (A1)
  2 PAYER          (A1)
  2 YES-ON-MED     (A1)

  2 APPL-SOURCE    (A7)
  2 CAP-IND        (A1)
  2 E-DEPOSIT-IND  (A1)
  2 CRM-APPL-ID    (A50)  /* Quote ID = Obsolete
  2 AT-GUID        (A50)  /* IASOrder.CrmApplicationID
  2 DRIVERS-LICENSE-NUM (A20)
  2 STATE-ISSUED   (A2)
1 #POLICY-ID      (A16)
1 #DESIGNATION-ID (N8)
1 ErrorMsg        (A) dynamic
end-define

read AP-Tracking
  if DATE-RECEIVED >= 20170101
      and AT-STATUS = 'S7'
    CALLNAT 'LWSNSRV' APPLCTN-GET-REQ
      CONTACT-ID
      #POLICY-ID
      ID-NUMBER
      #DESIGNATION-ID
      ErrorMsg 
    separate ErrorMsg into NAME AT-GUID  with delimiter '='
    CALLNAT 'LWSNSRV' APPLCTN-REQ
      CONTACT-ID
      #POLICY-ID
      ID-NUMBER
      #DESIGNATION-ID
      ErrorMsg
    print
      ID-NUMBER
      CONTACT-ID
      DATE-RECEIVED
      USER-SOURCE
      AT-STATUS
      INTRO-FLAG
      SMOKER-FLAG
      INS-ONLY
      POLICY-TYPE
      MIL-SERVICE
      MIL-STATUS
      AT-GUID
  end-if
end-read
END
