DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 INPUT-DATA
  2 #CN-NUMBER (A) DYNAMIC
  2 #POLICY-NUMBER (A) DYNAMIC
  2 #BILL-TYPE (A) DYNAMIC
  2 #PREM-CODE (A) DYNAMIC
  2 #PREM-AMOUNT (A) DYNAMIC
  2 #LOAN-CODE (A) DYNAMIC
  2 #LOAN-AMOUNT (A) DYNAMIC
  2 #CAP-LOAN-AMOUNT (A) DYNAMIC
  2 #OTHER-AMOUNT (A) DYNAMIC
  2 #REJ-CODE (A) DYNAMIC
  2 #ERROR (A1)
END-DEFINE
