* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
* Create cn for AT
*
DEFINE DATA
LOCAL
1 #CONTACT-ID       (N8)
1 #AT-NUMBER        (N6)
1 #RESPONCE         (A) DYNAMIC

END-DEFINE
*
INPUT ' Please enter AT#' #AT-NUMBER
  /  'and Contact ID' #CONTACT-ID
CALLNAT 'GOATN001'
  #CONTACT-ID
  #AT-NUMBER
  #RESPONCE
*
IF #RESPONCE = ' '
  END TRANSACTION
END-IF
*
END
