* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ADAREP     ** REPLACES ADAREP INSIDE JCLS 
*                        ** DSDCTH10 AND DSDCTH30 
*
DEFINE DATA
LOCAL 
1 #COMMAND(A200) 
END-DEFINE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
MOVE '/usr/SAG/AAFMAA/scripts/adabas_report 223' 
TO #COMMAND 
CALL 'SHCMD' #COMMAND 
*
END
