* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ADASAV     ** REPLACES ADASAV INSIDE JCLS 
*                        ** DSDCTH10, DSDCTH22, DSDCTH30 AND DSDCTH34 
*
DEFINE DATA
LOCAL 
1 #COMMAND(A100) 
END-DEFINE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 
FORMAT LS=110 
INPUT #COMMAND 
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 
**MOVE '/usr/SAG/AAFMAA/scripts/adabackup -d 223 -v 7' 
**TO #COMMAND 
* 
WRITE '=' #COMMAND 
* 
CALL 'SHCMD' #COMMAND 
*
END
