* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION FUNCTION-FIND-NUMBER RETURNS (L) 
DEFINE DATA
PARAMETER
1 #ADDRESS-POOL-ID  (N8)
LOCAL
1 CNT-ADDR-V VIEW OF A-ADDRESS-RELATIONSHIP
END-DEFINE
*
FIND NUMBER CNT-ADDR-V WITH ADDRESS-POOL-ID = #ADDRESS-POOL-ID
IF *NUMBER(0014) = 1
  MOVE TRUE TO FUNCTION-FIND-NUMBER
END-IF
*
END-FUNCTION
*
END
