* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
PARAMETER
1 #CONTACT-ID    (N8)
1 #SIZE          (I4)
1 #ISN           (P8/1:V)
LOCAL
1 EMAIL-V VIEW OF A-CONTACT-EMAIL
  2 EMAIL-ID
  2 CONTACT-ID

END-DEFINE

RESET #SIZE #ISN (*)
IF #CONTACT-ID = 0
  ESCAPE ROUTINE
END-IF

FIND EMAIL-V WITH CONTACT-ID = #CONTACT-ID
  ADD 1 TO #SIZE
  #ISN ( #SIZE ) := *ISN
END-FIND

END
