* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM ID ADRN0016
*
* TMT 10/08/2013 TT1 ADDRESS NORMALIZATION
* bz-Name-C 07/07/2017     Fine Names. Keep all capital  
DEFINE DATA
PARAMETER
1 #CONTACT-ID   (N8)
1 #ADDRESS      (A43/1:V)
LOCAL USING ADDA0001          /* Address parameter area ADDN0001
LOCAL
*                          Rank data
1 BLANK               (A1) CONST <' '>
1 #PASS-COMMAND       (A2)
1 #RANK-PASS          (A3)
1 #MILITARY-SERVICE   (A3)
1 #EDIT               (L)
1 #RANK-PAY-TBL-DISPL (P2)
1 #RANK-LITERAL       (A23)
1 #RANK-DISPLAY       (A5)
*
1 #RANK-ABBR          (A) DYNAMIC
1 #LETTER-ENV         (A) DYNAMIC
1 #SALUTATION         (A) DYNAMIC
1 #SALUTATION-WITH-NAME (A) DYNAMIC
*
END-DEFINE
*
#LETTER-ENV := '!LETTER'             /* bz-Name-C
CALLNAT 'GPRS0CNT'
  #CONTACT-ID
  #LETTER-ENV
#ADDRESS (1)    := #LETTER-ENV
#ADD-TYPE       := 'P'  /* Primary
#ADD-CONTACT-ID := #CONTACT-ID
CALLNAT 'ADDN0001' #PDA-ADDRESS
#ADDRESS (2)    := #ADD-LINE-1
#ADDRESS (3)    := #ADD-LINE-2
#ADDRESS (4)    := #ADD-LINE-3
*
END
