* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
PARAMETER
1 #CODES
  2  #RANK-MIL-ID      (A10)
  2  #RANK-STATUS      (A10)
  2  #RANK-ABBR        (A10)
  2  #RANK-PROTECT     (A10)
1 #CODE-NAMES
  2  #RANK-MIL-ID-TXT      (A20)
  2  #RANK-STATUS-TXT      (A20)
  2  #RANK-ABBR-TXT        (A20)
  2  #RANK-PROTECT-TXT     (A20)
LOCAL
1 #CODE-NAME   (A) DYNAMIC
END-DEFINE

RESET #CODE-NAMES

*  'RANK MILITARY ID',             /*  24
#CODE-NAME     := 'RANK-MIL-ID'
#RANK-MIL-ID-TXT := FUNCTION-RANK-CODES(<#CODE-NAME,#RANK-MIL-ID>)
*  'RANK STATUS',             /* 25
#CODE-NAME   := 'RANK-STATUS'
#RANK-STATUS-TXT := FUNCTION-RANK-CODES(<#CODE-NAME,#RANK-STATUS>)
*  'RANK ABBR',            /* 26
#CODE-NAME    := 'RANK-ABBR'
#RANK-PROTECT-TXT := FUNCTION-RANK-CODES(<#CODE-NAME,#RANK-ABBR>)
*  'RANK PROTECT',            /* 27
#CODE-NAME    := 'RANK-PROTECTION'
#RANK-PROTECT-TXT := FUNCTION-RANK-CODES(<#CODE-NAME,#RANK-PROTECT>)

END
