* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
PARAMETER
1 #CODES
  2  #ADDR-INTL        (A1)     /* 1
  2  #ADDR-LOCATION    (A1)     /* 2
  2  #ADDR-OVERRD      (A1)     /* 3   Y/N
  2  #ADDR-PROTECT     (A1)     /* 4
  2  #ADDR-RETURNED    (A1)     /* 5   Y/N
  2  #ADDR-TYPE        (A1)     /* 6
  2  #ADDR-VALID       (A1)     /* 7
  2  #EML-PREF         (A1)     /* 8   Y/N
  2  #EML-PROTECT      (A1)     /* 9   Y/N
  2  #EML-TYPE         (A1)     /* 10
  2  #EML-UNDLV        (A1)     /* 11  Y/N
  2  #PH-INTL          (A1)     /* 12
  2  #PH-PREF          (A1)     /* 13
  2  #PH-TIME          (A1)     /* 14
  2  #PH-TYPE          (A1)     /* 15
  2  #PH-VALID         (A1)     /* 16
  2  #ADDR-SOURCE      (A1)
  2  #ADDR-STATUS      (A1)
  2  #XXX              (A1)
  2  #EML-STATUS       (A1)
1 #CODE-NAMES
  2  #ADDR-INTL-TXT        (A20)
  2  #ADDR-LOCATION-TXT    (A20)
  2  #ADDR-OVERRD-TXT      (A20)
  2  #ADDR-PROTECT-TXT     (A20)
  2  #ADDR-RETURNED-TXT    (A20)
  2  #ADDR-TYPE-TXT        (A20)
  2  #ADDR-VALID-TXT       (A20)
  2  #EML-PREF-TXT         (A20)
  2  #EML-PROTECT-TXT      (A20)
  2  #EML-TYPE-TXT         (A20)
  2  #EML-UNDLV-TXT        (A20)
  2  #PH-INTL-TXT          (A20)
  2  #PH-PREF-TXT          (A20)
  2  #PH-TIME-TXT          (A20)
  2  #PH-TYPE-TXT          (A20)
  2  #PH-VALID-TXT         (A20)
  2  #ADDR-SOURCE-TXT      (A20)
  2  #ADDR-STATUS-TXT      (A20)
  2  #XXX                  (A20)
  2  #EML-STATUS-TXT       (A20)
LOCAL
1 #CODE-NAME   (A) DYNAMIC
END-DEFINE

RESET #CODE-NAMES

*  'ADDR-LOCATION',           /* 2
#CODE-NAME     := 'ADDR-LOCATION'
#ADDR-LOCATION-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#ADDR-LOCATION>)
*  'ADDR-OVERRD',             /* 3   Y/N
#CODE-NAME   := 'ADDR-OVERRD'
#ADDR-OVERRD-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#ADDR-OVERRD>)
*  'ADDR-PROTECT',            /* 4
#CODE-NAME    := 'ADDR-PROTECT'
#ADDR-PROTECT-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#ADDR-PROTECT>)
*  'ADDR-RETURNED',            /* 5
#CODE-NAME    := 'ADDR-RETURNED'
#ADDR-RETURNED-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#ADDR-RETURNED>)
*  'ADDR-TYPE',               /* 6
#CODE-NAME    := 'ADDR-TYPE'
#ADDR-TYPE-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#ADDR-TYPE>)
*  'ADDR-VALID',              /* 7
#CODE-NAME    := 'ADDR-VALID'
#ADDR-VALID-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#ADDR-VALID>)
*  'ADDR-SOURCE'              /* 17
#CODE-NAME    := 'ADDR-SOURCE'
#ADDR-SOURCE-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#ADDR-SOURCE>)
*  'ADDR-STATUS'              /* 18
#CODE-NAME    := 'ADDR-STATUS'
#ADDR-STATUS-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#ADDR-STATUS>)
*  'PH-PREF',                 /* 13 Preferred Phone
#CODE-NAME   := 'PH-PREF'
#PH-PREF-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#PH-PREF>)
*  'PH-TIME',                 /* 14 Preferred time to call
#CODE-NAME   := 'PH-TIME'
#PH-TIME-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#PH-TIME>)
*  'PH-TYPE',                 /* 15 Phone type code
#CODE-NAME   := 'PH-TYPE'
#PH-TYPE-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#PH-TYPE>)
*  'PH-VALID',                /* 16
#CODE-NAME   := 'PH-VALID'
#PH-VALID-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#PH-VALID>)
*
#CODE-NAME   := 'EML-PREF'
#EML-PREF-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#EML-PREF>)
*
#CODE-NAME   := 'EML-PROTECT'
#EML-PROTECT-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#EML-PROTECT>)
*
#CODE-NAME   := 'EML-TYPE'
#EML-TYPE-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#EML-TYPE>)
*
#CODE-NAME   := 'EML-UNDLV'
#EML-UNDLV-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#EML-UNDLV>)

#CODE-NAME   := 'EML-STATUS'
#EML-STATUS-TXT := FUNCTION-ADDR-CODES(<#CODE-NAME,#EML-STATUS>)

END
