* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
************************************************************************
* PGM AFSCSTRT                        IN PRODUCTION >>> LIB SYSTEM
* PGM AFSCSTRT >>>>>>>>>>>>>>>>>>>>   IN TEST       >>> LIB TEST
*
* does general user logon-id check for CICS
* IF INVALID LOGS USER OFF
* LOGS USER ONTO PRODUCTION AAFMAA LIBRARY
*   THEN INVOKES SECURITY PROGRAM
* CREATED 08/30/88 DRW
* TT1 10/8/2013  ADDRESS NORMALIZATION
************************************************************************
*
DEFINE DATA
LOCAL
1 #INIT-USER (A8)
1 TERM-TM01 VIEW OF A-TERMINALS    /* tt1
 2 TERMINAL-ID   (A8)
END-DEFINE
*
SET KEY CLR='@R'     /* REFRESH DISPLAY
*
MOVE *INIT-USER TO #INIT-USER
* WRITE 'YOUR EDS LOGON-ID IS' *INIT-USER
* WRITE 'YOUR INIT-PROGRAM IS' *INIT-PROGRAM
* WRITE /// ' PRESS ENTER TO PROCEED'
FIND (1) TERM-TM01 WITH TERMINAL-ID = #INIT-USER
  IF NO RECORDS FOUND
    INPUT
      // 'Access denied in PROGRAM "AAFMSTRT"'
      // 'EDS LOGON-ID not on AAFMAA Security File'
      // 'or LOGON-ID has been suspended'
      // 'or password needs reset'
      // 'Call 1-888-263-4337 to have your password reset'
    STACK COMMAND 'FIN'
    STOP
  END-NOREC
END-FIND
*
STACK COMMAND 'LOGON AAFMAA'
STACK COMMAND 'AFSC'
*
STOP
*
END
