* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
************************************************************************
* PROGRAM-ID: AGEN0001 - Determine members age based on input date     *
************************************************************************
DEFINE DATA
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* PAM  07/28/2011  None    Program created                             *
************************************************************************
*
PARAMETER
*
1 #CN                        (N6)
1 #SEG                       (I2)
1 #AGE-OUT                   (N3)
*
LOCAL
1 ST-V VIEW OF A-STATUS
  2 MEMBER-CONTACT-ID
  2 PAID-UP-DATE             (9)
*
1 CT-V VIEW OF A-CONTACTS
 2 DATE-OF-BIRTH
*
1 #AGE                       (N8)
1 REDEFINE #AGE
 2 #AGE-YYYY                 (N4)
 2 #AGE-MMDD                 (N4)
*
END-DEFINE
************************************************************************
*
RESET #AGE-OUT
FIND (1) ST-V WITH ID-NUMBER = #CN
   FIND (1) CT-V WITH CT-V.CONTACT-ID = ST-V.MEMBER-CONTACT-ID
    COMPUTE #AGE = ST-V.PAID-UP-DATE (#SEG) - CT-V.DATE-OF-BIRTH
    #AGE-OUT := #AGE-YYYY
  END-FIND
END-FIND
*
END
