DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode R
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*
1 #PDA-EZPAY
  2 #MEMBER-NUM-EZPAY (N6.0)
  2 REDEFINE #MEMBER-NUM-EZPAY
    3 #MEMBER-NUM-EZPAY-A (A6)
  2 #SSN-EZPAY (N9.0)
  2 #EZPAY-CLERK (A3)
  2 #EZPAY-POL-INDEX (I2)
*
END-DEFINE
