* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ALOTNOTE - PROCESS FIN CENTER ALLOTMENT FILES
*
* * * * * *
* M O D I F I C A T I O N    L O G
*
* DRW 02/25/2009 DW1 Incease Note Occurances from 60 to 500
*
* * * * * * * * * * *
*
DEFINE DATA
LOCAL
1 #HOLD-CUR-ACCT-UPDT (N8)
1 #WORK-FREQ           (P2)
1 #MODAL-PREMIUM       (P5.2)
1 #LAST-MON-YYYYMMDD   (N8)
1 REDEFINE #LAST-MON-YYYYMMDD
 2 #LAST-MON-YYYY       (N4)
 2 #LAST-MON-MM         (N2)
 2 #LAST-MON-DD         (N2)
1 #SSN                  (N9)
1 #AMOUNT               (N4.2)
*
1 #JCL-PARM       (A10)
1 REDEFINE #JCL-PARM
 2 #JCL-MM            (N2)   /* DATE PARM 03/01/1999
 2 #JCL-X1            (A1)
 2 #JCL-DD            (N2)
 2 #JCL-X2            (A1)
 2 #JCL-YYYY          (N4)
*
1 #PARM-YYYYMMDD  (N8)
1 REDEFINE #PARM-YYYYMMDD
 2 #PARM-YYYY      (N4)
 2 #PARM-MM        (N2)
*
1 ST-V VIEW OF A-STATUS
 2 DTS-DATN
 2 DTS-TIMN
 2 ID-NUMBER
 2 REDEFINE ID-NUMBER
  3 ID-NUMBER-A   (A6)
 2 LINKED-CN      (40)
 2 REDEFINE LINKED-CN
  3 LINKED-CN-A   (A6/40)
 2 WIDOW-FLAG
 2 SSN
 2 INTRO-FLAG
 2 DATE-ACCT-UPDATE
 2 NAME
 2 ALOT-AMT
 2 ALT-LP-AMT
 2 ALT-LP-AMT-2
 2 DEBIT-CREDIT-AMT
 2 DUES-ALL-PAID-IND
 2 NUMBER-MEMBERSHIPS
 2 ISSUE-DATE          (9)
 2 STATUS              (9)
 2 PAY-STATUS          (9)
 2 PLAN                (9)
 2 MONTH-ALLOC-AMT     (9)
 2 MODE                (9)
 2 ANNUAL-PREM         (9)
 2 PAID-TO-DATE        (9)
*
1 LK-V VIEW OF A-STATUS
 2 ID-NUMBER      (N6)
 2 INTRO-FLAG
 2 WIDOW-FLAG
 2 ALOT-AMT
 2 DEBIT-CREDIT-AMT
 2 NUMBER-MEMBERSHIPS
 2 STATUS              (9)
 2 PAY-STATUS          (9)
 2 PLAN                (9)
 2 MODE                (9)
 2 ANNUAL-PREM         (9)
 2 ISSUE-DATE          (9)
 2 PAID-TO-DATE        (9)
 2 REDEFINE PAID-TO-DATE
  3 PAID-TO-DATE-OCC (9)
   4 PAID-TO-DATE-YYYYMM (N6)
   4 REDEFINE PAID-TO-DATE-YYYYMM
    5 PAID-TO-DATE-YYYY (N4)
    5 PAID-TO-DATE-MM   (N2)
   4 PAID-TO-DATE-DD   (N2)
*
1 AR-V VIEW OF A-ACCOUNTING-REGISTER
 2 ID-NUMBER             (N6)
 2 TRANSACTION-DATN      (P9)
 2 TRANSACTION-TIMN      (P7)
 2 TXN-CODE              (A4)
 2 SEQUENCE-NUM          (N1)
 2 NAME                  (A25)
 2 TXN-ACCT-NUMBER       (N3)
 2 ACCT-DATE             (N8)
 2 DATE-LAST-ACCT-UPDATE (N8)
 2 DEBIT-AMOUNT          (P7.2)
 2 CREDIT-AMOUNT         (P7.2)
 2 DESCRIPTION           (A20)
 2 MESSAGE-CODE          (A1)
 2 AALP-FLAG             (A1)
 2 CLERK-ID              (A3)
 2 TERMINAL-ID           (A8)
 2 CASH-CODE             (A1)
*
1 NT-V VIEW OF A-NOTES
 2 ID-NUMBER
 2 C*NOTE-TABLE                    /* DW1
 2 NOTE-TEXT    (500)              /* DW1
 2 REDEFINE NOTE-TEXT
  3 NOTE-TEXT-OCC  (500)
    4 NOTE-TEXT-60           (A60)
    4 REDEFINE NOTE-TEXT-60
     5 NOTE-TEXT-FILL1        (A14)
     5 NOTE-TEXT-ALOT-PAYS-CN (A6)
     5 NOTE-TEXT-FILL2        (A40)
    4 REDEFINE NOTE-TEXT-60
     5 NOTE-TEXT-FILL3           (A17)
     5 NOTE-TEXT-ALOT-PAID-BY-CN (A6)
     5 NOTE-TEXT-FILL4           (A37)
* temporary
    4 REDEFINE NOTE-TEXT-60
     5 FILL1A          (A18)
     5 ALLT-1          (A6)
     5 FILL1B          (A36)
    4 REDEFINE NOTE-TEXT-60
     5 FILL2A          (A17)
     5 ALLT-2          (A6)
     5 FILL2B          (A37)
    4 REDEFINE NOTE-TEXT-60
     5 FILL3A          (A14)
     5 ALLT-3          (A1)
     5 ALLT-4          (A1)
     5 FILL3B          (A44)
    4 REDEFINE NOTE-TEXT-60
     5 FILL5A          (A15)
     5 ALLT-5          (A6)
     5 FILL5B          (A39)
    4 REDEFINE NOTE-TEXT-60
     5 FILL6A          (A14)
     5 ALLT-6          (A6)
     5 FILL6B          (A40)
  1 #NT-UPDATE           (L)
*
1 ALOT-FILE-IN    (A80)
1 REDEFINE ALOT-FILE-IN    /* air force active - ongoing credit record
 2 FAC-CODE        (A1)   /* "1" ongoing credit
 2 FAC-SSN         (A9)
 2 FAC-NAME        (A20)
 2 FAC-ACCT-NUM    (A17)
 2 FAC-FILL-1      (A5)
 2 FAC-AMOUNT      (N4.2)
 2 FAC-FILL-2      (A1)
 2 FAC-EFF-DATE    (A4)    /* YYMM
 2 FAC-FILL-3      (A17)
1 REDEFINE ALOT-FILE-IN    /* air force active - stop/start record
 2 FAS-CODE        (A1)   /* "3" start/stop
 2 FAS-FILL-1      (A3)
 2 FAS-EFF-DATE    (A4)   /* YYMM
 2 FAS-NAME        (A20)
 2 FAS-FILL-2      (A1)
 2 FAS-AMOUNT      (N4.2)
 2 FAS-TYPE        (A1)   /* "C" = stop / "D" = start
 2 FAS-FILL-3      (A7)
 2 FAS-SSN         (A9)
 2 FAS-FILL-4      (A10)
 2 FAS-ACCT-NUM    (A17)
 2 FAS-FILL-5      (A1)
1 REDEFINE ALOT-FILE-IN    /* army active - ongoing credits
 2 AAC-CODE        (A03)    /* "622" ongoing credit
 2 AAC-FILL-1      (A26)
 2 AAC-AMOUNT      (N08.2)
 2 AAC-SSN         (A09)
 2 AAC-FILL-2      (A06)
 2 AAC-NAME        (A22)
1 REDEFINE ALOT-FILE-IN    /* retired - ongoing credits
 2 RC-FILL-1      (A01)
 2 RC-NAME        (A19)
 2 RC-FILL-2      (A33)
 2 RC-AMT-1       (A04)
 2 RC-FILL-3      (A01)
 2 RC-AMT-2       (A02)
 2 RC-FILL-4      (A02)
 2 RC-SSN-1       (A03)
 2 RC-FILL-5      (A01)
 2 RC-SSN-2       (A02)
 2 RC-FILL-6      (A01)
 2 RC-SSN-3       (A04)
 2 RC-FILL-7      (A01)
 2 RC-SERV        (A01)
 2 RC-STATUS      (A01)
 2 RC-FILL-8      (A02)
 2 RC-CODE        (A02)
*
1 STARTS-STOPS-REC  (A80)
1 REDEFINE STARTS-STOPS-REC
 2 AS-CN           (N6)
 2 AS-SERVICE      (A1)   /* A or F
 2 AS-SSN          (N9)
 2 AS-TYPE         (A1)   /* 1 = stop / 2 = start
 2 AS-REAS-CODE    (A2)
 2 AS-STATUS       (A1)   /* A or R
 2 AS-BLANKET-CODE (A3)
 2 AS-EFF-DATE     (A4)   /* YYMM
 2 AS-TERM-DATE    (A4)   /* YYMM
 2 AS-AMOUNT       (P9.2) /* takes 6 bytes
 2 AS-NAME         (A20)
 2 AS-FILL-1       (A14)
*
1 ALOT-REC    (A39)
1 REDEFINE ALOT-REC
 2 AL-SSN-A    (A9)
 2 REDEFINE AL-SSN-A
  3 AL-SSN     (N9)
 2 AL-SERV     (A1)
 2 AL-STATUS   (A1)
 2 AL-AMOUNT-A (A6)
 2 REDEFINE AL-AMOUNT-A
  3 AL-AMOUNT  (N4.2)
 2 AL-NAME     (A22)
*
1 VOUCHER-REC   (A50)
1 REDEFINE VOUCHER-REC
 2 V-SSN           (A9)
 2 V-NAME          (A20)
 2 V-AMOUNT        (N4.2)
 2 V-EFF-DATE      (A4)    /* yymm
 2 V-TYPE          (A1)
 2 V-STATUS        (A1)   /* A or R
 2 V-SERVICE       (A1)
 2 V-FILL-1        (A8)
*
1 #COUNTERS
 2 #RECS-READ        (P5)
 2 #RECS-SELECTED    (P5)
 2 #CNT              (P5)
 2 #CNT-2            (P5)
 2 #CNT-3            (P5)
 2 #CNT-4            (P5)
 2 #CNT-5            (P5)
 2 #CNT-6            (P5)
 2 #CNT-7            (P5)
 2 #I1               (I2)
 2 #I2               (I2)
 2 #I3               (I2)
*
1 #YYYYMMDD        (N8)
1 REDEFINE #YYYYMMDD
  2 #YYYY          (N4)
  2 #MM            (N2)
  2 #DD            (N2)
*
1 #TOT-MBR-G        (P5.2)
1 #TOT-LNK-G        (P5.2)
1 #LNK-G            (P5.2)
1 #MONS-DIFF        (P3)
1 #PREM-DIFF        (P5.2)
1 #MONS             (P3)
1 #REMAINDER        (P3.2)
*
1 #TOT-STOPS        (N5)
1 #TOT-STARTS       (N5)
1 #TOT-ST-SP-RECS   (N5)
1 #TOT-ONGO-RECS    (N5)
1 #TOT-VOUCHERS     (N5)
1 #ERROR        (A50)
1 #REJECT       (L)
1 #AMT-6-DISP   (A6)
1 #FOUND-AFSC   (L)
1 #ISN          (P8)
1 #AA-RECS      (N5)
1 #FA-RECS      (N5)
1 #XR-RECS      (N5)
1 #DFAS-SSN     (N9)
1 REDEFINE #DFAS-SSN
 2 #DFAS-SSN-A  (A9)
1 #DFAS-IN      (P5)
1 #AAFMAA-IN    (P5)
1 #LK-ALOT-AMT  (P5.2)
1 #MATCHED-LNK   (P5)
1 #NOTE-TEXT (A60/10)
1 #INT     (I2)
1 #CLERK   (A3)
1 #TOT-ALOT    (P5.2)
1 #PAYOR-CN      (N6)
1 REDEFINE #PAYOR-CN
2 #PAYOR-CN-A    (A6)
1 #PAYEE-CN   (N6)
1 REDEFINE #PAYEE-CN
 2 #PAYEE-CN-A  (A6)
1 #FOUND-PAID-BY  (L)
*
END-DEFINE
* * * * * * * * * * * * * * * * *
*
READ NT-V
  RESET #NT-UPDATE
  FOR #I1 1 TO C*NOTE-TABLE          /* DW1
    IF NOTE-TEXT (#I1) = MASK ('*#ALOT:PAID BY CN ')
      WRITE NT-V.ID-NUMBER 'b4' NOTE-TEXT (#I1)
      MOVE ALLT-1 (#I1) TO ALLT-2 (#I1)
      RESET FILL2B    (#I1)
      MOVE TRUE TO #NT-UPDATE
      WRITE NT-V.ID-NUMBER 'ft' NOTE-TEXT (#I1)
    END-IF
  END-FOR
*
  IF #NT-UPDATE
    UPDATE
  END-IF
*
  RESET #NT-UPDATE
  FIND (1) NT-V WITH ID-NUMBER = ST-V.ID-NUMBER
    FOR #I1 1 TO C*NOTE-TABLE                      /* DW1
      IF NOTE-TEXT (#I1) = MASK ('*#ALOT:PAYS CN ')
        WRITE NT-V.ID-NUMBER 'b4' NOTE-TEXT (#I1)
        IF ALLT-4 (#I1) NE '1'
          MOVE '0' TO ALLT-3 (#I1)
        ELSE
          MOVE ALLT-5 (#I1) TO ALLT-6 (#I1)
          RESET FILL6B    (#I1)
          MOVE TRUE TO #NT-UPDATE
        END-IF
        MOVE TRUE TO #NT-UPDATE
        WRITE NT-V.ID-NUMBER 'ft' NOTE-TEXT (#I1)
      END-IF
    END-FOR
*
    IF #NT-UPDATE
      UPDATE
    END-IF
  END-FIND
  END TRANSACTION
END-READ
*
END
