DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*            Index File Header
1 DOCUMENT
  2 DOCTYPE (A10)
  2 CN (A6)
  2 POL-NUM (A20)
  2 SUBMITDATE (A10)
  2 FILENAME (A50)
  2 DESCRIPTION (A50)
  2 CUSTOM (A1)
END-DEFINE
