* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
LOCAL
1 ID-NUMBER-YEAR-H VIEW OF A-INT-1099
  2 ID-NUMBER-YEAR-KEY
1 #INT-1099-KEY              (A13)
1 REDEFINE #INT-1099-KEY
  2 #INT-1099-ID-NUMBER       (N9)
  2 #INT-1099-YYYY            (N4)
  2 REDEFINE #INT-1099-YYYY
    3 #INT-1099-CENT           (N2)
    3 #INT-1099-YY             (A2)
*
1 INT-1099-V VIEW OF A-INT-1099
  2 SSN (N9)
  2 YEAR (N4)
  2 AMOUNT (P9.2)
  2 SSN-TAX-ID-IND (A1)
  2 RELATED-ID-NUMBER (N6)
  2 INT-TYPE (A1)
  2 GROSS-AMT (P9.2)
*  2 INSURED (A25)
  2 TYPE-1099 (A4)
  2 DATE-ENTERED (N8)
  2 BANKRUPTCY-IND (A1)
  2 CONTACT-ID (N8)
  2 CLAIMANT-ID (N8)
1 #EXCEL  (A250)
1 #TAB    (A1) CONST <H'09'>
1 #TITLE (A16/12) INIT <
  'SSN',
  'YEAR',
  'AMOUNT',
  'IND',
  'CN',
  'TYPE',
  'GROSS_AMOUNT',
  'TYPE_1099',
  'DATE',
  'BANKRUPTCY',
  'CONTACT',
  'CLAIMANT'
  >
1 #AMOUNT          (A13)
1 #GROSS-AMT       (A13)
*
1 CT-V VIEW OF A-CONTACTS
  2 CONTACT-ID
*
END-DEFINE
*
INPUT #INT-1099-ID-NUMBER
  #INT-1099-YYYY
HISTOGRAM ID-NUMBER-YEAR-H FOR ID-NUMBER-YEAR-KEY
    STARTING FROM #INT-1099-KEY
  MOVE ID-NUMBER-YEAR-KEY TO #INT-1099-KEY
  DISPLAY *NUMBER #INT-1099-KEY
END-HISTOGRAM
ESCAPE ROUTINE
* LIMIT 50000
*
DEFINE WORK FILE 1 '/usr/SAG/tmp/INT1099.txt'  TYPE 'ASCII-COMPRESSED'
COMPRESS FULL #TITLE (*) INTO #EXCEL WITH DELIMITER #TAB
WRITE WORK 1 #EXCEL
*

READ INT-1099-V
/* DESCENDING BY YEAR-INT-TYPE-ID-KEY
  FIND (1) CT-V WITH ID-NUMBER = RELATED-ID-NUMBER
    INT-1099-V.CONTACT-ID := CT-V.CONTACT-ID
  END-FIND
  IF INT-1099-V.INT-TYPE = 'A'
    FIND (1) CT-V WITH SSN = INT-1099-V.SSN
      INT-1099-V.CLAIMANT-ID := CT-V.CONTACT-ID
    END-FIND
  END-IF
  MOVE EDITED AMOUNT    (EM=Z(9).99) TO #AMOUNT
  MOVE EDITED GROSS-AMT (EM=Z(9).99) TO #GROSS-AMT
  COMPRESS FULL
    SSN
    YEAR
    #AMOUNT
    SSN-TAX-ID-IND
    RELATED-ID-NUMBER
    INT-TYPE
    #GROSS-AMT
    TYPE-1099
    DATE-ENTERED
    BANKRUPTCY-IND
    CONTACT-ID
    CLAIMANT-ID
    INTO #EXCEL WITH DELIMITER #TAB
  WRITE WORK 1 #EXCEL
  UPDATE (0072)
  END TRANSACTION
END-READ
END
