* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
LOCAL
1 #ZIP-CODE       (N9) 1 REDEFINE #ZIP-CODE
  2 #ZIP5  (N5)
  2 #ZIP4  (N4)
1 #FOUND   (I4)
1 #CN-SELECTED  (N6/1:140)
1 #ZIP-SELECTED (N9/1:140)
1 J        (I4)
END-DEFINE
*
INPUT #ZIP5 #ZIP4
CALLNAT 'ANZN0001' #ZIP-CODE #FOUND
  #CN-SELECTED (*)
  #ZIP-SELECTED (*)
FOR J 1 TO #FOUND
  DISPLAY #CN-SELECTED (J) #ZIP-SELECTED (J)
END-FOR
END

