* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* <Natural Source Header
/** New Subprogram AOCXAL2R.
/**
/** :author nguentchev
/* TODO Enter your code here
DEFINE DATA
PARAMETER
1 #AGE (P3) BY VALUE
1 #F   (F8)
LOCAL USING ATHISAL2
END-DEFINE
*
ADD 1 TO #AGE
#F := #A ( #AGE )
END
