* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
**                                     /* INSERTED FROM RCSBP
DEFINE DATA LOCAL
1 #RCSBP-TBL
2 #RC-T-C-Y-35 (A25)
INIT
<'0538-0521-0484-0435-0000-'>
2 #RC-T-C-Y-36 (A25)
INIT
<'0531-0515-0480-0431-0000-'>
2 #RC-T-C-Y-37 (A25)
INIT
<'0523-0509-0475-0428-0000-'>
2 #RC-T-C-Y-38 (A25)
INIT
<'0515-0503-0470-0424-0368-'>
2 #RC-T-C-Y-39 (A25)
INIT
<'0507-0496-0465-0420-0365-'>
2 #RC-T-C-Y-40 (A25)
INIT
<'0498-0489-0459-0415-0361-'>
2 #RC-T-C-Y-41 (A25)
INIT
<'0489-0481-0453-0410-0357-'>
2 #RC-T-C-Y-42 (A25)
INIT
<'0479-0473-0446-0405-0353-'>
2 #RC-T-C-Y-43 (A25)
INIT
<'0469-0464-0438-0399-0349-'>
2 #RC-T-C-Y-44 (A25)
INIT
<'0457-0453-0430-0392-0343-'>
2 #RC-T-C-Y-45 (A25)
INIT
<'0444-0441-0420-0384-0337-'>
2 #RC-T-C-Y-46 (A25)
INIT
<'0428-0428-0408-0374-0329-'>
2 #RC-T-C-Y-47 (A25)
INIT
<'0412-0413-0395-0363-0320-'>
2 #RC-T-C-Y-48 (A25)
INIT
<'0393-0395-0379-0350-0310-'>
2 #RC-T-C-Y-49 (A25)
INIT
<'0372-0376-0362-0336-0298-'>
2 #RC-T-C-Y-50 (A25)
INIT
<'0349-0355-0343-0319-0284-'>
2 #RC-T-C-Y-51 (A25)
INIT
<'0324-0332-0321-0300-0268-'>
2 #RC-T-C-Y-52 (A25)
INIT
<'0297-0306-0297-0279-0250-'>
2 #RC-T-C-Y-53 (A25)
INIT
<'0267-0277-0271-0255-0230-'>
2 #RC-T-C-Y-54 (A25)
INIT
<'0235-0246-0242-0228-0207-'>
2 #RC-T-C-Y-55 (A25)
INIT
<'0201-0212-0209-0198-0181-'>
2 #RC-T-C-Y-56 (A25)
INIT
<'0164-0175-0174-0165-0152-'>
2 #RC-T-C-Y-57 (A25)
INIT
<'0126-0135-0136-0129-0119-'>
2 #RC-T-C-Y-58 (A25)
INIT
<'0085-0093-0094-0090-0083-'>
2 #RC-T-C-Y-59 (A25)
INIT
<'0043-0048-0049-0047-0043-'>
2 #RC-T-C-Y-60 (A25)
INIT
<'0020-0022-0022-0021-0020-'>
2 #RC-T-C-O-35 (A25)
INIT
<'0536-0530-0537-0564-0627-'>
2 #RC-T-C-O-36 (A25)
INIT
<'0527-0519-0524-0549-0609-'>
2 #RC-T-C-O-37 (A25)
INIT
<'0518-0509-0512-0534-0592-'>
2 #RC-T-C-O-38 (A25)
INIT
<'0509-0498-0499-0520-0576-'>
2 #RC-T-C-O-39 (A25)
INIT
<'0500-0487-0486-0505-0559-'>
2 #RC-T-C-O-40 (A25)
INIT
<'0490-0475-0473-0491-0544-'>
2 #RC-T-C-O-41 (A25)
INIT
<'0480-0463-0460-0477-0528-'>
2 #RC-T-C-O-42 (A25)
INIT
<'0469-0451-0446-0462-0512-'>
2 #RC-T-C-O-43 (A25)
INIT
<'0457-0438-0432-0448-0495-'>
2 #RC-T-C-O-44 (A25)
INIT
<'0444-0424-0417-0432-0477-'>
2 #RC-T-C-O-45 (A25)
INIT
<'0429-0408-0400-0415-0457-'>
2 #RC-T-C-O-46 (A25)
INIT
<'0413-0390-0383-0398-0436-'>
2 #RC-T-C-O-47 (A25)
INIT
<'0395-0371-0364-0378-0413-'>
2 #RC-T-C-O-48 (A25)
INIT
<'0375-0351-0344-0358-0388-'>
2 #RC-T-C-O-49 (A25)
INIT
<'0353-0329-0323-0335-0362-'>
2 #RC-T-C-O-50 (A25)
INIT
<'0329-0305-0300-0311-0335-'>
2 #RC-T-C-O-51 (A25)
INIT
<'0304-0280-0277-0286-0305-'>
2 #RC-T-C-O-52 (A25)
INIT
<'0276-0254-0252-0259-0275-'>
2 #RC-T-C-O-53 (A25)
INIT
<'0247-0227-0226-0231-0243-'>
2 #RC-T-C-O-54 (A25)
INIT
<'0216-0198-0198-0201-0210-'>
2 #RC-T-C-O-55 (A25)
INIT
<'0183-0169-0168-0170-0176-'>
2 #RC-T-C-O-56 (A25)
INIT
<'0148-0138-0137-0137-0141-'>
2 #RC-T-C-O-57 (A25)
INIT
<'0113-0106-0104-0104-0105-'>
2 #RC-T-C-O-58 (A25)
INIT
<'0076-0072-0071-0070-0070-'>
2 #RC-T-C-O-59 (A25)
INIT
<'0038-0037-0036-0035-0035-'>
2 #RC-T-C-O-60 (A25)
INIT
<'0017-0017-0016-0016-0015-'>
2 #RC-T-B-Y-35 (A25)
INIT
<'0329-0339-0323-0292-0000-'>
2 #RC-T-B-Y-36 (A25)
INIT
<'0328-0338-0322-0291-0000-'>
2 #RC-T-B-Y-37 (A25)
INIT
<'0326-0336-0321-0290-0000-'>
2 #RC-T-B-Y-38 (A25)
INIT
<'0323-0334-0320-0290-0248-'>
2 #RC-T-B-Y-39 (A25)
INIT
<'0321-0332-0318-0289-0248-'>
2 #RC-T-B-Y-40 (A25)
INIT
<'0318-0330-0317-0287-0247-'>
2 #RC-T-B-Y-41 (A25)
INIT
<'0315-0327-0314-0286-0246-'>
2 #RC-T-B-Y-42 (A25)
INIT
<'0312-0324-0312-0284-0245-'>
2 #RC-T-B-Y-43 (A25)
INIT
<'0308-0321-0309-0282-0244-'>
2 #RC-T-B-Y-44 (A25)
INIT
<'0304-0317-0306-0280-0242-'>
2 #RC-T-B-Y-45 (A25)
INIT
<'0298-0311-0302-0276-0240-'>
2 #RC-T-B-Y-46 (A25)
INIT
<'0292-0305-0296-0272-0237-'>
2 #RC-T-B-Y-47 (A25)
INIT
<'0284-0298-0290-0267-0233-'>
2 #RC-T-B-Y-48 (A25)
INIT
<'0275-0289-0282-0261-0229-'>
2 #RC-T-B-Y-49 (A25)
INIT
<'0265-0279-0273-0253-0223-'>
2 #RC-T-B-Y-50 (A25)
INIT
<'0253-0268-0262-0244-0216-'>
2 #RC-T-B-Y-51 (A25)
INIT
<'0239-0254-0250-0233-0207-'>
2 #RC-T-B-Y-52 (A25)
INIT
<'0223-0238-0235-0220-0197-'>
2 #RC-T-B-Y-53 (A25)
INIT
<'0205-0220-0218-0205-0184-'>
2 #RC-T-B-Y-54 (A25)
INIT
<'0185-0199-0198-0187-0169-'>
2 #RC-T-B-Y-55 (A25)
INIT
<'0162-0175-0175-0166-0151-'>
2 #RC-T-B-Y-56 (A25)
INIT
<'0136-0148-0148-0141-0129-'>
2 #RC-T-B-Y-57 (A25)
INIT
<'0107-0117-0118-0112-0103-'>
2 #RC-T-B-Y-58 (A25)
INIT
<'0075-0082-0083-0080-0074-'>
2 #RC-T-B-Y-59 (A25)
INIT
<'0039-0043-0044-0042-0040-'>
2 #RC-T-B-Y-60 (A25)
INIT
<'0020-0022-0022-0021-0020-'>
2 #RC-T-B-O-35 (A25)
INIT
<'0301-0298-0293-0287-0281-'>
2 #RC-T-B-O-36 (A25)
INIT
<'0299-0296-0290-0284-0279-'>
2 #RC-T-B-O-37 (A25)
INIT
<'0296-0293-0288-0281-0276-'>
2 #RC-T-B-O-38 (A25)
INIT
<'0294-0291-0285-0278-0273-'>
2 #RC-T-B-O-39 (A25)
INIT
<'0292-0288-0282-0275-0270-'>
2 #RC-T-B-O-40 (A25)
INIT
<'0289-0285-0278-0272-0267-'>
2 #RC-T-B-O-41 (A25)
INIT
<'0286-0281-0275-0268-0263-'>
2 #RC-T-B-O-42 (A25)
INIT
<'0282-0278-0271-0264-0259-'>
2 #RC-T-B-O-43 (A25)
INIT
<'0279-0274-0267-0260-0255-'>
2 #RC-T-B-O-44 (A25)
INIT
<'0274-0269-0262-0255-0251-'>
2 #RC-T-B-O-45 (A25)
INIT
<'0269-0263-0256-0250-0245-'>
2 #RC-T-B-O-46 (A25)
INIT
<'0262-0256-0249-0243-0239-'>
2 #RC-T-B-O-47 (A25)
INIT
<'0255-0249-0242-0236-0231-'>
2 #RC-T-B-O-48 (A25)
INIT
<'0246-0240-0233-0228-0223-'>
2 #RC-T-B-O-49 (A25)
INIT
<'0236-0230-0224-0218-0214-'>
2 #RC-T-B-O-50 (A25)
INIT
<'0225-0219-0213-0208-0203-'>
2 #RC-T-B-O-51 (A25)
INIT
<'0212-0206-0200-0195-0192-'>
2 #RC-T-B-O-52 (A25)
INIT
<'0198-0192-0186-0182-0178-'>
2 #RC-T-B-O-53 (A25)
INIT
<'0181-0176-0171-0167-0163-'>
2 #RC-T-B-O-54 (A25)
INIT
<'0163-0158-0153-0150-0147-'>
2 #RC-T-B-O-55 (A25)
INIT
<'0142-0138-0134-0131-0128-'>
2 #RC-T-B-O-56 (A25)
INIT
<'0119-0115-0112-0109-0107-'>
2 #RC-T-B-O-57 (A25)
INIT
<'0094-0091-0088-0086-0084-'>
2 #RC-T-B-O-58 (A25)
INIT
<'0065-0063-0061-0060-0059-'>
2 #RC-T-B-O-59 (A25)
INIT
<'0034-0033-0032-0031-0031-'>
2 #RC-T-B-O-60 (A25)
INIT
<'0017-0017-0016-0016-0015-'>
2 #RC-S-C-Y-35 (A25)
INIT
<'0586-0550-0499-0441-0000-'>
2 #RC-S-C-Y-36 (A25)
INIT
<'0578-0544-0495-0437-0000-'>
2 #RC-S-C-Y-37 (A25)
INIT
<'0571-0538-0490-0434-0000-'>
2 #RC-S-C-Y-38 (A25)
INIT
<'0563-0532-0485-0430-0369-'>
2 #RC-S-C-Y-39 (A25)
INIT
<'0554-0525-0480-0426-0366-'>
2 #RC-S-C-Y-40 (A25)
INIT
<'0546-0518-0474-0422-0362-'>
2 #RC-S-C-Y-41 (A25)
INIT
<'0536-0510-0468-0417-0359-'>
2 #RC-S-C-Y-42 (A25)
INIT
<'0526-0502-0462-0412-0355-'>
2 #RC-S-C-Y-43 (A25)
INIT
<'0516-0492-0454-0406-0350-'>
2 #RC-S-C-Y-44 (A25)
INIT
<'0504-0482-0445-0399-0345-'>
2 #RC-S-C-Y-45 (A25)
INIT
<'0490-0470-0435-0391-0338-'>
2 #RC-S-C-Y-46 (A25)
INIT
<'0474-0456-0424-0381-0331-'>
2 #RC-S-C-Y-47 (A25)
INIT
<'0457-0441-0410-0370-0322-'>
2 #RC-S-C-Y-48 (A25)
INIT
<'0437-0423-0395-0358-0312-'>
2 #RC-S-C-Y-49 (A25)
INIT
<'0415-0404-0378-0343-0300-'>
2 #RC-S-C-Y-50 (A25)
INIT
<'0391-0382-0358-0326-0287-'>
2 #RC-S-C-Y-51 (A25)
INIT
<'0364-0358-0336-0307-0271-'>
2 #RC-S-C-Y-52 (A25)
INIT
<'0335-0331-0312-0286-0253-'>
2 #RC-S-C-Y-53 (A25)
INIT
<'0303-0301-0285-0262-0233-'>
2 #RC-S-C-Y-54 (A25)
INIT
<'0268-0268-0254-0235-0210-'>
2 #RC-S-C-Y-55 (A25)
INIT
<'0230-0231-0221-0204-0184-'>
2 #RC-S-C-Y-56 (A25)
INIT
<'0189-0192-0184-0171-0154-'>
2 #RC-S-C-Y-57 (A25)
INIT
<'0146-0149-0144-0134-0121-'>
2 #RC-S-C-Y-58 (A25)
INIT
<'0100-0103-0100-0093-0085-'>
2 #RC-S-C-Y-59 (A25)
INIT
<'0051-0053-0052-0048-0044-'>
2 #RC-S-C-Y-60 (A25)
INIT
<'0026-0026-0026-0024-0022-'>
2 #RC-S-C-O-35 (A25)
INIT
<'0603-0623-0651-0700-0788-'>
2 #RC-S-C-O-36 (A25)
INIT
<'0595-0612-0639-0684-0768-'>
2 #RC-S-C-O-37 (A25)
INIT
<'0586-0601-0626-0668-0749-'>
2 #RC-S-C-O-38 (A25)
INIT
<'0577-0590-0612-0652-0730-'>
2 #RC-S-C-O-39 (A25)
INIT
<'0567-0579-0599-0636-0711-'>
2 #RC-S-C-O-40 (A25)
INIT
<'0557-0567-0585-0620-0691-'>
2 #RC-S-C-O-41 (A25)
INIT
<'0546-0555-0570-0604-0672-'>
2 #RC-S-C-O-42 (A25)
INIT
<'0535-0542-0556-0587-0652-'>
2 #RC-S-C-O-43 (A25)
INIT
<'0523-0528-0540-0570-0632-'>
2 #RC-S-C-O-44 (A25)
INIT
<'0510-0512-0523-0551-0609-'>
2 #RC-S-C-O-45 (A25)
INIT
<'0494-0495-0504-0531-0585-'>
2 #RC-S-C-O-46 (A25)
INIT
<'0477-0476-0484-0509-0558-'>
2 #RC-S-C-O-47 (A25)
INIT
<'0458-0455-0462-0484-0530-'>
2 #RC-S-C-O-48 (A25)
INIT
<'0436-0432-0438-0458-0499-'>
2 #RC-S-C-O-49 (A25)
INIT
<'0413-0407-0412-0430-0466-'>
2 #RC-S-C-O-50 (A25)
INIT
<'0387-0381-0385-0400-0431-'>
2 #RC-S-C-O-51 (A25)
INIT
<'0359-0352-0355-0368-0394-'>
2 #RC-S-C-O-52 (A25)
INIT
<'0329-0321-0324-0334-0355-'>
2 #RC-S-C-O-53 (A25)
INIT
<'0296-0288-0290-0298-0314-'>
2 #RC-S-C-O-54 (A25)
INIT
<'0260-0253-0254-0260-0272-'>
2 #RC-S-C-O-55 (A25)
INIT
<'0222-0216-0217-0220-0228-'>
2 #RC-S-C-O-56 (A25)
INIT
<'0182-0177-0177-0178-0183-'>
2 #RC-S-C-O-57 (A25)
INIT
<'0140-0136-0135-0135-0138-'>
2 #RC-S-C-O-58 (A25)
INIT
<'0095-0093-0091-0091-0092-'>
2 #RC-S-C-O-59 (A25)
INIT
<'0048-0047-0046-0046-0046-'>
2 #RC-S-C-O-60 (A25)
INIT
<'0024-0024-0023-0023-0023-'>
2 #RC-S-B-Y-35 (A25)
INIT
<'0390-0378-0346-0304-0000-'>
2 #RC-S-B-Y-36 (A25)
INIT
<'0388-0376-0345-0304-0000-'>
2 #RC-S-B-Y-37 (A25)
INIT
<'0385-0374-0344-0303-0000-'>
2 #RC-S-B-Y-38 (A25)
INIT
<'0383-0372-0343-0302-0254-'>
2 #RC-S-B-Y-39 (A25)
INIT
<'0380-0370-0341-0301-0254-'>
2 #RC-S-B-Y-40 (A25)
INIT
<'0377-0368-0339-0300-0253-'>
2 #RC-S-B-Y-41 (A25)
INIT
<'0373-0365-0337-0298-0252-'>
2 #RC-S-B-Y-42 (A25)
INIT
<'0369-0361-0335-0297-0251-'>
2 #RC-S-B-Y-43 (A25)
INIT
<'0365-0358-0332-0295-0250-'>
2 #RC-S-B-Y-44 (A25)
INIT
<'0360-0353-0328-0292-0248-'>
2 #RC-S-B-Y-45 (A25)
INIT
<'0353-0347-0323-0288-0246-'>
2 #RC-S-B-Y-46 (A25)
INIT
<'0346-0340-0318-0284-0243-'>
2 #RC-S-B-Y-47 (A25)
INIT
<'0337-0332-0311-0279-0239-'>
2 #RC-S-B-Y-48 (A25)
INIT
<'0326-0323-0303-0272-0234-'>
2 #RC-S-B-Y-49 (A25)
INIT
<'0314-0312-0293-0265-0228-'>
2 #RC-S-B-Y-50 (A25)
INIT
<'0300-0299-0281-0255-0221-'>
2 #RC-S-B-Y-51 (A25)
INIT
<'0284-0284-0268-0244-0212-'>
2 #RC-S-B-Y-52 (A25)
INIT
<'0265-0266-0252-0230-0201-'>
2 #RC-S-B-Y-53 (A25)
INIT
<'0244-0246-0234-0214-0188-'>
2 #RC-S-B-Y-54 (A25)
INIT
<'0220-0223-0212-0195-0173-'>
2 #RC-S-B-Y-55 (A25)
INIT
<'0192-0196-0188-0173-0154-'>
2 #RC-S-B-Y-56 (A25)
INIT
<'0162-0165-0159-0147-0132-'>
2 #RC-S-B-Y-57 (A25)
INIT
<'0127-0131-0127-0117-0106-'>
2 #RC-S-B-Y-58 (A25)
INIT
<'0089-0092-0090-0083-0076-'>
2 #RC-S-B-Y-59 (A25)
INIT
<'0047-0049-0048-0044-0041-'>
2 #RC-S-B-Y-60 (A25)
INIT
<'0023-0024-0024-0022-0020-'>
2 #RC-S-B-O-35 (A25)
INIT
<'0384-0383-0379-0373-0367-'>
2 #RC-S-B-O-36 (A25)
INIT
<'0381-0381-0375-0369-0364-'>
2 #RC-S-B-O-37 (A25)
INIT
<'0379-0377-0372-0366-0360-'>
2 #RC-S-B-O-38 (A25)
INIT
<'0376-0374-0368-0362-0356-'>
2 #RC-S-B-O-39 (A25)
INIT
<'0373-0370-0364-0358-0352-'>
2 #RC-S-B-O-40 (A25)
INIT
<'0369-0367-0360-0354-0348-'>
2 #RC-S-B-O-41 (A25)
INIT
<'0365-0362-0356-0349-0344-'>
2 #RC-S-B-O-42 (A25)
INIT
<'0361-0358-0351-0344-0339-'>
2 #RC-S-B-O-43 (A25)
INIT
<'0356-0352-0346-0339-0334-'>
2 #RC-S-B-O-44 (A25)
INIT
<'0351-0346-0339-0333-0328-'>
2 #RC-S-B-O-45 (A25)
INIT
<'0344-0339-0332-0326-0321-'>
2 #RC-S-B-O-46 (A25)
INIT
<'0336-0330-0324-0317-0313-'>
2 #RC-S-B-O-47 (A25)
INIT
<'0326-0321-0314-0308-0303-'>
2 #RC-S-B-O-48 (A25)
INIT
<'0316-0310-0303-0297-0293-'>
2 #RC-S-B-O-49 (A25)
INIT
<'0303-0297-0291-0285-0281-'>
2 #RC-S-B-O-50 (A25)
INIT
<'0289-0283-0276-0271-0267-'>
2 #RC-S-B-O-51 (A25)
INIT
<'0272-0266-0261-0256-0252-'>
2 #RC-S-B-O-52 (A25)
INIT
<'0254-0248-0243-0238-0234-'>
2 #RC-S-B-O-53 (A25)
INIT
<'0233-0228-0223-0218-0215-'>
2 #RC-S-B-O-54 (A25)
INIT
<'0210-0205-0200-0196-0193-'>
2 #RC-S-B-O-55 (A25)
INIT
<'0183-0179-0175-0171-0169-'>
2 #RC-S-B-O-56 (A25)
INIT
<'0154-0150-0147-0144-0141-'>
2 #RC-S-B-O-57 (A25)
INIT
<'0121-0118-0115-0113-0111-'>
2 #RC-S-B-O-58 (A25)
INIT
<'0085-0082-0081-0079-0078-'>
2 #RC-S-B-O-59 (A25)
INIT
<'0044-0043-0042-0041-0041-'>
2 #RC-S-B-O-60 (A25)
INIT
<'0022-0022-0021-0021-0020-'>
1 REDEFINE #RCSBP-TBL
2 #RCSBP-TBL-TYPE(1:8)
3 #RCSBP-TBL-AGE(1:26)
4 #RCSBP-TBL-YRS-DIFF(1:5)
5 #RCSBP-RATE(N.4)
5 #RCSBP-FILL(A1)
**                                     /* END OF RCSBP
END-DEFINE
