* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
/** New Function id: ASOF008.
/**
/** :author nguentchev
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* NGG   20120712   None    Program written.                            *
*                                                                      *
************************************************************************
*
DEFINE FUNCTION Annuitant_AX RETURNS (N3.6)
  DEFINE DATA
  PARAMETER
  1 #AGE    (N4)
  1 #GENDER (A1)
  LOCAL
  1 MaleNx   (P9.2/0:115) INIT <
    245272041.66,
    235272041.66,
    225678878.20,
    216463039.69,
    207606122.64,
    199093330.88,
    190910876.37,
    183045680.79,
    175485269.11,
    168217721.61,
    161231987.24,
    154517366.53,
    148063518.44,
    141860458.21,
    135898547.91,
    130168498.59,
    124661359.21,
    119368521.68,
    114281702.77,
    109392951.87,
    104694627.21,
    100179392.66,
    95840204.49,
    91670298.91,
    87663176.01,
    83812589.06,
    80112534.14,
    76557229.63,
    73141108.47,
    69858800.71,
    66705127.85,
    63675097.16,
    60763890.29,
    57966861.52,
    55279532.75,
    52697604.12,
    50216944.19,
    47833583.37,
    45543709.88,
    43343720.54,
    41230190.77,
    39199871.08,
    37249676.78,
    35376680.17,
    33578102.76,
    31851304.16,
    30193768.44,
    28603088.79,
    27076950.97,
    25613125.06,
    24209456.76,
    22863862.54,
    21574330.43,
    20338917.76,
    19155748.78,
    18023013.52,
    16938961.92,
    15901896.66,
    14910168.10,
    13962171.90,
    13056347.87,
    12191193.59,
    11365279.05,
    10577256.52,
    9825867.94,
    9109948.52,
    8428426.27,
    7780320.24,
    7164736.66,
    6580862.74,
    6027956.60,
    5505325.26,
    5012302.99,
    4548232.04,
    4112446.20,
    3704261.96,
    3322983.33,
    2967909.18,
    2638334.13,
    2333548.52,
    2052832.76,
    1795445.29,
    1560610.90,
    1347509.99,
    1155270.21,
    982961.64,
    829594.09,
    694118.33,
    575428.94,
    472369.79,
    383742.00,
    308311.06,
    244819.38,
    192002.92,
    148610.89,
    113426.92,
    85289.56,
    63110.96,
    45891.95,
    32733.12,
    22847.34,
    15560.11,
    10303.07,
    6604.13,
    4076.41,
    2407.62,
    1350.08,
    711.89,
    348.75,
    156.29,
    62.78,
    21.98,
    6.44,
    1.48,
    0.24,
    0.02
      >
  1 MaleDx   (P9.2/0:115) INIT <
    10000000.00,
    9593163.46,
    9215838.51,
    8856917.05,
    8512791.76,
    8182454.51,
    7865195.57,
    7560411.68,
    7267547.50,
    6985734.37,
    6714620.71,
    6453848.08,
    6203060.23,
    5961910.30,
    5730049.32,
    5507139.38,
    5292837.52,
    5086818.91,
    4888750.90,
    4698324.65,
    4515234.56,
    4339188.16,
    4169905.59,
    4007122.90,
    3850586.95,
    3700054.92,
    3555304.50,
    3416121.17,
    3282307.76,
    3153672.86,
    3030030.69,
    2911206.87,
    2797028.77,
    2687328.77,
    2581928.63,
    2480659.93,
    2383360.82,
    2289873.49,
    2199989.35,
    2113529.77,
    2030319.69,
    1950194.30,
    1872996.61,
    1798577.41,
    1726798.61,
    1657535.72,
    1590679.65,
    1526137.82,
    1463825.91,
    1403668.30,
    1345594.22,
    1289532.11,
    1235412.68,
    1183168.97,
    1132735.26,
    1084051.60,
    1037065.26,
    991728.56,
    947996.19,
    905824.03,
    865154.28,
    825914.54,
    788022.53,
    751388.58,
    715919.42,
    681522.25,
    648106.03,
    615583.57,
    583873.92,
    552906.14,
    522631.34,
    493022.27,
    464070.96,
    435785.83,
    408184.25,
    381278.62,
    355074.15,
    329575.05,
    304785.62,
    280715.76,
    257387.47,
    234834.39,
    213100.92,
    192239.77,
    172308.57,
    153367.55,
    135475.75,
    118689.40,
    103059.14,
    88627.79,
    75430.94,
    63491.68,
    52816.47,
    43392.03,
    35183.97,
    28137.36,
    22178.60,
    17219.02,
    13158.82,
    9885.78,
    7287.24,
    5257.03,
    3698.94,
    2527.71,
    1668.80,
    1057.54,
    638.18,
    363.15,
    192.46,
    93.51,
    40.80,
    15.54,
    4.96,
    1.24,
    0.22,
    0.02
      >
  1 FemaleDx   (P9.2/0:115) INIT <
    10000000.00,
    9598134.62,
    9222007.72,
    8863839.12,
    8520450.59,
    8190840.23,
    7874319.39,
    7570279.80,
    7278161.63,
    6997315.57,
    6727286.47,
    6467639.09,
    6217963.34,
    5977866.25,
    5746971.17,
    5524922.57,
    5311379.00,
    5106012.49,
    4908508.00,
    4718567.62,
    4535904.61,
    4360238.62,
    4191304.52,
    4028843.11,
    3872609.23,
    3722363.16,
    3577881.78,
    3438946.44,
    3305346.68,
    3176886.28,
    3053369.56,
    2934611.10,
    2820434.97,
    2710665.81,
    2605137.51,
    2503687.44,
    2406151.96,
    2312372.19,
    2222194.12,
    2135464.45,
    2052037.60,
    1971777.28,
    1894551.87,
    1820234.43,
    1748706.21,
    1679850.91,
    1613556.56,
    1549715.57,
    1488223.16,
    1428980.43,
    1371892.66,
    1316871.85,
    1263832.30,
    1212696.92,
    1163389.13,
    1115838.95,
    1069975.83,
    1025733.36,
    983047.07,
    941855.51,
    902092.00,
    863686.30,
    826565.23,
    790656.53,
    755888.93,
    722203.18,
    689553.34,
    657904.17,
    627228.76,
    597502.94,
    568683.19,
    540705.62,
    513494.09,
    486963.23,
    461027.29,
    435614.93,
    410671.37,
    386159.42,
    362057.87,
    338359.10,
    315060.47,
    292164.06,
    269681.47,
    247635.79,
    226062.90,
    205007.53,
    184525.11,
    164686.00,
    145575.77,
    127300.84,
    110004.20,
    93846.38,
    78981.39,
    65535.26,
    53590.70,
    43177.67,
    34272.61,
    26803.58,
    20659.30,
    15686.43,
    11719.16,
    8597.24,
    6175.25,
    4326.20,
    2941.43,
    1928.84,
    1210.39,
    719.81,
    400.71,
    205.55,
    95.16,
    38.65,
    13.21,
    3.56,
    0.67,
              0.07
                >
  1 FemaleNx   (P9.2/0:115) INIT <
    248145296.64,
    238145296.64,
    228547162.02,
    219325154.31,
    210461315.18,
    201940864.60,
    193750024.37,
    185875704.98,
    178305425.18,
    171027263.54,
    164029947.98,
    157302661.51,
    150835022.42,
    144617059.08,
    138639192.83,
    132892221.66,
    127367299.09,
    122055920.09,
    116949907.60,
    112041399.60,
    107322831.98,
    102786927.37,
    98426688.76,
    94235384.23,
    90206541.12,
    86333931.90,
    82611568.74,
    79033686.96,
    75594740.52,
    72289393.84,
    69112507.56,
    66059138.00,
    63124526.91,
    60304091.93,
    57593426.12,
    54988288.61,
    52484601.17,
    50078449.21,
    47766077.02,
    45543882.90,
    43408418.45,
    41356380.84,
    39384603.56,
    37490051.69,
    35669817.27,
    33921111.05,
    32241260.15,
    30627703.59,
    29077988.01,
    27589764.85,
    26160784.42,
    24788891.76,
    23472019.91,
    22208187.61,
    20995490.69,
    19832101.56,
    18716262.61,
    17646286.78,
    16620553.42,
    15637506.35,
    14695650.85,
    13793558.85,
    12929872.56,
    12103307.33,
    11312650.80,
    10556761.87,
    9834558.69,
    9145005.35,
    8487101.18,
    7859872.43,
    7262369.49,
    6693686.30,
    6152980.69,
    5639486.60,
    5152523.37,
    4691496.09,
    4255881.16,
    3845209.79,
    3459050.37,
    3096992.50,
    2758633.40,
    2443572.93,
    2151408.87,
    1881727.40,
    1634091.61,
    1408028.71,
    1203021.18,
    1018496.06,
    853810.06,
    708234.29,
    580933.45,
    470929.25,
    377082.87,
    298101.48,
    232566.22,
    178975.52,
    135797.85,
    101525.24,
    74721.66,
    54062.35,
    38375.93,
    26656.76,
    18059.53,
    11884.27,
    7558.07,
    4616.64,
    2687.80,
    1477.41,
    757.59,
    356.88,
    151.33,
    56.17,
    17.52,
    4.30,
    0.74,
              0.07
                >
  END-DEFINE
*
RESET Annuitant_AX
IF #AGE > 115
  #AGE := 115
END-IF
IF #GENDER = 'M'
  COMPUTE ROUNDED Annuitant_AX =
    ( MaleNx ( #AGE ) / MaleDx (#AGE) -0.5416667) * 12
ELSE
  COMPUTE ROUNDED Annuitant_AX =
    ( FemaleNx ( #AGE ) / FemaleDx (#AGE) -0.5416667) * 12
END-IF
END-FUNCTION
END
