* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* ID ASOF015  - Joint and Survivor Annuity Option Life expectancy 65-74
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* NGG   20120712   None    Program written.                            *
*                                                                      *
************************************************************************
*
DEFINE FUNCTION ASOF015 RETURNS (N2.1)
  DEFINE DATA
  PARAMETER
  1 #AGE1    (N4)
  1 #AGE2    (N4)
  LOCAL
  1 A065 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.8,72.8,71.8,70.8,69.8,68.9,67.9,66.9,65.9,65,64,63,62,61.1,60.1,59.1,58.2,57.2,56.3,55.3,
    54.3,53.4,52.4,51.5,50.5,49.6,48.7,47.7,46.8,45.9,44.9,44,43.1,42.2,41.3,40.4,39.6,38.7,37.9,37,36.2,35.4,
    34.6,33.8,33,32.3,31.6,30.9,30.2,29.5,28.9,28.2,27.6,27.1,26.5,26,25.5,25,24.6,24.2,23.8,23.4,23.1,22.8,
    22.5,22.2,22 >
  1 A066 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.7,72.8,71.8,70.8,69.8,68.9,67.9,66.9,65.9,64.9,64,63,62,61.1,60.1,59.1,58.2,57.2,56.2,55.3,
    54.3,53.4,52.4,51.5,50.5,49.6,48.6,47.7,46.7,45.8,44.9,44,43.1,42.2,41.3,40.4,39.5,38.6,37.8,36.9,36.1,35.2,
    34.4,33.6,32.9,32.1,31.4,30.6,29.9,29.2,28.6,27.9,27.3,26.7,26.1,25.6,25.1,24.6,24.1,23.7,23.3,22.9,22.5,
        22.2,21.9,21.6,21.4 >
  1 A067 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.7,72.8,71.8,70.8,69.8,68.8,67.9,66.9,65.9,64.9,64,63,62,61,60.1,59.1,58.1,57.2,56.2,55.3,
    54.3,53.3,52.4,51.4,50.5,49.5,48.6,47.6,46.7,45.8,44.8,43.9,43,42.1,41.2,40.3,39.4,38.5,37.7,36.8,36,35.1,
    34.3,33.5,32.7,31.9,31.2,30.4,29.7,29,28.3,27.6,27,26.4,25.8,25.2,24.7,24.2,23.7,23.2,22.8,22.4,22,21.7,
                21.3,21,20.8 >
  1 A068 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.7,72.8,71.8,70.8,69.8,68.8,67.9,66.9,65.9,64.9,64,63,62,61,60.1,59.1,58.1,57.2,56.2,55.2,
    54.3,53.3,52.4,51.4,50.4,49.5,48.6,47.6,46.7,45.7,44.8,43.9,42.9,42,41.1,40.2,39.3,38.4,37.6,36.7,35.8,35,
    34.2,33.4,32.5,31.8,31,30.2,29.5,28.8,28.1,27.4,26.7,26.1,25.5,24.9,24.3,23.8,23.3,22.8,22.3,21.9,21.5,21.2,
    20.8,20.5,20.2 >
  1 A069 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.7,72.7,71.8,70.8,69.8,68.8,67.8,66.9,65.9,64.9,63.9,63,62,61,60,59.1,58.1,57.1,56.2,55.2,
    54.3,53.3,52.3,51.4,50.4,49.5,48.5,47.6,46.6,45.7,44.8,43.8,42.9,42,41.1,40.2,39.3,38.4,37.5,36.6,35.7,34.9,
    34.1,33.2,32.4,31.6,30.8,30.1,29.3,28.6,27.8,27.1,26.5,25.8,25.2,24.6,24,23.4,22.9,22.4,21.9,21.5,21.1,20.7,
            20.3,20,19.6 >
  1 A070 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.7,72.7,71.8,70.8,69.8,68.8,67.8,66.9,65.9,64.9,63.9,63,62,61,60,59.1,58.1,57.1,56.2,55.2,
    54.2,53.3,52.3,51.4,50.4,49.4,48.5,47.5,46.6,45.7,44.7,43.8,42.9,41.9,41,40.1,39.2,38.3,37.4,36.5,35.7,34.8,
    34,33.1,32.3,31.5,30.7,29.9,29.1,28.4,27.6,26.9,26.2,25.6,24.9,24.3,23.7,23.1,22.5,22,21.5,21.1,20.6,20.2,
  19.8,19.4,19.1 >
  1 A071 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.7,72.7,71.8,70.8,69.8,68.8,67.8,66.9,65.9,64.9,63.9,62.9,62,61,60,59.1,58.1,57.1,56.2,
    55.2,54.2,53.3,52.3,51.3,50.4,49.4,48.5,47.5,46.6,45.6,44.7,43.8,42.8,41.9,41,40.1,39.1,38.2,37.3,36.5,35.6,
    34.7,33.9,33,32.2,31.4,30.5,29.7,29,28.2,27.5,26.7,26,25.3,24.7,24,23.4,22.8,22.2,21.7,21.2,20.7,20.2,19.8,
            19.4,19,18.6 >
  1 A072 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.7,72.7,71.8,70.8,69.8,68.8,67.8,66.9,65.9,64.9,63.9,62.9,62,61,60,59,58.1,57.1,56.1,55.2,
    54.2,53.2,52.3,51.3,50.4,49.4,48.5,47.5,46.6,45.6,44.7,43.7,42.8,41.9,40.9,40,39.1,38.2,37.3,36.4,35.5,
    34.6,33.8,32.9,32.1,31.2,30.4,29.6,28.8,28.1,27.3,26.5,25.8,25.1,24.4,23.8,23.1,22.5,21.9,21.3,20.8,20.3,
    19.8,19.4,18.9,18.5,18.2 >
  1 A073 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.7,72.7,71.7,70.8,69.8,68.8,67.8,66.8,65.9,64.9,63.9,62.9,62,61,60,59,58.1,57.1,56.1,55.2,
    54.2,53.2,52.3,51.3,50.3,49.4,48.4,47.5,46.5,45.6,44.6,43.7,42.8,41.8,40.9,40,39,38.1,37.2,36.3,35.4,34.6,
    33.7,32.8,32,31.1,30.3,29.5,28.7,27.9,27.1,26.4,25.6,24.9,24.2,23.5,22.9,22.2,21.6,21,20.5,20,19.4,19,18.5,
              18.1,17.7 >
  1 A074 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.7,72.7,71.7,70.8,69.8,68.8,67.8,66.8,65.9,64.9,63.9,62.9,62,61,60,59,58.1,57.1,56.1,55.2,
    54.2,53.2,52.3,51.3,50.3,49.4,48.4,47.5,46.5,45.6,44.6,43.7,42.7,41.8,40.9,39.9,39,38.1,37.2,36.3,35.4,34.5,
    33.6,32.8,31.9,31.1,30.2,29.4,28.6,27.8,27,26.2,25.5,24.7,24,23.3,22.7,22,21.4,20.8,20.2,19.6,19.1,18.6,18.2,
      17.7,17.3  >
*
  END-DEFINE
RESET ASOF015
DECIDE ON FIRST VALUE OF #AGE1
  VALUE 65
    ASOF015 := A065 ( #AGE2 )
  VALUE 66
    ASOF015 := A066 ( #AGE2 )
  VALUE 67
    ASOF015 := A067 ( #AGE2 )
  VALUE 68
    ASOF015 := A068 ( #AGE2 )
  VALUE 69
    ASOF015 := A069 ( #AGE2 )
  VALUE 70
    ASOF015 := A070 ( #AGE2 )
  VALUE 71
    ASOF015 := A071 ( #AGE2 )
  VALUE 72
    ASOF015 := A072 ( #AGE2 )
  VALUE 73
    ASOF015 := A073 ( #AGE2 )
  VALUE 74
    ASOF015 := A074 ( #AGE2 )
  NONE VALUE
    ASOF015 := ASOF014 (< #AGE1,#AGE2 >)
END-DECIDE
END-FUNCTION
END
