* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* ID ASOF013  - Joint and Survivor Annuity Option Life expectancy 85-94
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* NGG   20120712   None    Program written.                            *
*                                                                      *
************************************************************************
*
DEFINE FUNCTION ASOF013 RETURNS (N2.1)
  DEFINE DATA
  PARAMETER
  1 #AGE1    (N4)
  1 #AGE2    (N4)
  LOCAL
  1 A085 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.8,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,60,59,58,57,56.1,55.1,
    54.1,53.2,52.2,51.2,50.2,49.3,48.3,47.4,46.4,45.4,44.5,43.5,42.6,41.6,40.7,39.7,38.8,37.8,36.9,36,35.1,34.1,
    33.2,32.3,31.4,30.5,29.6,28.8,27.9,27,26.2,25.3,24.5,23.7,22.8,22,21.3,20.5,19.7,19,18.3,17.6,16.9,16.2,15.6,
                  15,14.4,13.8,13.3,12.8,12.3,11.8,11.4,11,10.6,10.2,9.9,9.6,9.3,9.1,8.9,8.7,8.5,8.3,8.2,8,7.9 >
  1 A086 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.8,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,60,59,58,57,56.1,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.5,43.5,42.5,41.6,40.6,39.7,38.8,37.8,36.9,36,35,34.1,
    33.2,32.3,31.4,30.5,29.6,28.7,27.9,27,26.1,25.3,24.5,23.6,22.8,22,21.2,20.4,19.6,18.9,18.2,17.5,16.8,16.1,
            15.5,14.8,14.2,13.7,13.1,12.6,12.1,11.6,11.2,10.8,10.4,10,9.7,9.3,9.1,8.8,8.6,8.3,8.2,8,7.8,7.7,7.6 >
  1 A087 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.8,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,60,59,58,57,56.1,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.5,43.5,42.5,41.6,40.6,39.7,38.7,37.8,36.9,35.9,35,34.1,
    33.2,32.3,31.4,30.5,29.6,28.7,27.8,27,26.1,25.3,24.4,23.6,22.8,21.9,21.1,20.4,19.6,18.8,18.1,17.4,16.7,16,
    15.4,14.7,14.1,13.5,13,12.4,11.9,11.4,11,10.6,10.1,9.8,9.4,9.1,8.8,8.5,8.3,8.1,7.9,7.7,7.5,7.4,7.2 >
  1 A088 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.8,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,60,59,58,57,56.1,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.5,43.5,42.5,41.6,40.6,39.7,38.7,37.8,36.9,35.9,35,34.1,
    33.2,32.3,31.4,30.5,29.6,28.7,27.8,27,26.1,25.2,24.4,23.5,22.7,21.9,21.1,20.3,19.5,18.8,18,17.3,16.6,15.9,
                  15.3,14.6,14,13.4,12.8,12.3,11.8,11.3,10.8,10.4,10,9.6,9.2,8.9,8.6,8.3,8,7.8,7.6,7.4,7.2,7.1,6.9 >
  1 A089 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,60,59,58,57,56.1,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.6,40.6,39.7,38.7,37.8,36.9,35.9,35,34.1,
    33.2,32.3,31.4,30.5,29.6,28.7,27.8,26.9,26.1,25.2,24.4,23.5,22.7,21.9,21.1,20.3,19.5,18.7,18,17.2,16.5,15.8,
            15.2,14.5,13.9,13.3,12.7,12.2,11.6,11.1,10.7,10.2,9.8,9.4,9,8.7,8.3,8.1,7.8,7.5,7.3,7.1,6.9,6.8,6.6 >
  1 A090 (N2.1/5:94) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,60,59,58,57,56.1,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.6,40.6,39.7,38.7,37.8,36.9,35.9,35,34.1,
    33.2,32.3,31.3,30.5,29.6,28.7,27.8,26.9,26.1,25.2,24.3,23.5,22.7,21.8,21,20.2,19.4,18.7,17.9,17.2,16.5,15.8,
        15.1,14.5,13.8,13.2,12.6,12.1,11.5,11,10.5,10.1,9.6,9.2,8.8,8.5,8.2,7.9,7.6,7.3,7.1,6.9,6.7,6.5,6.4 >
  1 A091 (N2.1/5:94) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,60,59,58,57,56.1,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.6,40.6,39.7,38.7,37.8,36.8,35.9,35,34.1,
    33.2,32.2,31.3,30.4,29.5,28.7,27.8,26.9,26,25.2,24.3,23.5,22.6,21.8,21,20.2,19.4,18.6,17.9,17.1,16.4,15.7,
    15,14.4,13.7,13.1,12.5,12,11.4,10.9,10.4,9.9,9.5,9.1,8.7,8.3,8,7.7,7.4,7.1,6.9,6.7,6.5,6.3,6.2 >
  1 A092 (N2.1/5:94) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56.1,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.6,40.6,39.7,38.7,37.8,36.8,35.9,35,34.1,
    33.2,32.2,31.3,30.4,29.5,28.6,27.8,26.9,26,25.2,24.3,23.5,22.6,21.8,21,20.2,19.4,18.6,17.8,17.1,16.4,15.7,15,
                  14.3,13.7,13.1,12.5,11.9,11.3,10.8,10.3,9.8,9.4,8.9,8.5,8.2,7.8,7.5,7.2,6.9,6.7,6.5,6.3,6.1,5.9 >
  1 A093 (N2.1/5:94) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56.1,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.6,40.6,39.7,38.7,37.8,36.8,35.9,35,34.1,
    33.1,32.2,31.3,30.4,29.5,28.6,27.8,26.9,26,25.1,24.3,23.4,22.6,21.8,20.9,20.1,19.3,18.6,17.8,17.1,16.3,15.6,
                14.9,14.3,13.6,13,12.4,11.8,11.3,10.7,10.2,9.7,9.3,8.8,8.4,8,7.7,7.4,7.1,6.8,6.5,6.3,6.1,5.9,5.8 >
  1 A094 (N2.1/5:94) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.6,40.6,39.7,38.7,37.8,36.8,35.9,35,34.1,
    33.1,32.2,31.3,30.4,29.5,28.6,27.7,26.9,26,25.1,24.3,23.4,22.6,21.7,20.9,20.1,19.3,18.5,17.8,17,16.3,15.6,
            14.9,14.2,13.6,12.9,12.3,11.7,11.2,10.6,10.1,9.6,9.2,8.7,8.3,7.9,7.6,7.2,6.9,6.6,6.4,6.2,5.9,5.8,5.6  >
*
  END-DEFINE
RESET ASOF013
DECIDE ON FIRST VALUE OF #AGE1
  VALUE 85
    ASOF013 := A085 ( #AGE2 )
  VALUE 86
    ASOF013 := A086 ( #AGE2 )
  VALUE 87
    ASOF013 := A087 ( #AGE2 )
  VALUE 88
    ASOF013 := A088 ( #AGE2 )
  VALUE 89
    ASOF013 := A089 ( #AGE2 )
  VALUE 90
    ASOF013 := A090 ( #AGE2 )
  VALUE 91
    ASOF013 := A091 ( #AGE2 )
  VALUE 92
    ASOF013 := A092 ( #AGE2 )
  VALUE 93
    ASOF013 := A093 ( #AGE2 )
  VALUE 94
    ASOF013 := A094 ( #AGE2 )
  NONE VALUE
    ASOF013 := ASOF012 (< #AGE1,#AGE2 >)
END-DECIDE
END-FUNCTION
END
