* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* ID ASOF017  - Joint and Survivor Annuity Option Life expectancy 35-54
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* NGG   20120712   None    Program written.                            *
*                                                                      *
************************************************************************
*
DEFINE FUNCTION ASOF017 RETURNS (N2.1)
  DEFINE DATA
  PARAMETER
  1 #AGE1    (N4)
  1 #AGE2    (N4)
  LOCAL
  1 A035 (N2.1/5:94) INIT
    < 77.3,76.4,75.5,74.5,73.6,72.7,71.8,70.9,70,69.1,68.2,67.4,66.5,65.6,64.8,64,63.2,62.4,61.6,
          60.9,60.1,59.4,58.7,58,57.4,56.7,56.1,55.6,55,54.5,54,53.5,53,52.6,52.2,51.8,51.4,51.1,50.8,50.5 >
  1 A036 (N2.1/5:94) INIT
    < 77.3,76.3,75.4,74.5,73.5,72.6,71.7,70.8,69.9,69,68.1,67.2,66.4,65.5,64.7,63.8,63,62.2,61.4,60.6,
                59.9,59.1,58.4,57.7,57,56.4,55.8,55.1,54.6,54,53.5,53,52.5,52,51.6,51.2,50.8,50.4,50.1,49.8 >
  1 A037 (N2.1/5:94) INIT
    <77.2,76.3,75.4,74.4,73.5,72.6,71.6,70.7,69.8,68.9,68,67.1,66.2,65.4,64.5,63.7,62.8,62,61.2,60.4,
  59.6,58.9,58.1,57.4,56.7,56,55.4,54.8,54.2,53.6,53,52.5,52,51.5,51,50.6,50.2,49.8,49.5,49.1 >
  1 A038 (N2.1/5:94) INIT
    <77.2,76.2,75.3,74.4,73.4,72.5,71.6,70.6,69.7,68.8,67.9,67,66.1,65.2,64.4,63.5,62.7,61.8,61,60.2,
          59.4,58.6,57.9,57.1,56.4,55.7,55.1,54.4,53.8,53.2,52.6,52,51.5,51,50.5,50,49.6,49.2,48.8,48.5 >
  1 A039 (N2.1/5:94) INIT
    < 77.2,76.2,75.3,74.3,73.4,72.4,71.5,70.6,69.6,68.7,67.8,66.9,66,65.1,64.2,63.4,62.5,61.7,60.8,60,
    59.2,58.4,57.7,56.9,56.2,55.4,54.7,54.1,53.4,52.8,52.2,51.6,51,50.5,50,49.5,49.1,48.6,
                48.2,47.8 >
  1 A040 (N2.1/5:94) INIT
    <77.1,76.2,75.2,74.3,73.3,72.4,71.4,70.5,69.6,68.6,67.7,66.8,65.9,65,64.1,
    63.3,62.4,61.5,60.7,59.9,59,58.2,57.4,56.7,55.9,55.2,54.5,53.8,53.1,52.4,51.8,51.2,50.6,50,49.5,
    49,48.5,48.1,47.6,47.2 >
  1 A041 (N2.1/5:94) INIT
    < 77.1,76.1,75.2,74.2,73.3,72.3,71.4,70.4,69.5,68.6,67.7,66.7,65.8,64.9,64,63.1,62.3,61.4,60.5,
    59.7,58.9,58,57.2,56.4,55.7,54.9,54.2,53.5,52.8,52.1,51.4,50.8,50.2,49.6,49.1,48.5,48,47.5,
              47.1,46.7 >
  1 A042 (N2.1/5:94) INIT
    <77,76.1,75.1,74.2,73.2,72.3,71.3,70.4,69.4,68.5,67.6,66.7,65.7,64.8,63.9,63,62.2,61.3,60.4,59.6,
  58.7,57.9,57.1,56.2,55.5,54.7,53.9,53.2,52.5,51.8,51.1,50.4,49.8,49.2,48.6,48.1,47.5,47,46.6,46.1 >
  1 A043 (N2.1/5:94) INIT
    <77,76.1,75.1,74.1,73.2,72.2,71.3,70.3,69.4,68.5,67.5,66.6,65.7,64.8,63.8,62.9,62.1,61.2,
            60.3,59.4,58.6,57.7,56.9,56.1,55.3,54.5,53.7,52.9,52.2,51.5,50.8,50.1,49.5,48.8,48.2,47.6,47.1,46.6,46,45.6 >
  1 A044 (N2.1/5:94) INIT <
    77,76,75.1,74.1,73.1,72.2,71.2,70.3,69.3,68.4,67.5,66.5,65.6,64.7,63.8,62.9,62,61.1,60.2,59.3,58.4,57.6,56.7,
  55.9,55.1,54.3,53.5,52.7,52,51.2,50.5,49.8,49.1,48.5,47.8,47.2,46.7,46.1,45.6,45.1 >
  1 A045 (N2.1/5:94) INIT <
    77,76,75,74.1,73.1,72.2,71.2,70.2,69.3,68.4,67.4,66.5,65.5,64.6,63.7,62.8,61.9,61,60.1,59.2,58.3,57.4,56.6,
    55.7,54.9,54.1,53.3,52.5,51.7,51,50.2,49.5,48.8,48.1,47.5,46.9,46.3,45.7,45.1,44.6,44.1,43.6,43.2,42.7,42.3,
              42,41.6,41.3,41,40.7 >
  1 A046 (N2.1/5:94) INIT <
    76.9,76,75,74,73.1,72.1,71.2,70.2,69.3,68.3,67.4,66.4,65.5,64.6,63.6,62.7,61.8,60.9,60,59.1,58.2,57.3,56.5,
    55.6,54.8,53.9,53.1,52.3,51.5,50.7,50,49.2,48.5,47.8,47.2,46.5,45.9,45.3,44.7,44.1,43.6,43.1,42.6,42.2,41.8,
    41.4,41,40.6,40.3,40 >
  1 A047 (N2.1/5:94) INIT <
    76.9,75.9,75,74,73.1,72.1,71.1,70.2,69.2,68.3,67.3,66.4,65.4,64.5,63.6,62.6,61.7,60.8,59.9,59,58.1,57.2,56.3,
    55.5,54.6,53.8,52.9,52.1,51.3,50.5,49.7,49,48.3,47.5,46.8,46.2,45.5,44.9,44.3,43.7,43.2,42.6,42.1,41.7,41.2,
      40.8,40.4,40,39.7,39.3 >
  1 A048 (N2.1/5:94) INIT <
    76.9,75.9,75,74,73,72.1,71.1,70.1,69.2,68.2,67.3,66.3,65.4,64.4,63.5,62.6,61.6,60.7,59.8,58.9,58,57.1,56.2,
    55.3,54.5,53.6,52.8,51.9,51.1,50.3,49.5,48.8,48,47.3,46.6,45.9,45.2,44.5,43.9,43.3,42.7,42.2,41.7,41.2,40.7,
              40.2,39.8,39.4,39,38.7 >
  1 A049 (N2.1/5:94) INIT <
    76.9,75.9,74.9,74,73,72,71.1,70.1,69.1,68.2,67.2,66.3,65.3,64.4,63.5,62.5,61.6,60.7,59.7,58.8,57.9,57,56.1,
    55.2,54.4,53.5,52.6,51.8,51,50.1,49.3,48.5,47.8,47,46.3,45.6,44.9,44.2,43.6,42.9,42.3,41.8,41.2,40.7,40.2,
  39.7,39.3,38.8,38.4,38.1 >
  1 A050 (N2.1/5:94) INIT <
    76.9,75.9,74.9,73.9,73,72,71,70.1,69.1,68.2,67.2,66.2,65.3,64.3,63.4,62.5,61.5,60.6,59.7,58.8,57.8,56.9,56,
    55.1,54.2,53.4,52.5,51.7,50.8,50,49.2,48.4,47.6,46.8,46,45.3,44.6,43.9,43.2,42.6,42,41.4,40.8,40.2,39.7,39.2,
          38.7,38.3,37.9,37.5 >
  1 A051 (N2.1/5:94) INIT <
    76.8,75.9,74.9,73.9,73,72,71,70.1,69.1,68.1,67.2,66.2,65.3,64.3,63.4,62.4,61.5,60.5,59.6,58.7,57.8,56.9,55.9,
    55,54.1,53.3,52.4,51.5,50.7,49.8,49,48.2,47.4,46.6,45.8,45.1,44.3,43.6,42.9,42.2,41.6,41,40.4,39.8,39.3,38.7,
                  38.2,37.8,37.3,36.9 >
  1 A052 (N2.1/5:94) INIT <
    76.8,75.9,74.9,73.9,72.9,72,71,70,69.1,68.1,67.1,66.2,65.2,64.3,63.3,62.4,61.4,60.5,59.6,58.6,57.7,56.8,
    55.9,55,54.1,53.2,52.3,51.4,50.5,49.7,48.8,48,47.2,46.4,45.6,44.8,44.1,43.3,42.6,41.9,41.3,40.6,40,39.4,
        38.8,38.3,37.8,37.3,36.8,36.4 >
  1 A053 (N2.1/5:94) INIT <
    76.8,75.8,74.9,73.9,72.9,71.9,71,70,69,68.1,67.1,66.2,65.2,64.2,63.3,62.3,61.4,60.4,59.5,58.6,57.6,56.7,55.8,
    54.9,54,53.1,52.2,51.3,50.4,49.6,48.7,47.9,47,46.2,45.4,44.6,43.9,43.1,42.4,41.7,41,40.3,39.7,39,38.4,37.9,
                37.3,36.8,36.3,35.8 >
  1 A054 (N2.1/5:94) INIT <
    76.8,75.8,74.8,73.9,72.9,71.9,71,70,69,68.1,67.1,66.1,65.2,64.2,63.2,62.3,61.3,60.4,59.5,58.5,57.6,56.7,55.7,
    54.8,53.9,53,52.1,51.2,50.3,49.4,48.6,47.7,46.9,46,45.2,44.4,43.6,42.9,42.1,41.4,40.7,40,39.3,38.7,38.1,37.5,
      36.9,36.4,35.8,35.3 >
*
  END-DEFINE
RESET ASOF017
DECIDE ON FIRST VALUE OF #AGE1
  VALUE 35
    ASOF017 := A035 ( #AGE2 )
  VALUE 36
    ASOF017 := A036 ( #AGE2 )
  VALUE 37
    ASOF017 := A037 ( #AGE2 )
  VALUE 38
    ASOF017 := A038 ( #AGE2 )
  VALUE 39
    ASOF017 := A039 ( #AGE2 )
  VALUE 40
    ASOF017 := A040 ( #AGE2 )
  VALUE 41
    ASOF017 := A041 ( #AGE2 )
  VALUE 42
    ASOF017 := A042 ( #AGE2 )
  VALUE 43
    ASOF017 := A043 ( #AGE2 )
  VALUE 44
    ASOF017 := A044 ( #AGE2 )
  VALUE 45
    ASOF017 := A045 ( #AGE2 )
  VALUE 46
    ASOF017 := A046 ( #AGE2 )
  VALUE 47
    ASOF017 := A047 ( #AGE2 )
  VALUE 48
    ASOF017 := A048 ( #AGE2 )
  VALUE 49
    ASOF017 := A049 ( #AGE2 )
  VALUE 50
    ASOF017 := A050 ( #AGE2 )
  VALUE 51
    ASOF017 := A051 ( #AGE2 )
  VALUE 52
    ASOF017 := A052 ( #AGE2 )
  VALUE 53
    ASOF017 := A053 ( #AGE2 )
  VALUE 54
    ASOF017 := A054 ( #AGE2 )
  NONE VALUE
    ASOF017 := ASOF016 (< #AGE1,#AGE2 >)
END-DECIDE
END-FUNCTION
END
