* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* ID ASOF016  - Joint and Survivor Annuity Option Life expectancy 55-64
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* NGG   20120712   None    Program written.                            *
*                                                                      *
************************************************************************
*
DEFINE FUNCTION ASOF016 RETURNS (N2.1)
  DEFINE DATA
  PARAMETER
  1 #AGE1    (N4)
  1 #AGE2    (N4)
  LOCAL
  1 A055 (N2.1/5:94) INIT <
    76.8,75.8,74.8,73.9,72.9,71.9,70.9,70,69,68,67.1,66.1,65.1,64.2,63.2,62.3,61.3,60.4,59.4,58.5,57.5,56.6,55.7,
    54.7,53.8,52.9,52,51.1,50.2,49.3,48.5,47.6,46.7,45.9,45.1,44.2,43.4,42.7,41.9,41.2,40.4,39.7,39,38.4,37.7,
  37.1,36.5,35.9,35.4,34.9,34.4,33.9,33.5,33.1,32.7,32.3,32,31.7,31.4,31.1 >
  1 A056 (N2.1/5:94) INIT <
    76.8,75.8,74.8,73.8,72.9,71.9,70.9,69.9,69,68,67,66.1,65.1,64.1,63.2,62.2,61.3,60.3,59.4,58.4,57.5,56.5,55.6,
    54.7,53.8,52.8,51.9,51,50.1,49.2,48.3,47.5,46.6,45.8,44.9,44.1,43.3,42.5,41.7,40.9,40.2,39.5,38.7,38.1,
        37.4,36.8,36.1,35.6,35,34.4,33.9,33.4,33,32.5,32.1,31.7,31.4,31,30.7,30.4 >
  1 A057 (N2.1/5:94) INIT <
    76.8,75.8,74.8,73.8,72.9,71.9,70.9,69.9,69,68,67,66.1,65.1,64.1,63.2,62.2,61.2,60.3,59.3,58.4,57.4,56.5,55.6,
    54.6,53.7,52.8,51.9,50.9,50,49.1,48.3,47.4,46.5,45.6,44.8,43.9,43.1,42.3,41.5,40.7,40,39.2,38.5,37.8,37.1,
                36.4,35.8,35.2,34.6,34,33.5,33,32.5,32,31.6,31.2,30.8,30.4,30.1,29.8 >
  1 A058 (N2.1/5:94) INIT <
    76.8,75.8,74.8,73.8,72.8,71.9,70.9,69.9,68.9,68,67,66,65.1,64.1,63.1,62.2,61.2,60.3,59.3,58.4,57.4,56.5,55.5,
    54.6,53.6,52.7,51.8,50.9,50,49.1,48.2,47.3,46.4,45.5,44.7,43.8,43,42.1,41.3,40.5,39.7,39,38.2,37.5,36.8,36.1,
    35.5,34.8,34.2,33.6,33.1,32.5,32,31.5,31.1,30.6,30.2,29.9,29.5,29.2 >
  1 A059 (N2.1/5:94) INIT <
    76.7,75.8,74.8,73.8,72.8,71.9,70.9,69.9,68.9,68,67,66,65,64.1,63.1,62.1,61.2,60.2,59.3,58.3,57.4,56.4,55.5,
    54.5,53.6,52.7,51.7,50.8,49.9,49,48.1,47.2,46.3,45.4,44.5,43.7,42.8,42,41.2,40.4,39.6,38.8,38,37.3,36.6,
            35.9,35.2,34.5,33.9,33.3,32.7,32.1,31.6,31.1,30.6,30.1,29.7,29.3,28.9,28.6 >
  1 A060 (N2.1/5:94) INIT <
    76.7,75.8,74.8,73.8,72.8,71.8,70.9,69.9,68.9,67.9,67,66,65,64.1,63.1,62.1,61.2,60.2,59.2,58.3,57.3,56.4,55.4,
    54.5,53.6,52.6,51.7,50.8,49.8,48.9,48,47.1,46.2,45.3,44.4,43.6,42.7,41.9,41,40.2,39.4,38.6,37.8,37.1,36.3,
    35.6,34.9,34.2,33.6,32.9,32.3,31.7,31.2,30.6,30.1,29.7,29.2,28.8,28.4,28 >
  1 A061 (N2.1/5:94) INIT <
    76.7,75.7,74.8,73.8,72.8,71.8,70.9,69.9,68.9,67.9,67,66,65,64,63.1,62.1,61.1,60.2,59.2,58.3,57.3,56.4,55.4,
    54.5,53.5,52.6,51.6,50.7,49.8,48.9,47.9,47,46.1,45.2,44.3,43.5,42.6,41.7,40.9,40,39.2,38.4,37.6,36.9,36.1,
        35.4,34.6,33.9,33.3,32.6,32,31.4,30.8,30.2,29.7,29.2,28.7,28.3,27.8,27.4 >
  1 A062 (N2.1/5:94) INIT <
    76.7,75.7,74.8,73.8,72.8,71.8,70.8,69.9,68.9,67.9,66.9,66,65,64,63.1,62.1,61.1,60.2,59.2,58.2,57.3,56.3,55.4,
    54.4,53.5,52.5,51.6,50.7,49.7,48.8,47.9,47,46,45.1,44.2,43.4,42.5,41.6,40.8,39.9,39.1,38.3,37.5,36.7,35.9,
                  35.1,34.4,33.7,33,32.3,31.7,31,30.4,29.9,29.3,28.8,28.3,27.8,27.3,26.9 >
  1 A063 (N2.1/5:94) INIT <
    76.7,75.7,74.8,73.8,72.8,71.8,70.8,69.9,68.9,67.9,66.9,66,65,64,63,62.1,61.1,60.1,59.2,58.2,57.3,56.3,55.3,
    54.4,53.4,52.5,51.6,50.6,49.7,48.7,47.8,46.9,46,45.1,44.2,43.3,42.4,41.5,40.6,39.8,38.9,38.1,37.3,36.5,35.7,
        34.9,34.2,33.5,32.7,32,31.4,30.7,30.1,29.5,28.9,28.4,27.8,27.3,26.9,26.4 >
  1 A064 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.8,72.8,71.8,70.8,69.8,68.9,67.9,66.9,65.9,65,64,63,62.1,61.1,60.1,59.2,58.2,57.2,56.3,55.3,
    54.4,53.4,52.5,51.5,50.6,49.6,48.7,47.8,46.8,45.9,45,44.1,43.2,42.3,41.4,40.5,39.7,38.8,38,37.2,36.3,35.5,
                  34.8,34,33.2,32.5,31.8,31.1,30.4,29.8,29.2,28.6,28,27.4,26.9,26.4,25.9 >
*
  END-DEFINE
RESET ASOF016
DECIDE ON FIRST VALUE OF #AGE1
  VALUE 55
    ASOF016 := A055 ( #AGE2 )
  VALUE 56
    ASOF016 := A056 ( #AGE2 )
  VALUE 57
    ASOF016 := A057 ( #AGE2 )
  VALUE 58
    ASOF016 := A058 ( #AGE2 )
  VALUE 59
    ASOF016 := A059 ( #AGE2 )
  VALUE 60
    ASOF016 := A060 ( #AGE2 )
  VALUE 61
    ASOF016 := A061 ( #AGE2 )
  VALUE 62
    ASOF016 := A062 ( #AGE2 )
  VALUE 63
    ASOF016 := A063 ( #AGE2 )
  VALUE 64
    ASOF016 := A064 ( #AGE2 )
  NONE VALUE
    ASOF016 := ASOF015 (< #AGE1,#AGE2 >)
END-DECIDE
END-FUNCTION
END
