* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
/** New Function ASOF008.
/**
/** :author nguentchev
* ID ASOF0007
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* NGG   20120712   None    Program written.                            *
*                                                                      *
************************************************************************
*
DEFINE FUNCTION Annuity-Survivor RETURNS (N4.3)
  DEFINE DATA
  PARAMETER
  1 #AGE    (N4)
  1 #GENDER (A1)
  LOCAL
  1 Annuity-SURVIVOR-M  (N4.3/0:115) INIT <
    2.311,
    0.906,
    0.504,
    0.408,
    0.357,
    0.324,
    0.301,
    0.286,
    0.328,
    0.362,
    0.390,
    0.413,
    0.431,
    0.446,
    0.458,
    0.470,
    0.481,
    0.495,
    0.510,
    0.528,
    0.549,
    0.573,
    0.599,
    0.627,
    0.657,
    0.686,
    0.714,
    0.738,
    0.758,
    0.774,
    0.784,
    0.789,
    0.789,
    0.790,
    0.791,
    0.792,
    0.794,
    0.823,
    0.872,
    0.945,
    1.043,
    1.168,
    1.322,
    1.505,
    1.715,
    1.948,
    2.198,
    2.463,
    2.740,
    3.028,
    3.330,
    3.647,
    3.980,
    4.331,
    4.698,
    5.077,
    5.465,
    5.861,
    6.265,
    6.694,
    7.170,
    7.714,
    8.348,
    9.093,
    9.968,
    10.993,
    12.188,
    13.572,
    15.160,
    16.946,
    18.920,
    21.071,
    23.388,
    25.871,
    28.552,
    31.477,
    34.686,
    38.225,
    42.132,
    46.427,
    51.128,
    56.250,
    61.809,
    67.826,
    74.322,
    81.326,
    88.863,
    96.958,
    105.631,
    114.858,
    124.612,
    134.861,
    145.575,
    156.727,
    168.290,
    180.245,
    192.565,
    205.229,
    218.683,
    233.371,
    249.741,
    268.237,
    289.305,
    313.391,
    340.940,
    372.398,
    408.210,
    448.823,
    494.681,
    546.231,
    603.917,
    668.186,
    739.483,
    818.254,
    904.945,
1000.000
  >
  1 Annuity-SURVIVOR-F  (N4.3/0:115) INIT <
    1.794,
    0.755,
    0.392,
    0.290,
    0.232,
    0.189,
    0.156,
    0.131,
    0.131,
    0.134,
    0.140,
    0.148,
    0.158,
    0.170,
    0.183,
    0.197,
    0.212,
    0.228,
    0.244,
    0.260,
    0.277,
    0.294,
    0.312,
    0.330,
    0.349,
    0.367,
    0.385,
    0.403,
    0.419,
    0.435,
    0.450,
    0.463,
    0.476,
    0.488,
    0.500,
    0.515,
    0.534,
    0.558,
    0.590,
    0.630,
    0.677,
    0.732,
    0.796,
    0.868,
    0.950,
    1.043,
    1.148,
    1.267,
    1.400,
    1.548,
    1.710,
    1.888,
    2.079,
    2.286,
    2.507,
    2.746,
    3.003,
    3.280,
    3.578,
    3.907,
    4.277,
    4.699,
    5.181,
    5.732,
    6.347,
    7.017,
    7.734,
    8.491,
    9.288,
    10.163,
    11.165,
    12.339,
    13.734,
    15.391,
    17.326,
    19.551,
    22.075,
    24.910,
    28.074,
    31.612,
    35.580,
    40.030,
    45.017,
    50.600,
    56.865,
    63.907,
    71.815,
    80.682,
    90.557,
    101.307,
    112.759,
    124.733,
    137.054,
    149.552,
    162.079,
    174.492,
    186.647,
    198.403,
    210.337,
    223.027,
    237.051,
    252.985,
    271.406,
    292.893,
    318.023,
    347.373,
    381.520,
    421.042,
    466.516,
    518.520,
    577.631,
    644.427,
    719.484,
    803.380,
    896.693,
1000.000
  >
  END-DEFINE
*
RESET Annuity-Survivor
IF #AGE > 115
  #AGE := 115
END-IF
IF #GENDER = 'M'
  Annuity-Survivor := Annuity-SURVIVOR-M ( #AGE )
ELSE
  Annuity-Survivor := Annuity-SURVIVOR-F ( #AGE )
END-IF
*
END-FUNCTION
END
