* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* ID ASOF011  - Joint and Survivor Annuity Option Life expectancy 105-115
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* NGG   20120712   None    Program written.                            *
*                                                                      *
************************************************************************
*
DEFINE FUNCTION ASOF011 RETURNS (N2.1)
  DEFINE DATA
  PARAMETER
  1 #AGE1    (N4)
  1 #AGE2    (N4)
  LOCAL
  1 A105 (N2.1/5:115) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.5,40.6,39.6,38.7,37.7,36.8,35.9,34.9,34,
    33.1,32.2,31.3,30.4,29.5,28.6,27.7,26.8,25.9,25.1,24.2,23.3,22.5,21.6,20.8,20,19.2,18.4,17.6,16.8,16.1,15.4,
    14.6,13.9,13.3,12.6,12,11.3,10.7,10.2,9.6,9.1,8.5,8,7.6,7.1,6.7,6.3,6,5.6,5.3,5,4.8,4.5,4.3,4.1,3.9,3.7,3.6,
                3.4,3.2,3.1,2.9,2.8,2.7,2.5,2.4,2.3,2.2,2.1,2,2,1.9,1.8,1.8,1.8 >
  1 A106 (N2.1/5:115) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.5,40.6,39.6,38.7,37.7,36.8,35.9,34.9,34,
    33.1,32.2,31.3,30.4,29.5,28.6,27.7,26.8,25.9,25.1,24.2,23.3,22.5,21.6,20.8,20,19.2,18.4,17.6,16.8,16.1,15.3,
    14.6,13.9,13.3,12.6,11.9,11.3,10.7,10.1,9.6,9,8.5,8,7.5,7.1,6.7,6.3,5.9,5.6,5.3,5,4.7,4.5,4.2,4,3.8,3.6,3.5,
            3.3,3.1,3,2.8,2.7,2.5,2.4,2.3,2.2,2.1,2,1.9,1.8,1.7,1.7,1.6,1.6 >
  1 A107 (N2.1/5:115) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.5,40.6,39.6,38.7,37.7,36.8,35.9,34.9,34,
    33.1,32.2,31.3,30.4,29.5,28.6,27.7,26.8,25.9,25.1,24.2,23.3,22.5,21.6,20.8,20,19.2,18.4,17.6,16.8,16.1,15.3,
    14.6,13.9,13.2,12.6,11.9,11.3,10.7,10.1,9.6,9,8.5,8,7.5,7.1,6.6,6.2,5.9,5.5,5.2,4.9,4.6,4.4,4.2,4,3.8,3.6,3.4,
        3.2,3.1,2.9,2.7,2.6,2.4,2.3,2.2,2.1,1.9,1.8,1.7,1.7,1.6,1.5,1.5,1.4 >
  1 A108 (N2.1/5:115) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.5,40.6,39.6,38.7,37.7,36.8,35.9,34.9,34,
    33.1,32.2,31.3,30.4,29.5,28.6,27.7,26.8,25.9,25.1,24.2,23.3,22.5,21.6,20.8,20,19.2,18.4,17.6,16.8,16.1,15.3,
    14.6,13.9,13.2,12.6,11.9,11.3,10.7,10.1,9.5,9,8.5,8,7.5,7,6.6,6.2,5.8,5.5,5.2,4.9,4.6,4.3,4.1,3.9,3.7,3.5,
      3.3,3.1,3,2.8,2.7,2.5,2.3,2.2,2.1,1.9,1.8,1.7,1.6,1.5,1.5,1.4,1.3,1.3 >
  1 A109 (N2.1/5:115) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.5,40.6,39.6,38.7,37.7,36.8,35.9,34.9,34,
    33.1,32.2,31.3,30.4,29.5,28.6,27.7,26.8,25.9,25.1,24.2,23.3,22.5,21.6,20.8,20,19.2,18.4,17.6,16.8,16.1,15.3,
    14.6,13.9,13.2,12.6,11.9,11.3,10.7,10.1,9.5,9,8.4,7.9,7.5,7,6.6,6.2,5.8,5.5,5.1,4.8,4.5,4.3,4.1,3.8,3.6,3.4,
  3.3,3.1,2.9,2.7,2.6,2.4,2.3,2.1,2,1.8,1.7,1.6,1.5,1.4,1.3,1.3,1.2,1.1 >
  1 A110 (N2.1/5:115) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.5,40.6,39.6,38.7,37.7,36.8,35.9,34.9,
    34,33.1,32.2,31.3,30.4,29.5,28.6,27.7,26.8,25.9,25.1,24.2,23.3,22.5,21.6,20.8,20,19.2,18.4,17.6,16.8,16.1,
    15.3,14.6,13.9,13.2,12.6,11.9,11.3,10.7,10.1,9.5,9,8.4,7.9,7.4,7,6.6,6.2,5.8,5.4,5.1,4.8,4.5,4.3,4,3.8,3.6,
    3.4,3.2,3,2.8,2.7,2.5,2.3,2.2,2,1.9,1.7,1.6,1.5,1.4,1.3,1.2,1.1,1.1,1 >
  1 A111 (N2.1/5:115) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.5,40.6,39.6,38.7,37.7,36.8,35.9,34.9,
    34,33.1,32.2,31.3,30.4,29.5,28.6,27.7,26.8,25.9,25,24.2,23.3,22.5,21.6,20.8,20,19.2,18.4,17.6,16.8,16,
    15.3,14.6,13.9,13.2,12.5,11.9,11.3,10.7,10.1,9.5,8.9,8.4,7.9,7.4,7,6.5,6.1,5.7,5.4,5.1,4.8,4.5,4.2,4,
                  3.8,3.5,3.3,3.2,3,2.8,2.6,2.4,2.3,2.1,2,1.8,1.7,1.5,1.4,1.3,1.2,1.1,1,0.9,0.9 >
  1 A112 (N2.1/5:115) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.5,40.6,39.6,38.7,37.7,36.8,35.9,34.9,34,
    33.1,32.2,31.3,30.4,29.5,28.6,27.7,26.8,25.9,25,24.2,23.3,22.5,21.6,20.8,20,19.2,18.4,17.6,16.8,16,15.3,
    14.6,13.9,13.2,12.5,11.9,11.3,10.6,10.1,9.5,8.9,8.4,7.9,7.4,7,6.5,6.1,5.7,5.4,5,4.7,4.4,4.2,3.9,3.7,3.5,
                3.3,3.1,2.9,2.8,2.6,2.4,2.2,2.1,1.9,1.7,1.6,1.5,1.3,1.2,1.1,1,0.9,0.8,0.8 >
  1 A113 (N2.1/5:115) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.5,40.6,39.6,38.7,37.7,36.8,35.9,34.9,
    34,33.1,32.2,31.3,30.4,29.5,28.6,28.6,28.6,27.7,27.7,27.7,26.8,26.8,26.8,25.9,20,19.2,18.4,17.6,16.8,16,
    15.3,14.6,13.9,13.2,12.5,11.9,11.2,10.6,10,9.5,8.9,8.4,7.9,7.4,6.9,6.5,6.1,5.7,5.4,5,4.7,4.4,4.2,3.9,3.7,
              3.5,3.3,3.1,2.9,2.7,2.5,2.4,2.2,2,1.8,1.7,1.5,1.4,1.3,1.1,1,0.9,0.8,0.7,0.7 >
  1 A114 (N2.1/5:115) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.5,40.6,39.6,38.7,37.7,36.8,35.9,34.9,34,
    33.1,32.2,31.3,30.4,29.5,25.9,25.9,25,25,25,24.2,24.2,24.2,23.3,23.3,20,19.2,18.4,17.6,16.8,16,15.3,14.6,
    13.9,13.2,12.5,11.9,11.2,10.6,10,9.5,8.9,8.4,7.9,7.4,6.9,6.5,6.1,5.7,5.3,5,4.7,4.4,4.1,3.9,3.7,3.5,3.3,3.1,
            2.9,2.7,2.5,2.3,2.1,2,1.8,1.6,1.5,1.3,1.2,1.1,0.9,0.8,0.7,0.6,0.6 >
  1 A115 (N2.1/5:115) INIT <
    76.6,75.6,74.7,73.7,72.7,71.7,70.7,69.7,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,59.9,59,58,57,56,55.1,
    54.1,53.1,52.2,51.2,50.2,49.3,48.3,47.3,46.4,45.4,44.4,43.5,42.5,41.5,40.6,39.6,38.7,37.7,36.8,35.9,34.9,34,
    33.1,32.2,31.3,30.4,29.5,23.3,22.5,22.5,22.5,21.8,21.8,21.8,20.8,20.8,20.8,20,19.2,18.4,17.6,16.8,16,15.3,14.6,
    13.9,13.2,12.5,11.9,11.2,10.6,10,9.5,8.9,8.4,7.9,7.4,6.9,6.5,6.1,5.7,5.3,5,4.7,4.4,4.1,3.9,3.7,3.4,3.2,3,2.8,
          2.7,2.5,2.3,2.1,1.9,1.8,1.6,1.4,1.3,1.1,1,0.9,0.8,0.7,0.6,0.5
            >
*
  END-DEFINE
RESET ASOF011
DECIDE ON FIRST VALUE OF #AGE1
  VALUE 105
    ASOF011 := A105 ( #AGE2 )
  VALUE 106
    ASOF011 := A106 ( #AGE2 )
  VALUE 107
    ASOF011 := A107 ( #AGE2 )
  VALUE 108
    ASOF011 := A108 ( #AGE2 )
  VALUE 109
    ASOF011 := A109 ( #AGE2 )
  VALUE 110
    ASOF011 := A110 ( #AGE2 )
  VALUE 111
    ASOF011 := A111 ( #AGE2 )
  VALUE 112
    ASOF011 := A112 ( #AGE2 )
  VALUE 113
    ASOF011 := A113 ( #AGE2 )
  VALUE 114
    ASOF011 := A114 ( #AGE2 )
  VALUE 115
    ASOF011 := A115 ( #AGE2 )
  NONE VALUE IGNORE
END-DECIDE
END-FUNCTION
END
