* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* ID ASOF014  - Joint and Survivor Annuity Option Life expectancy 75-84
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* NGG   20120712   None    Program written.                            *
*                                                                      *
************************************************************************
*
DEFINE FUNCTION ASOF014 RETURNS (N2.1)
  DEFINE DATA
  PARAMETER
  1 #AGE1    (N4)
  1 #AGE2    (N4)
  LOCAL
  1 A075 (N2.1/5:94) INIT <
    76.7,75.7,74.7,73.7,72.7,71.7,70.8,69.8,68.8,67.8,66.8,65.9,64.9,63.9,62.9,61.9,61,60,59,58.1,57.1,56.1,55.1,
    54.2,53.2,52.2,51.3,50.3,49.4,48.4,47.4,46.5,45.5,44.6,43.6,42.7,41.8,40.8,39.9,39,38.1,37.1,36.2,35.3,34.5,
    33.6,32.7,31.8,31,30.1,29.3,28.5,27.7,26.9,26.1,25.3,24.6,23.8,23.1,22.4,21.8,21.1,20.5,19.9,19.3,18.8,18.3,
    17.8,17.3,16.9,16.5,16.1,15.8,15.4,15.1,14.9,14.6,14.4,14.2,14 >
  1 A076 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.8,69.8,68.8,67.8,66.8,65.9,64.9,63.9,62.9,61.9,61,60,59,58,57.1,56.1,55.1,
    54.2,53.2,52.2,51.3,50.3,49.3,48.4,47.4,46.5,45.5,44.6,43.6,42.7,41.7,40.8,39.9,38.9,38,37.1,36.2,35.3,34.4,
    33.5,32.6,31.8,30.9,30.1,29.2,28.4,27.6,26.8,26,25.2,24.4,23.7,23,22.3,21.6,20.9,20.3,19.7,19.1,18.5,18,17.5,
          17,16.5,16.1,15.7,15.4,15,14.7,14.4,14.1,13.9,13.7,13.5 >
  1 A077 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.8,69.8,68.8,67.8,66.8,65.8,64.9,63.9,62.9,61.9,61,60,59,58,57.1,56.1,55.1,
    54.2,53.2,52.2,51.3,50.3,49.3,48.4,47.4,46.5,45.5,44.6,43.6,42.7,41.7,40.8,39.8,38.9,38,37.1,36.2,35.3,34.4,
    33.5,32.6,31.7,30.8,30,29.1,28.3,27.5,26.7,25.9,25.1,24.3,23.6,22.8,22.1,21.4,20.7,20.1,19.4,18.8,18.3,17.7,
    17.2,16.7,16.2,15.8,15.4,15,14.6,14.3,14,13.7,13.4,13.2,13 >
  1 A078 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.8,68.8,67.8,66.8,65.8,64.9,63.9,62.9,61.9,61,60,59,58,57.1,56.1,55.1,
    54.2,53.2,52.2,51.3,50.3,49.3,48.4,47.4,46.4,45.5,44.5,43.6,42.6,41.7,40.7,39.8,38.9,38,37,36.1,35.2,34.3,
    33.4,32.5,31.7,30.8,29.9,29.1,28.2,27.4,26.6,25.8,25,24.2,23.4,22.7,21.9,21.2,20.5,19.9,19.2,18.6,18,17.5,
          16.9,16.4,15.9,15.4,15,14.6,14.2,13.9,13.5,13.2,13,12.7,12.5 >
  1 A079 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.8,68.8,67.8,66.8,65.8,64.9,63.9,62.9,61.9,61,60,59,58,57.1,56.1,55.1,
    54.1,53.2,52.2,51.2,50.3,49.3,48.4,47.4,46.4,45.5,44.5,43.6,42.6,41.7,40.7,39.8,38.9,37.9,37,36.1,35.2,34.3,
    33.4,32.5,31.6,30.7,29.9,29,28.2,27.3,26.5,25.7,24.9,24.1,23.3,22.6,21.8,21.1,20.4,19.7,19,18.4,17.8,17.2,
    16.7,16.1,15.6,15.1,14.7,14.3,13.9,13.5,13.2,12.8,12.5,12.3,12 >
  1 A080 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.8,68.8,67.8,66.8,65.8,64.9,63.9,62.9,61.9,60.9,60,59,58,57.1,56.1,55.1,
    54.1,53.2,52.2,51.2,50.3,49.3,48.3,47.4,46.4,45.5,44.5,43.6,42.6,41.7,40.7,39.8,38.8,37.9,37,36.1,35.2,34.2,
    33.4,32.5,31.6,30.7,29.8,29,28.1,27.3,26.4,25.6,24.8,24,23.2,22.4,21.7,21,20.2,19.5,18.9,18.2,17.6,17,16.4,
            15.9,15.4,14.9,14.4,14,13.5,13.2,12.8,12.5,12.2,11.9,11.6 >
  1 A081 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.8,68.8,67.8,66.8,65.8,64.9,63.9,62.9,61.9,60.9,60,59,58,57,56.1,55.1,
    54.1,53.2,52.2,51.2,50.3,49.3,48.3,47.4,46.4,45.5,44.5,43.5,42.6,41.6,40.7,39.8,38.8,37.9,37,36,35.1,34.2,33.3,
    32.4,31.5,30.7,29.8,28.9,28.1,27.2,26.4,25.5,24.7,23.9,23.1,22.3,21.6,20.8,20.1,19.4,18.7,18.1,17.4,16.8,16.2,
    15.7,15.1,14.6,14.1,13.7,13.2,12.8,12.5,12.1,11.8,11.5,11.2 >
  1 A082 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.8,68.8,67.8,66.8,65.8,64.9,63.9,62.9,61.9,60.9,60,59,58,57,56.1,55.1,
    54.1,53.2,52.2,51.2,50.3,49.3,48.3,47.4,46.4,45.4,44.5,43.5,42.6,41.6,40.7,39.7,38.8,37.9,36.9,36,35.1,34.2,
    33.3,32.4,31.5,30.6,29.7,28.9,28,27.2,26.3,25.5,24.6,23.8,23,22.3,21.5,20.7,20,19.3,18.6,17.9,17.3,16.6,16,
                  15.5,14.9,14.4,13.9,13.4,13,12.5,12.2,11.8,11.5,11.1,10.9 >
  1 A083 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.8,68.8,67.8,66.8,65.8,64.9,63.9,62.9,61.9,60.9,60,59,58,57,56.1,55.1,
    54.1,53.2,52.2,51.2,50.3,49.3,48.3,47.4,46.4,45.4,44.5,43.5,42.6,41.6,40.7,39.7,38.8,37.9,36.9,36,35.1,34.2,
    33.3,32.4,31.5,30.6,29.7,28.8,28,27.1,26.3,25.4,24.6,23.8,23,22.2,21.4,20.6,19.9,19.2,18.5,17.8,17.1,16.5,
          15.9,15.3,14.7,14.2,13.7,13.2,12.7,12.3,11.9,11.5,11.1,10.8,10.5  >
  1 A084 (N2.1/5:94) INIT <
    76.6,75.7,74.7,73.7,72.7,71.7,70.7,69.8,68.8,67.8,66.8,65.8,64.8,63.9,62.9,61.9,60.9,60,59,58,57,56.1,55.1,
    54.1,53.2,52.2,51.2,50.3,49.3,48.3,47.4,46.4,45.4,44.5,43.5,42.6,41.6,40.7,39.7,38.8,37.8,36.9,36,35.1,34.2,
    33.2,32.3,31.4,30.6,29.7,28.8,27.9,27.1,26.2,25.4,24.5,23.7,22.9,22.1,21.3,20.5,19.8,19.1,18.4,17.7,17,16.3,
    15.7,15.1,14.5,14,13.5,13,12.5,12,11.6,11.2,10.9,10.5,10.2  >
*
  END-DEFINE
RESET ASOF014
DECIDE ON FIRST VALUE OF #AGE1
  VALUE 75
    ASOF014 := A075 ( #AGE2 )
  VALUE 76
    ASOF014 := A076 ( #AGE2 )
  VALUE 77
    ASOF014 := A077 ( #AGE2 )
  VALUE 78
    ASOF014 := A078 ( #AGE2 )
  VALUE 79
    ASOF014 := A079 ( #AGE2 )
  VALUE 80
    ASOF014 := A080 ( #AGE2 )
  VALUE 81
    ASOF014 := A081 ( #AGE2 )
  VALUE 82
    ASOF014 := A082 ( #AGE2 )
  VALUE 83
    ASOF014 := A083 ( #AGE2 )
  VALUE 84
    ASOF014 := A084 ( #AGE2 )
  NONE VALUE
    ASOF014 := ASOF013 (< #AGE1,#AGE2 >)
END-DECIDE
END-FUNCTION
END
