DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-ATHA03P2
  2 #TRAN-CODE-IN (A4)
  2 #ACCT-NUM-IN (A4)
  2 #CAT-1-IN (A2)
  2 #AMT-SIGN-IN (A1)
  2 #ACCT-NUM-OUT (A4)
  2 #D-C-OUT (A1)
  2 #CN-IN (N6)
  2 #AMT-IN (N6.2)
  2 #SOURCE-IN (A2)
END-DEFINE
