DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
/*  ATHISMTE created by ACCORD on: 02/09/05 at: 08:50:24.4
/*  start of original copybook: ATHISMTE
 1 MORT-TABLE-E
/*  58 CSO @ 5%
/*  DX NX MX
   2 F14
     3 F14DX (N8) INIT
       <49278152>
     3 F14NX (N9) INIT
       <939398916>
     3 F14MX (N9) INIT
       <454486987>
   2 F15
     3 F15DX (N8) INIT
       <46866338>
     3 F15NX (N9) INIT
       <890120764>
     3 F15MX (N9) INIT
       <447963433>
   2 F16
     3 F16DX (N8) INIT
       <44569441>
     3 F16NX (N9) INIT
       <843254426>
     3 F16MX (N9) INIT
       <441446797>
   2 F17
     3 F17DX (N8) INIT
       <42381716>
     3 F17NX (N9) INIT
       <798684985>
     3 F17MX (N9) INIT
       <434909764>
   2 F18
     3 F18DX (N8) INIT
       <40298148>
     3 F18NX (N9) INIT
       <756303269>
     3 F18MX (N9) INIT
       <428370716>
   2 F19
     3 F19DX (N8) INIT
       <38314329>
     3 F19NX (N9) INIT
       <716005121>
     3 F19MX (N9) INIT
       <421884636>
   2 F20
     3 F20DX (N8) INIT
       <36426346>
     3 F20NX (N9) INIT
       <677690792>
     3 F20MX (N9) INIT
       <415535556>
   2 F21
     3 F21DX (N8) INIT
       <34629661>
     3 F21NX (N9) INIT
       <641264446>
     3 F21MX (N9) INIT
       <409325853>
   2 F22
     3 F22DX (N8) INIT
       <32920276>
     3 F22NX (N9) INIT
       <606634785>
     3 F22MX (N9) INIT
       <403290494>
   2 F23
     3 F23DX (N8) INIT
       <31294328>
     3 F23NX (N9) INIT
       <573714509>
     3 F23MX (N9) INIT
       <397458861>
   2 F24
     3 F24DX (N8) INIT
       <29747791>
     3 F24NX (N9) INIT
       <542420181>
     3 F24MX (N9) INIT
       <391825857>
   2 F25
     3 F25DX (N8) INIT
       <28277118>
     3 F25NX (N9) INIT
       <512672390>
     3 F25MX (N9) INIT
       <386414729>
   2 F26
     3 F26DX (N8) INIT
       <26878612>
     3 F26NX (N9) INIT
       <484395272>
     3 F26MX (N9) INIT
       <381217119>
   2 F27
     3 F27DX (N8) INIT
       <25548506>
     3 F27NX (N9) INIT
       <457516660>
     3 F27MX (N9) INIT
       <376199784>
   2 F28
     3 F28DX (N8) INIT
       <24283491>
     3 F28NX (N9) INIT
       <431968154>
     3 F28MX (N9) INIT
       <371357852>
   2 F29
     3 F29DX (N8) INIT
       <23080187>
     3 F29NX (N9) INIT
       <407684663>
     3 F29MX (N9) INIT
       <366663157>
   2 F30
     3 F30DX (N8) INIT
       <21935411>
     3 F30NX (N9) INIT
       <384604476>
     3 F30MX (N9) INIT
       <362091139>
   2 F31
     3 F31DX (N8) INIT
       <20846369>
     3 F31NX (N9) INIT
       <362669065>
     3 F31MX (N9) INIT
       <357641420>
   2 F32
     3 F32DX (N8) INIT
       <19810206>
     3 F32NX (N9) INIT
       <341822696>
     3 F32MX (N9) INIT
       <353293413>
   2 F33
     3 F33DX (N8) INIT
       <18824412>
     3 F33NX (N9) INIT
       <322012490>
     3 F33MX (N9) INIT
       <349048320>
   2 F34
     3 F34DX (N8) INIT
       <17886418>
     3 F34NX (N9) INIT
       <303188078>
     3 F34MX (N9) INIT
       <344889068>
   2 F35
     3 F35DX (N8) INIT
       <16993802>
     3 F35NX (N9) INIT
       <285301660>
     3 F35MX (N9) INIT
       <340800791>
   2 F36
     3 F36DX (N8) INIT
       <16143950>
     3 F36NX (N9) INIT
       <268307858>
     3 F36MX (N9) INIT
       <336738507>
   2 F37
     3 F37DX (N8) INIT
       <15334599>
     3 F37NX (N9) INIT
       <252163908>
     3 F37MX (N9) INIT
       <332679413>
   2 F38
     3 F38DX (N8) INIT
       <14563487>
     3 F38NX (N9) INIT
       <236829309>
     3 F38MX (N9) INIT
       <328590134>
   2 F39
     3 F39DX (N8) INIT
       <13828241>
     3 F39NX (N9) INIT
       <222265822>
     3 F39MX (N9) INIT
       <324415333>
   2 F40
     3 F40DX (N8) INIT
       <13126951>
     3 F40NX (N9) INIT
       <208437581>
     3 F40MX (N9) INIT
       <320135213>
   2 F41
     3 F41DX (N8) INIT
       <12457727>
     3 F41NX (N9) INIT
       <195310630>
     3 F41MX (N9) INIT
       <315722057>
   2 F42
     3 F42DX (N8) INIT
       <11818941>
     3 F42NX (N9) INIT
       <182852903>
     3 F42MX (N9) INIT
       <311166030>
   2 F43
     3 F43DX (N8) INIT
       <11209197>
     3 F43NX (N9) INIT
       <171033962>
     3 F43MX (N9) INIT
       <306472219>
   2 F44
     3 F44DX (N8) INIT
       <10627066>
     3 F44NX (N9) INIT
       <159824765>
     3 F44MX (N9) INIT
       <301636263>
   2 F45
     3 F45DX (N8) INIT
       <10071220>
     3 F45NX (N9) INIT
       <149197699>
     3 F45MX (N9) INIT
       <296656746>
   2 F46
     3 F46DX (N8) INIT
       <09540323>
     3 F46NX (N9) INIT
       <139126479>
     3 F46MX (N9) INIT
       <291525235>
   2 F47
     3 F47DX (N8) INIT
       <09033050>
     3 F47NX (N9) INIT
       <129586156>
     3 F47MX (N9) INIT
       <286228127>
   2 F48
     3 F48DX (N8) INIT
       <08548191>
     3 F48NX (N9) INIT
       <120553106>
     3 F48MX (N9) INIT
       <280756680>
   2 F49
     3 F49DX (N8) INIT
       <08084553>
     3 F49NX (N9) INIT
       <112004915>
     3 F49MX (N9) INIT
       <275098580>
   2 F50
     3 F50DX (N8) INIT
       <07641058>
     3 F50NX (N9) INIT
       <103920362>
     3 F50MX (N9) INIT
       <269246861>
   2 F51
     3 F51DX (N8) INIT
       <07216652>
     3 F51NX (N9) INIT
       <096279304>
     3 F51MX (N9) INIT
       <263192265>
   2 F52
     3 F52DX (N8) INIT
       <06810389>
     3 F52NX (N9) INIT
       <089062652>
     3 F52MX (N9) INIT
       <256930998>
   2 F53
     3 F53DX (N8) INIT
       <06421483>
     3 F53NX (N9) INIT
       <082252263>
     3 F53MX (N9) INIT
       <250470860>
   2 F54
     3 F54DX (N8) INIT
       <06049098>
     3 F54NX (N9) INIT
       <075830780>
     3 F54MX (N9) INIT
       <243810840>
   2 F55
     3 F55DX (N8) INIT
       <05692489>
     3 F55NX (N9) INIT
       <069781682>
     3 F55MX (N9) INIT
       <236955174>
   2 F56
     3 F56DX (N8) INIT
       <05350940>
     3 F56NX (N9) INIT
       <064089193>
     3 F56MX (N9) INIT
       <229907339>
   2 F57
     3 F57DX (N8) INIT
       <05023717>
     3 F57NX (N9) INIT
       <058738253>
     3 F57MX (N9) INIT
       <222665732>
   2 F58
     3 F58DX (N8) INIT
       <04710141>
     3 F58NX (N9) INIT
       <053714536>
     3 F58MX (N9) INIT
       <215230616>
   2 F59
     3 F59DX (N8) INIT
       <04409590>
     3 F59NX (N9) INIT
       <049004395>
     3 F59MX (N9) INIT
       <207604687>
   2 F60
     3 F60DX (N8) INIT
       <04121538>
     3 F60NX (N9) INIT
       <044594805>
     3 F60MX (N9) INIT
       <199797602>
   2 F61
     3 F61DX (N8) INIT
       <03845434>
     3 F61NX (N9) INIT
       <040473267>
     3 F61MX (N9) INIT
       <191813569>
   2 F62
     3 F62DX (N8) INIT
       <03580869>
     3 F62NX (N9) INIT
       <036627833>
     3 F62MX (N9) INIT
       <183668594>
   2 F63
     3 F63DX (N8) INIT
       <03327445>
     3 F63NX (N9) INIT
       <033046964>
     3 F63MX (N9) INIT
       <175378027>
   2 F64
     3 F64DX (N8) INIT
       <03084795>
     3 F64NX (N9) INIT
       <029719519>
     3 F64MX (N9) INIT
       <166957996>
   2 F65
     3 F65DX (N8) INIT
       <02852583>
     3 F65NX (N9) INIT
       <026634724>
     3 F65MX (N9) INIT
       <158426334>
   2 F66
     3 F66DX (N8) INIT
       <02630489>
     3 F66NX (N9) INIT
       <023782141>
     3 F66MX (N9) INIT
       <149800659>
   2 F67
     3 F67DX (N8) INIT
       <02418197>
     3 F67NX (N9) INIT
       <021151652>
     3 F67MX (N9) INIT
       <141097514>
   2 F68
     3 F68DX (N8) INIT
       <02215437>
     3 F68NX (N9) INIT
       <018733455>
     3 F68MX (N9) INIT
       <132336736>
   2 F69
     3 F69DX (N8) INIT
       <02021998>
     3 F69NX (N9) INIT
       <016518018>
     3 F69MX (N9) INIT
       <123542513>
   2 F70
     3 F70DX (N8) INIT
       <01837880>
     3 F70NX (N9) INIT
       <014496020>
     3 F70MX (N9) INIT
       <114759325>
   2 F71
     3 F71DX (N8) INIT
       <01663210>
     3 F71NX (N9) INIT
       <012658140>
     3 F71MX (N9) INIT
       <106044282>
   2 F72
     3 F72DX (N8) INIT
       <01498237>
     3 F72NX (N9) INIT
       <010994929>
     3 F72MX (N9) INIT
       <097466854>
   2 F73
     3 F73DX (N8) INIT
       <01343205>
     3 F73NX (N9) INIT
       <009496692>
     3 F73MX (N9) INIT
       <089098144>
   2 F74
     3 F74DX (N8) INIT
       <01198318>
     3 F74NX (N9) INIT
       <008153487>
     3 F74MX (N9) INIT
       <081005645>
   2 F75
     3 F75DX (N8) INIT
       <01063513>
     3 F75NX (N9) INIT
       <006955169>
     3 F75MX (N9) INIT
       <073231422>
   2 F76
     3 F76DX (N8) INIT
       <00938555>
     3 F76NX (N9) INIT
       <005891656>
     3 F76MX (N9) INIT
       <065800005>
   2 F77
     3 F77DX (N8) INIT
       <00823086>
     3 F77NX (N9) INIT
       <004953101>
     3 F77MX (N9) INIT
       <058722395>
   2 F78
     3 F78DX (N8) INIT
       <00716712>
     3 F78NX (N9) INIT
       <004130015>
     3 F78MX (N9) INIT
       <052004435>
   2 F79
     3 F79DX (N8) INIT
       <00619061>
     3 F79NX (N9) INIT
       <003413303>
     3 F79MX (N9) INIT
       <045652312>
   2 F80
     3 F80DX (N8) INIT
       <00529923>
     3 F80NX (N9) INIT
       <002794242>
     3 F80MX (N9) INIT
       <039686322>
   2 F81
     3 F81DX (N8) INIT
       <00449183>
     3 F81NX (N9) INIT
       <002264319>
     3 F81MX (N9) INIT
       <034135770>
   2 F82
     3 F82DX (N8) INIT
       <00376736>
     3 F82NX (N9) INIT
       <001815136>
     3 F82MX (N9) INIT
       <029030071>
   2 F83
     3 F83DX (N8) INIT
       <00312450>
     3 F83NX (N9) INIT
       <001438400>
     3 F83MX (N9) INIT
       <024395498>
   2 F84
     3 F84DX (N8) INIT
       <00256096>
     3 F84NX (N9) INIT
       <001125950>
     3 F84MX (N9) INIT
       <020247943>
   2 F85
     3 F85DX (N8) INIT
       <00207313>
     3 F85NX (N9) INIT
       <000869854>
     3 F85MX (N9) INIT
       <016589175>
   2 F86
     3 F86DX (N8) INIT
       <00165626>
     3 F86NX (N9) INIT
       <000662541>
     3 F86MX (N9) INIT
       <013407598>
   2 F87
     3 F87DX (N8) INIT
       <00130478>
     3 F87NX (N9) INIT
       <000496915>
     3 F87MX (N9) INIT
       <010681563>
   2 F88
     3 F88DX (N8) INIT
       <00101260>
     3 F88NX (N9) INIT
       <000366437>
     3 F88MX (N9) INIT
       <008381046>
   2 F89
     3 F89DX (N8) INIT
       <00077319>
     3 F89NX (N9) INIT
       <000265177>
     3 F89MX (N9) INIT
       <006469165>
   2 F90
     3 F90DX (N8) INIT
       <00057992>
     3 F90NX (N9) INIT
       <000187858>
     3 F90MX (N9) INIT
       <004904661>
   2 F91
     3 F91DX (N8) INIT
       <00042630>
     3 F91NX (N9) INIT
       <000129866>
     3 F91MX (N9) INIT
       <003644629>
   2 F92
     3 F92DX (N8) INIT
       <00030622>
     3 F92NX (N9) INIT
       <000087236>
     3 F92MX (N9) INIT
       <002646788>
   2 F93
     3 F93DX (N8) INIT
       <00021408>
     3 F93NX (N9) INIT
       <000056614>
     3 F93MX (N9) INIT
       <001871232>
   2 F94
     3 F94DX (N8) INIT
       <00014490>
     3 F94NX (N9) INIT
       <000035206>
     3 F94MX (N9) INIT
       <001281382>
   2 F95
     3 F95DX (N8) INIT
       <00009430>
     3 F95NX (N9) INIT
       <000020716>
     3 F95MX (N9) INIT
       <000844384>
   2 F96
     3 F96DX (N8) INIT
       <00005827>
     3 F96NX (N9) INIT
       <000011286>
     3 F96MX (N9) INIT
       <000528928>
   2 F97
     3 F97DX (N8) INIT
       <00003326>
     3 F97NX (N9) INIT
       <000005459>
     3 F97MX (N9) INIT
       <000306648>
   2 F98
     3 F98DX (N8) INIT
       <00001621>
     3 F98NX (N9) INIT
       <000002133>
     3 F98MX (N9) INIT
       <000151914>
   2 F99
     3 F99DX (N8) INIT
       <00000512>
     3 F99NX (N9) INIT
       <000000512>
     3 F99MX (N9) INIT
       <000048783>
   2 F00
     3 F00DX (N8) INIT
       <00000001>
     3 F00NX (N9) INIT
       <000000001>
     3 F00MX (N9) INIT
       <000000100>
 1 REDEFINE MORT-TABLE-E /* BEGIN REDEFINE: MORT-TABLE-
   2 FILLER-4134 (1:87)
     3 TE-DX (N7.1)
     3 TE-NX (N8.1)
     3 TE-MX (N6.3)
END-DEFINE
