DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
/*  ATHISMTH created by ACCORD on: 31/08/05 at: 12:27:19.7
/*  start of original copybook: ATHISMTH
 1 MORT-TABLE-H
/*  80 CSO @ 5.5%
/*  DX NX MX
   2 F00
     3 F00DX (N8) INIT
       <99999999>
     3 F00NX (N10) INIT
       <1841077906>
     3 F00MX (N9) INIT
       <401963535>
   2 F01
     3 F01DX (N8) INIT
       <94537441>
     3 F01NX (N10) INIT
       <1741077906>
     3 F01MX (N9) INIT
       <377034625>
   2 F02
     3 F02DX (N8) INIT
       <89516651>
     3 F02NX (N10) INIT
       <1646540465>
     3 F02MX (N9) INIT
       <367804823>
   2 F03
     3 F03DX (N8) INIT
       <84765903>
     3 F03NX (N10) INIT
       <1557023814>
     3 F03MX (N9) INIT
       <359404506>
   2 F04
     3 F04DX (N8) INIT
       <80268890>
     3 F04NX (N10) INIT
       <1472257911>
     3 F04MX (N9) INIT
       <351610828>
   2 F05
     3 F05DX (N8) INIT
       <76013497>
     3 F05NX (N10) INIT
       <1391989021>
     3 F05MX (N9) INIT
       <344534865>
   2 F06
     3 F06DX (N8) INIT
       <71987299>
     3 F06NX (N10) INIT
       <1315975524>
     3 F06MX (N9) INIT
       <338194041>
   2 F07
     3 F07DX (N8) INIT
       <68177769>
     3 F07NX (N10) INIT
       <1243988225>
     3 F07MX (N9) INIT
       <332530249>
   2 F08
     3 F08DX (N8) INIT
       <64573070>
     3 F08NX (N10) INIT
       <1175810456>
     3 F08MX (N9) INIT
       <327489480>
   2 F09
     3 F09DX (N8) INIT
       <61160799>
     3 F09NX (N10) INIT
       <1111237386>
     3 F09MX (N9) INIT
       <322899259>
   2 F10
     3 F10DX (N8) INIT
       <57929421>
     3 F10NX (N10) INIT
       <1050076587>
     3 F10MX (N9) INIT
       <318609224>
   2 F11
     3 F11DX (N8) INIT
       <54868224>
     3 F11NX (N10) INIT
       <992147166>
     3 F11MX (N9) INIT
       <314491233>
   2 F12
     3 F12DX (N8) INIT
       <51965670>
     3 F12NX (N10) INIT
       <937278942>
     3 F12MX (N9) INIT
       <310278647>
   2 F13
     3 F13DX (N8) INIT
       <49211246>
     3 F13NX (N10) INIT
       <885313272>
     3 F13MX (N9) INIT
       <305747229>
   2 F14
     3 F14DX (N8) INIT
       <46595817>
     3 F14NX (N10) INIT
       <836102027>
     3 F14MX (N9) INIT
       <300755951>
   2 F15
     3 F15DX (N8) INIT
       <44112769>
     3 F15NX (N10) INIT
       <789506210>
     3 F15MX (N9) INIT
       <295367764>
   2 F16
     3 F16DX (N8) INIT
       <41756187>
     3 F16NX (N10) INIT
       <745393441>
     3 F16MX (N9) INIT
       <289681349>
   2 F17
     3 F17DX (N8) INIT
       <39520350>
     3 F17NX (N10) INIT
       <703637254>
     3 F17MX (N9) INIT
       <283873898>
   2 F18
     3 F18DX (N8) INIT
       <37401237>
     3 F18NX (N10) INIT
       <664116904>
     3 F18MX (N9) INIT
       <277902838>
   2 F19
     3 F19DX (N8) INIT
       <35393622>
     3 F19NX (N10) INIT
       <626715667>
     3 F19MX (N9) INIT
       <272124082>
   2 F20
     3 F20DX (N8) INIT
       <33492431>
     3 F20NX (N10) INIT
       <591322045>
     3 F20MX (N9) INIT
       <266521492>
   2 F21
     3 F21DX (N8) INIT
       <31693047>
     3 F21NX (N10) INIT
       <557829614>
     3 F21MX (N9) INIT
       <261188239>
   2 F22
     3 F22DX (N8) INIT
       <29990934>
     3 F22NX (N10) INIT
       <526136567>
     3 F22MX (N9) INIT
       <256201383>
   2 F23
     3 F23DX (N8) INIT
       <28381088>
     3 F23NX (N10) INIT
       <496145633>
     3 F23MX (N9) INIT
       <251567613>
   2 F24
     3 F24DX (N8) INIT
       <26858732>
     3 F24NX (N10) INIT
       <467764545>
     3 F24MX (N9) INIT
       <247290226>
   2 F25
     3 F25DX (N8) INIT
       <25419052>
     3 F25NX (N10) INIT
       <440905813>
     3 F25MX (N9) INIT
       <243344133>
   2 F26
     3 F26DX (N8) INIT
       <24057748>
     3 F26NX (N10) INIT
       <415486761>
     3 F26MX (N9) INIT
       <239730031>
   2 F27
     3 F27DX (N8) INIT
       <22770030>
     3 F27NX (N10) INIT
       <391429013>
     3 F27MX (N9) INIT
       <236377850>
   2 F28
     3 F28DX (N8) INIT
       <21551671>
     3 F28NX (N10) INIT
       <368658983>
     3 F28MX (N9) INIT
       <233248218>
   2 F29
     3 F29DX (N8) INIT
       <20398707>
     3 F29NX (N10) INIT
       <347107312>
     3 F29MX (N9) INIT
       <230306509>
   2 F30
     3 F30DX (N8) INIT
       <19307424>
     3 F30NX (N10) INIT
       <326708605>
     3 F30MX (N9) INIT
       <227522172>
   2 F31
     3 F31DX (N8) INIT
       <18274157>
     3 F31NX (N10) INIT
       <307401181>
     3 F31MX (N9) INIT
       <224850278>
   2 F32
     3 F32DX (N8) INIT
       <17295666>
     3 F32NX (N10) INIT
       <289127024>
     3 F32MX (N9) INIT
       <222269365>
   2 F33
     3 F33DX (N8) INIT
       <16368914>
     3 F33NX (N10) INIT
       <271831358>
     3 F33MX (N9) INIT
       <219761147>
   2 F34
     3 F34DX (N8) INIT
       <15491044>
     3 F34NX (N10) INIT
       <255462444>
     3 F34MX (N9) INIT
       <217309672>
   2 F35
     3 F35DX (N8) INIT
       <14659227>
     3 F35NX (N10) INIT
       <239971400>
     3 F35MX (N9) INIT
       <214886979>
   2 F36
     3 F36DX (N8) INIT
       <13870964>
     3 F36NX (N10) INIT
       <225312173>
     3 F36MX (N9) INIT
       <212483196>
   2 F37
     3 F37DX (N8) INIT
       <13123773>
     3 F37NX (N10) INIT
       <211441209>
     3 F37MX (N9) INIT
       <210077144>
   2 F38
     3 F38DX (N8) INIT
       <12415462>
     3 F38NX (N10) INIT
       <198317436>
     3 F38MX (N9) INIT
       <207663825>
   2 F39
     3 F39DX (N8) INIT
       <11743851>
     3 F39NX (N10) INIT
       <185901974>
     3 F39MX (N9) INIT
       <205227858>
   2 F40
     3 F40DX (N8) INIT
       <11106900>
     3 F40NX (N10) INIT
       <174158123>
     3 F40MX (N9) INIT
       <202756668>
   2 F41
     3 F41DX (N8) INIT
       <10502812>
     3 F41NX (N10) INIT
       <163051223>
     3 F41MX (N9) INIT
       <200251085>
   2 F42
     3 F42DX (N8) INIT
       <09929786>
     3 F42NX (N10) INIT
       <152548411>
     3 F42MX (N9) INIT
       <197702519>
   2 F43
     3 F43DX (N8) INIT
       <09386142>
     3 F43NX (N10) INIT
       <142618625>
     3 F43MX (N9) INIT
       <195104756>
   2 F44
     3 F44DX (N8) INIT
       <08870393>
     3 F44NX (N10) INIT
       <133232483>
     3 F44MX (N9) INIT
       <192462362>
   2 F45
     3 F45DX (N8) INIT
       <08381049>
     3 F45NX (N10) INIT
       <124362090>
     3 F45MX (N9) INIT
       <189771772>
   2 F46
     3 F46DX (N8) INIT
       <07916636>
     3 F46NX (N10) INIT
       <115981041>
     3 F46MX (N9) INIT
       <187023128>
   2 F47
     3 F47DX (N8) INIT
       <07475856>
     3 F47NX (N10) INIT
       <108064405>
     3 F47MX (N9) INIT
       <184216634>
   2 F48
     3 F48DX (N8) INIT
       <07057491>
     3 F48NX (N10) INIT
       <100588549>
     3 F48MX (N9) INIT
       <181353851>
   2 F49
     3 F49DX (N8) INIT
       <06660332>
     3 F49NX (N10) INIT
       <093531058>
     3 F49MX (N9) INIT
       <178430502>
   2 F50
     3 F50DX (N8) INIT
       <06283249>
     3 F50NX (N10) INIT
       <086870726>
     3 F50MX (N9) INIT
       <175444385>
   2 F51
     3 F51DX (N8) INIT
       <05925134>
     3 F51NX (N10) INIT
       <080587477>
     3 F51MX (N9) INIT
       <172389131>
   2 F52
     3 F52DX (N8) INIT
       <05584734>
     3 F52NX (N10) INIT
       <074662343>
     3 F52MX (N9) INIT
       <169238423>
   2 F53
     3 F53DX (N8) INIT
       <05261031>
     3 F53NX (N10) INIT
       <069077609>
     3 F53MX (N9) INIT
       <165982875>
   2 F54
     3 F54DX (N8) INIT
       <04953049>
     3 F54NX (N10) INIT
       <063816578>
     3 F54MX (N9) INIT
       <162611840>
   2 F55
     3 F55DX (N8) INIT
       <04659810>
     3 F55NX (N10) INIT
       <058863529>
     3 F55MX (N9) INIT
       <159109481>
   2 F56
     3 F56DX (N8) INIT
       <04380530>
     3 F56NX (N10) INIT
       <054203719>
     3 F56MX (N9) INIT
       <155474365>
   2 F57
     3 F57DX (N8) INIT
       <04114542>
     3 F57NX (N10) INIT
       <049823189>
     3 F57MX (N9) INIT
       <151712503>
   2 F58
     3 F58DX (N8) INIT
       <03861196>
     3 F58NX (N10) INIT
       <045708647>
     3 F58MX (N9) INIT
       <147828082>
   2 F59
     3 F59DX (N8) INIT
       <03619826>
     3 F59NX (N10) INIT
       <041847451>
     3 F59MX (N9) INIT
       <143820489>
   2 F60
     3 F60DX (N8) INIT
       <03389735>
     3 F60NX (N10) INIT
       <038227625>
     3 F60MX (N9) INIT
       <139682568>
   2 F61
     3 F61DX (N8) INIT
       <03170318>
     3 F61NX (N10) INIT
       <034837890>
     3 F61MX (N9) INIT
       <135412470>
   2 F62
     3 F62DX (N8) INIT
       <02960927>
     3 F62NX (N10) INIT
       <031667572>
     3 F62MX (N9) INIT
       <131001079>
   2 F63
     3 F63DX (N8) INIT
       <02760903>
     3 F63NX (N10) INIT
       <028706645>
     3 F63MX (N9) INIT
       <126434790>
   2 F64
     3 F64DX (N8) INIT
       <02569681>
     3 F64NX (N10) INIT
       <025945742>
     3 F64MX (N9) INIT
       <121705932>
   2 F65
     3 F65DX (N8) INIT
       <02386807>
     3 F65NX (N10) INIT
       <023376061>
     3 F65MX (N9) INIT
       <116815003>
   2 F66
     3 F66DX (N8) INIT
       <02211993>
     3 F66NX (N10) INIT
       <020989254>
     3 F66MX (N9) INIT
       <111776688>
   2 F67
     3 F67DX (N8) INIT
       <02045035>
     3 F67NX (N10) INIT
       <018777261>
     3 F67MX (N9) INIT
       <106612562>
   2 F68
     3 F68DX (N8) INIT
       <01885735>
     3 F68NX (N10) INIT
       <016732226>
     3 F68MX (N9) INIT
       <101343927>
   2 F69
     3 F69DX (N8) INIT
       <01733911>
     3 F69NX (N10) INIT
       <014846491>
     3 F69MX (N9) INIT
       <095992359>
   2 F70
     3 F70DX (N8) INIT
       <01589265>
     3 F70NX (N10) INIT
       <013112580>
     3 F70MX (N9) INIT
       <090567107>
   2 F71
     3 F71DX (N8) INIT
       <01451022>
     3 F71NX (N10) INIT
       <011523315>
     3 F71MX (N9) INIT
       <085028026>
   2 F72
     3 F72DX (N8) INIT
       <01319343>
     3 F72NX (N10) INIT
       <010072293>
     3 F72MX (N9) INIT
       <079424746>
   2 F73
     3 F73DX (N8) INIT
       <01194287>
     3 F73NX (N10) INIT
       <008752950>
     3 F73MX (N9) INIT
       <073797220>
   2 F74
     3 F74DX (N8) INIT
       <01075221>
     3 F74NX (N10) INIT
       <007558663>
     3 F74MX (N9) INIT
       <068116709>
   2 F75
     3 F75DX (N8) INIT
       <00962236>
     3 F75NX (N10) INIT
       <006483442>
     3 F75MX (N9) INIT
       <062423651>
   2 F76
     3 F76DX (N8) INIT
       <00855587>
     3 F76NX (N10) INIT
       <005521206>
     3 F76MX (N9) INIT
       <056775183>
   2 F77
     3 F77DX (N8) INIT
       <00755552>
     3 F77NX (N10) INIT
       <004665619>
     3 F77MX (N9) INIT
       <051232111>
   2 F78
     3 F78DX (N8) INIT
       <00662408>
     3 F78NX (N10) INIT
       <003910067>
     3 F78MX (N9) INIT
       <045856586>
   2 F79
     3 F79DX (N8) INIT
       <00576327>
     3 F79NX (N10) INIT
       <003247659>
     3 F79MX (N9) INIT
       <040701737>
   2 F80
     3 F80DX (N8) INIT
       <00497280>
     3 F80NX (N10) INIT
       <002671332>
     3 F80MX (N9) INIT
       <035801592>
   2 F81
     3 F81DX (N8) INIT
       <00425115>
     3 F81NX (N10) INIT
       <002174052>
     3 F81MX (N9) INIT
       <031177595>
   2 F82
     3 F82DX (N8) INIT
       <00359627>
     3 F82NX (N10) INIT
       <001748937>
     3 F82MX (N9) INIT
       <026845051>
   2 F83
     3 F83DX (N8) INIT
       <00300601>
     3 F83NX (N10) INIT
       <001389310>
     3 F83MX (N9) INIT
       <022817230>
   2 F84
     3 F84DX (N8) INIT
       <00247903>
     3 F84NX (N10) INIT
       <001088709>
     3 F84MX (N9) INIT
       <019114575>
   2 F85
     3 F85DX (N8) INIT
       <00201457>
     3 F85NX (N10) INIT
       <000840806>
     3 F85MX (N9) INIT
       <015762365>
   2 F86
     3 F86DX (N8) INIT
       <00161166>
     3 F86NX (N10) INIT
       <000639349>
     3 F86MX (N9) INIT
       <012783477>
   2 F87
     3 F87DX (N8) INIT
       <00126824>
     3 F87NX (N10) INIT
       <000478183>
     3 F87MX (N9) INIT
       <010189546>
   2 F88
     3 F88DX (N8) INIT
       <00098113>
     3 F88NX (N10) INIT
       <000351359>
     3 F88MX (N9) INIT
       <007979557>
   2 F89
     3 F89DX (N8) INIT
       <00074576>
     3 F89NX (N10) INIT
       <000253246>
     3 F89MX (N9) INIT
       <006137358>
   2 F90
     3 F90DX (N8) INIT
       <00055650>
     3 F90NX (N10) INIT
       <000158670>
     3 F90MX (N9) INIT
       <004633540>
   2 F91
     3 F91DX (N8) INIT
       <00040721>
     3 F91NX (N10) INIT
       <000123020>
     3 F91MX (N9) INIT
       <003430761>
   2 F92
     3 F92DX (N8) INIT
       <00029169>
     3 F92NX (N10) INIT
       <000082299>
     3 F92MX (N9) INIT
       <002487808>
   2 F93
     3 F93DX (N8) INIT
       <00020399>
     3 F93NX (N10) INIT
       <000053130>
     3 F93MX (N9) INIT
       <001762906>
   2 F94
     3 F94DX (N8) INIT
       <00013851>
     3 F94NX (N10) INIT
       <000032731>
     3 F94MX (N9) INIT
       <001214476>
   2 F95
     3 F95DX (N8) INIT
       <00009022>
     3 F95NX (N10) INIT
       <000018880>
     3 F95MX (N9) INIT
       <000803789>
   2 F96
     3 F96DX (N8) INIT
       <00005497>
     3 F96NX (N10) INIT
       <000009858>
     3 F96MX (N9) INIT
       <000498267>
   2 F97
     3 F97DX (N8) INIT
       <00002957>
     3 F97NX (N10) INIT
       <000004361>
     3 F97MX (N9) INIT
       <000272996>
   2 F98
     3 F98DX (N8) INIT
       <00001208>
     3 F98NX (N10) INIT
       <000001404>
     3 F98MX (N9) INIT
       <000113470>
   2 F99
     3 F99DX (N8) INIT
       <00000196>
     3 F99NX (N10) INIT
       <000000196>
     3 F99MX (N9) INIT
       <000018561>
   2 F100
     3 F100DX (N8) INIT
       <00000001>
     3 F100NX (N10) INIT
       <000000001>
     3 F100MX (N9) INIT
       <000000001>
 1 REDEFINE MORT-TABLE-H /* BEGIN REDEFINE: MORT-TABLE-
   2 MORT-TABLE-H-STRUCTURE (1:101)
     3 TH-DX (N7.1)
     3 TH-NX (N9.1)
     3 TH-MX (N6.3)
END-DEFINE
