DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
/*  ATHISMTK created by ACCORD on: 31/08/05 at: 12:27:21.0
/*  start of original copybook: ATHISMTK
 1 MORT-TABLE-K
/*  80 CSO @ 5.75% SMOKER
/*  DX NX MX
  2 F00
    3 F00DX (N8)
      INIT
      <99999999>
    3 F00NX (N10)
      INIT
      <1756164148>
    3 F00MX (N9)
      INIT
      <451116933>
  2 F01
    3 F01DX (N8)
      INIT
      <94313948>
    3 F01NX (N10)
      INIT
      <1656164148>
    3 F01MX (N9)
      INIT
      <426246957>
  2 F02
    3 F02DX (N8)
      INIT
      <89093904>
    3 F02NX (N10)
      INIT
      <1561850200>
    3 F02MX (N9)
      INIT
      <417060743>
  2 F03
    3 F03DX (N8)
      INIT
      <84166146>
    3 F03NX (N10)
      INIT
      <1472756296>
    3 F03MX (N9)
      INIT
      <408719862>
  2 F04
    3 F04DX (N8)
      INIT
      <79512534>
    3 F04NX (N10)
      INIT
      <1388590150>
    3 F04MX (N9)
      INIT
      <400999622>
  2 F05
    3 F05DX (N8)
      INIT
      <75119230>
    3 F05NX (N10)
      INIT
      <1309077616>
    3 F05MX (N9)
      INIT
      <394006905>
  2 F06
    3 F06DX (N8)
      INIT
      <70972219>
    3 F06NX (N10)
      INIT
      <1233958386>
    3 F06MX (N9)
      INIT
      <387755492>
  2 F07
    3 F07DX (N8)
      INIT
      <67057502>
    3 F07NX (N10)
      INIT
      <1162986167>
    3 F07MX (N9)
      INIT
      <382184765>
  2 F08
    3 F08DX (N8)
      INIT
      <63361887>
    3 F08NX (N10)
      INIT
      <1095928665>
    3 F08MX (N9)
      INIT
      <377238545>
  2 F09
    3 F09DX (N8)
      INIT
      <59871743>
    3 F09NX (N10)
      INIT
      <1032566778>
    3 F09MX (N9)
      INIT
      <372745070>
  2 F10
    3 F10DX (N8)
      INIT
      <56574409>
    3 F10NX (N10)
      INIT
      <0972695035>
    3 F10MX (N9)
      INIT
      <368555382>
  2 F11
    3 F11DX (N8)
      INIT
      <53458138>
    3 F11NX (N10)
      INIT
      <916120626>
    3 F11MX (N9)
      INIT
      <364543222>
  2 F12
    3 F12DX (N8)
      INIT
      <50510484>
    3 F12NX (N10)
      INIT
      <862662488>
    3 F12MX (N9)
      INIT
      <360448600>
  2 F13
    3 F13DX (N8)
      INIT
      <47720110>
    3 F13NX (N10)
      INIT
      <812152004>
    3 F13MX (N9)
      INIT
      <356054487>
  2 F14
    3 F14DX (N8)
      INIT
      <45077114>
    3 F14NX (N10)
      INIT
      <764431894>
    3 F14MX (N9)
      INIT
      <351225891>
  2 F15
    3 F15DX (N8)
      INIT
      <42566436>
    3 F15NX (N10)
      INIT
      <719354780>
    3 F15MX (N9)
      INIT
      <345258296>
  2 F16
    3 F16DX (N8)
      INIT
      <40181108>
    3 F16NX (N10)
      INIT
      <676788344>
    3 F16MX (N9)
      INIT
      <338174150>
  2 F17
    3 F17DX (N8)
      INIT
      <37921846>
    3 F17NX (N10)
      INIT
      <636607236>
    3 F17MX (N9)
      INIT
      <330726785>
  2 F18
    3 F18DX (N8)
      INIT
      <35784239>
    3 F18NX (N10)
      INIT
      <598685390>
    3 F18MX (N9)
      INIT
      <323160519>
  2 F19
    3 F19DX (N8)
      INIT
      <33763739>
    3 F19NX (N10)
      INIT
      <562901151>
    3 F19MX (N9)
      INIT
      <315682102>
  2 F20
    3 F20DX (N8)
      INIT
      <31854772>
    3 F20NX (N10)
      INIT
      <529137412>
    3 F20MX (N9)
      INIT
      <308370708>
  2 F21
    3 F21DX (N8)
      INIT
      <30052832>
    3 F21NX (N10)
      INIT
      <497282640>
    3 F21MX (N9)
      INIT
      <301382384>
  2 F22
    3 F22DX (N8)
      INIT
      <28352822>
    3 F22NX (N10)
      INIT
      <467229808>
    3 F22MX (N9)
      INIT
      <294789201>
  2 F23
    3 F23DX (N8)
      INIT
      <26750049>
    3 F23NX (N10)
      INIT
      <438876986>
    3 F23MX (N9)
      INIT
      <288676151>
  2 F24
    3 F24DX (N8)
      INIT
      <25238893>
    3 F24NX (N10)
      INIT
      <412126937>
    3 F24MX (N9)
      INIT
      <283009973>
  2 F25
    3 F25DX (N8)
      INIT
      <23814537>
    3 F25NX (N10)
      INIT
      <386888044>
    3 F25MX (N9)
      INIT
      <277807106>
  2 F26
    3 F26DX (N8)
      INIT
      <22472140>
    3 F26NX (N10)
      INIT
      <363073507>
    3 F26MX (N9)
      INIT
      <273055421>
  2 F27
    3 F27DX (N8)
      INIT
      <21206263>
    3 F27NX (N10)
      INIT
      <340601367>
    3 F27MX (N9)
      INIT
      <268656698>
  2 F28
    3 F28DX (N8)
      INIT
      <20012095>
    3 F28NX (N10)
      INIT
      <319395104>
    3 F28MX (N9)
      INIT
      <264545847>
  2 F29
    3 F29DX (N8)
      INIT
      <18885173>
    3 F29NX (N10)
      INIT
      <299383009>
    3 F29MX (N9)
      INIT
      <260666432>
  2 F30
    3 F30DX (N8)
      INIT
      <17821175>
    3 F30NX (N10)
      INIT
      <280497836>
    3 F30MX (N9)
      INIT
      <256951962>
  2 F31
    3 F31DX (N8)
      INIT
      <16816112>
    3 F31NX (N10)
      INIT
      <262676661>
    3 F31MX (N9)
      INIT
      <253345626>
  2 F32
    3 F32DX (N8)
      INIT
      <15866617>
    3 F32NX (N10)
      INIT
      <245860549>
    3 F32MX (N9)
      INIT
      <249831263>
  2 F33
    3 F33DX (N8)
      INIT
      <14969383>
    3 F33NX (N10)
      INIT
      <229993932>
    3 F33MX (N9)
      INIT
      <246380298>
  2 F34
    3 F34DX (N8)
      INIT
      <14121189>
    3 F34NX (N10)
      INIT
      <215024549>
    3 F34MX (N9)
      INIT
      <242954682>
  2 F35
    3 F35DX (N8)
      INIT
      <13319186>
    3 F35NX (N10)
      INIT
      <200903360>
    3 F35MX (N9)
      INIT
      <239536283>
  2 F36
    3 F36DX (N8)
      INIT
      <12560716>
    3 F36NX (N10)
      INIT
      <187584174>
    3 F36MX (N9)
      INIT
      <236110391>
  2 F37
    3 F37DX (N8)
      INIT
      <11842944>
    3 F37NX (N10)
      INIT
      <175023458>
    3 F37MX (N9)
      INIT
      <232630178>
  2 F38
    3 F38DX (N8)
      INIT
      <11163501>
    3 F38NX (N10)
      INIT
      <163180514>
    3 F38MX (N9)
      INIT
      <229080134>
  2 F39
    3 F39DX (N8)
      INIT
      <10520082>
    3 F39NX (N10)
      INIT
      <152017013>
    3 F39MX (N9)
      INIT
      <225438141>
  2 F40
    3 F40DX (N8)
      INIT
      <09910564>
    3 F40NX (N10)
      INIT
      <141496931>
    3 F40MX (N9)
      INIT
      <221687723>
  2 F41
    3 F41DX (N8)
      INIT
      <09332893>
    3 F41NX (N10)
      INIT
      <131586367>
    3 F41MX (N9)
      INIT
      <217807889>
  2 F42
    3 F42DX (N8)
      INIT
      <08785276>
    3 F42NX (N10)
      INIT
      <122253474>
    3 F42MX (N9)
      INIT
      <213792365>
  2 F43
    3 F43DX (N8)
      INIT
      <08266134>
    3 F43NX (N10)
      INIT
      <113468198>
    3 F43MX (N9)
      INIT
      <209646867>
  2 F44
    3 F44DX (N8)
      INIT
      <07773919>
    3 F44NX (N10)
      INIT
      <105202064>
    3 F44MX (N9)
      INIT
      <205371171>
  2 F45
    3 F45DX (N8)
      INIT
      <07307189>
    3 F45NX (N10)
      INIT
      <097428145>
    3 F45MX (N9)
      INIT
      <200967777>
  2 F46
    3 F46DX (N8)
      INIT
      <06864612>
    3 F46NX (N10)
      INIT
      <090120956>
    3 F46MX (N9)
      INIT
      <196441820>
  2 F47
    3 F47DX (N8)
      INIT
      <06445011>
    3 F47NX (N10)
      INIT
      <083256344>
    3 F47MX (N9)
      INIT
      <191807004>
  2 F48
    3 F48DX (N8)
      INIT
      <06047279>
    3 F48NX (N10)
      INIT
      <076811333>
    3 F48MX (N9)
      INIT
      <187077616>
  2 F49
    3 F49DX (N8)
      INIT
      <05670203>
    3 F49NX (N10)
      INIT
      <070764054>
    3 F49MX (N9)
      INIT
      <182251221>
  2 F50
    3 F50DX (N8)
      INIT
      <05312672>
    3 F50NX (N10)
      INIT
      <065093851>
    3 F50MX (N9)
      INIT
      <177329013>
  2 F51
    3 F51DX (N8)
      INIT
      <04973566>
    3 F51NX (N10)
      INIT
      <059781179>
    3 F51MX (N9)
      INIT
      <172305236>
  2 F52
    3 F52DX (N8)
      INIT
      <04651730>
    3 F52NX (N10)
      INIT
      <054807613>
    3 F52MX (N9)
      INIT
      <167164735>
  2 F53
    3 F53DX (N8)
      INIT
      <04346102>
    3 F53NX (N10)
      INIT
      <050155883>
    3 F53MX (N9)
      INIT
      <161894969>
  2 F54
    3 F54DX (N8)
      INIT
      <04055663>
    3 F54NX (N10)
      INIT
      <045809781>
    3 F54MX (N9)
      INIT
      <156482401>
  2 F55
    3 F55DX (N8)
      INIT
      <03779648>
    3 F55NX (N10)
      INIT
      <041754118>
    3 F55MX (N9)
      INIT
      <150932965>
  2 F56
    3 F56DX (N8)
      INIT
      <03517414>
    3 F56NX (N10)
      INIT
      <037974470>
    3 F56MX (N9)
      INIT
      <145260817>
  2 F57
    3 F57DX (N8)
      INIT
      <03268484>
    3 F57NX (N10)
      INIT
      <034457056>
    3 F57MX (N9)
      INIT
      <139493271>
  2 F58
    3 F58DX (N8)
      INIT
      <03032381>
    3 F58NX (N10)
      INIT
      <031188572>
    3 F58MX (N9)
      INIT
      <133654815>
  2 F59
    3 F59DX (N8)
      INIT
      <02808658>
    3 F59NX (N10)
      INIT
      <028156191>
    3 F59MX (N9)
      INIT
      <127770692>
  2 F60
    3 F60DX (N8)
      INIT
      <02596794>
    3 F60NX (N10)
      INIT
      <025347533>
    3 F60MX (N9)
      INIT
      <121855899>
  2 F61
    3 F61DX (N8)
      INIT
      <02396098>
    3 F61NX (N10)
      INIT
      <022750739>
    3 F61MX (N9)
      INIT
      <115905999>
  2 F62
    3 F62DX (N8)
      INIT
      <02205928>
    3 F62NX (N10)
      INIT
      <020354641>
    3 F62MX (N9)
      INIT
      <109917467>
  2 F63
    3 F63DX (N8)
      INIT
      <02025678>
    3 F63NX (N10)
      INIT
      <018148713>
    3 F63MX (N9)
      INIT
      <103886872>
  2 F64
    3 F64DX (N8)
      INIT
      <01854832>
    3 F64NX (N10)
      INIT
      <016123035>
    3 F64MX (N9)
      INIT
      <097816552>
  2 F65
    3 F65DX (N8)
      INIT
      <01693080>
    3 F65NX (N10)
      INIT
      <014268203>
    3 F65MX (N9)
      INIT
      <091726728>
  2 F66
    3 F66DX (N8)
      INIT
      <01540294>
    3 F66NX (N10)
      INIT
      <012575123>
    3 F66MX (N9)
      INIT
      <085654051>
  2 F67
    3 F67DX (N8)
      INIT
      <01396402>
    3 F67NX (N10)
      INIT
      <011034829>
    3 F67MX (N9)
      INIT
      <079639978>
  2 F68
    3 F68DX (N8)
      INIT
      <01261344>
    3 F68NX (N10)
      INIT
      <009638427>
    3 F68MX (N9)
      INIT
      <073726885>
  2 F69
    3 F69DX (N8)
      INIT
      <01134983>
    3 F69NX (N10)
      INIT
      <008377083>
    3 F69MX (N9)
      INIT
      <067949152>
  2 F70
    3 F70DX (N8)
      INIT
      <01017031>
    3 F70NX (N10)
      INIT
      <007242100>
    3 F70MX (N9)
      INIT
      <062325217>
  2 F71
    3 F71DX (N8)
      INIT
      <00907114>
    3 F71NX (N10)
      INIT
      <006225069>
    3 F71MX (N9)
      INIT
      <056863539>
  2 F72
    3 F72DX (N8)
      INIT
      <00804857>
    3 F72NX (N10)
      INIT
      <005317955>
    3 F72MX (N9)
      INIT
      <051570117>
  2 F73
    3 F73DX (N8)
      INIT
      <00709888>
    3 F73NX (N10)
      INIT
      <004513098>
    3 F73MX (N9)
      INIT
      <046449471>
  2 F74
    3 F74DX (N8)
      INIT
      <00621982>
    3 F74NX (N10)
      INIT
      <003803210>
    3 F74MX (N9)
      INIT
      <041518853>
  2 F75
    3 F75DX (N8)
      INIT
      <00540981>
    3 F75NX (N10)
      INIT
      <003181228>
    3 F75MX (N9)
      INIT
      <036800612>
  2 F76
    3 F76DX (N8)
      INIT
      <00466834>
    3 F76NX (N10)
      INIT
      <002640247>
    3 F76MX (N9)
      INIT
      <032327481>
  2 F77
    3 F77DX (N8)
      INIT
      <00399597>
    3 F77NX (N10)
      INIT
      <002173413>
    3 F77MX (N9)
      INIT
      <028142087>
  2 F78
    3 F78DX (N8)
      INIT
      <00339244>
    3 F78NX (N10)
      INIT
      <001773816>
    3 F78MX (N9)
      INIT
      <024279506>
  2 F79
    3 F79DX (N8)
      INIT
      <00285606>
    3 F79NX (N10)
      INIT
      <001434572>
    3 F79MX (N9)
      INIT
      <020760353>
  2 F80
    3 F80DX (N8)
      INIT
      <00238332>
    3 F80NX (N10)
      INIT
      <001148966>
    3 F80MX (N9)
      INIT
      <017585874>
  2 F81
    3 F81DX (N8)
      INIT
      <00196976>
    3 F81NX (N10)
      INIT
      <000910634>
    3 F81MX (N9)
      INIT
      <014746168>
  2 F82
    3 F82DX (N8)
      INIT
      <00161062>
    3 F82NX (N10)
      INIT
      <000713658>
    3 F82MX (N9)
      INIT
      <012225803>
  2 F83
    3 F83DX (N8)
      INIT
      <00130126>
    3 F83NX (N10)
      INIT
      <000552596>
    3 F83MX (N9)
      INIT
      <010007947>
  2 F84
    3 F84DX (N8)
      INIT
      <00103761>
    3 F84NX (N10)
      INIT
      <000422470>
    3 F84MX (N9)
      INIT
      <008079005>
  2 F85
    3 F85DX (N8)
      INIT
      <00081601>
    3 F85NX (N10)
      INIT
      <000318709>
    3 F85MX (N9)
      INIT
      <006427169>
  2 F86
    3 F86DX (N8)
      INIT
      <00063275>
    3 F86NX (N10)
      INIT
      <000237108>
    3 F86MX (N9)
      INIT
      <005038293>
  2 F87
    3 F87DX (N8)
      INIT
      <00048381>
    3 F87NX (N10)
      INIT
      <000173833>
    3 F87MX (N9)
      INIT
      <003892934>
  2 F88
    3 F88DX (N8)
      INIT
      <00036453>
    3 F88NX (N10)
      INIT
      <000125452>
    3 F88MX (N9)
      INIT
      <002963190>
  2 F89
    3 F89DX (N8)
      INIT
      <00027044>
    3 F89NX (N10)
      INIT
      <000088999>
    3 F89MX (N9)
      INIT
      <002220509>
  2 F90
    3 F90DX (N8)
      INIT
      <00019753>
    3 F90NX (N10)
      INIT
      <000061955>
    3 F90MX (N9)
      INIT
      <001638426>
  2 F91
    3 F91DX (N8)
      INIT
      <00014198>
    3 F91NX (N10)
      INIT
      <000042202>
    3 F91MX (N9)
      INIT
      <001190302>
  2 F92
    3 F92DX (N8)
      INIT
      <00010033>
    3 F92NX (N10)
      INIT
      <000028004>
    3 F92MX (N9)
      INIT
      <000850997>
  2 F93
    3 F93DX (N8)
      INIT
      <00006946>
    3 F93NX (N10)
      INIT
      <000017971>
    3 F93MX (N9)
      INIT
      <000596914>
  2 F94
    3 F94DX (N8)
      INIT
      <00004682>
    3 F94NX (N10)
      INIT
      <000011025>
    3 F94MX (N9)
      INIT
      <000408243>
  2 F95
    3 F95DX (N8)
      INIT
      <00003037>
    3 F95NX (N10)
      INIT
      <000006343>
    3 F95MX (N9)
      INIT
      <000269199>
  2 F96
    3 F96DX (N8)
      INIT
      <00001846>
    3 F96NX (N10)
      INIT
      <000003306>
    3 F96MX (N9)
      INIT
      <000166603>
  2 F97
    3 F97DX (N8)
      INIT
      <00000991>
    3 F97NX (N10)
      INIT
      <000001460>
    3 F97MX (N9)
      INIT
      <000091137>
  2 F98
    3 F98DX (N8)
      INIT
      <00000404>
    3 F98NX (N10)
      INIT
      <000000469>
    3 F98MX (N9)
      INIT
      <000037822>
  2 F99
    3 F99DX (N8)
      INIT
      <00000065>
    3 F99NX (N10)
      INIT
      <000000065>
    3 F99MX (N9)
      INIT
      <000006173>
  2 F100
    3 F100DX (N8)
      INIT
      <00000001>
    3 F100NX (N10)
      INIT
      <000000001>
    3 F100MX (N9)
      INIT
      <000000001>
  2 F101 (20)
    3 F101DX (N8)
      INIT
      <00000001>
    3 F101NX (N10)
      INIT
      <000000001>
    3 F101MX (N9)
      INIT
      <000000001>
 1 REDEFINE MORT-TABLE-K /* BEGIN REDEFINE: MORT-TABLE-
  2 MORT-TABLE-K-STRUCTURE (1:121)
    3 TK-DX (N7.1)
    3 TK-NX (N9.1)
    3 TK-MX (N6.3)
END-DEFINE
