DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
/*  ATHISMTF created by ACCORD on: 31/08/05 at: 12:27:19.1
/*  start of original copybook: ATHISMTF
 1 MORT-TABLE-F
/*  80 CSO @ 5%
/*  DX NX MX
   2 F00
     3 F00DX (N8) INIT
       <99999999>
     3 F00NX (N10) INIT
       <1986278834>
     3 F00MX (N9) INIT
       <541529356>
   2 F01
     3 F01DX (N8) INIT
       <94840000>
     3 F01NX (N10) INIT
       <1886278834>
     3 F01MX (N9) INIT
       <501719832>
   2 F02
     3 F02DX (N8) INIT
       <90227166>
     3 F02NX (N10) INIT
       <1791438834>
     3 F02MX (N9) INIT
       <492055433>
   2 F03
     3 F03DX (N8) INIT
       <85845563>
     3 F03NX (N10) INIT
       <1701211668>
     3 F03MX (N9) INIT
       <483548360>
   2 F04
     3 F04DX (N8) INIT
       <81677564>
     3 F04NX (N10) INIT
       <1615366105>
     3 F04MX (N9) INIT
       <475536883>
   2 F05
     3 F05DX (N8) INIT
       <77714262>
     3 F05NX (N10) INIT
       <1533688541>
     3 F05MX (N9) INIT
       <468147448>
   2 F06
     3 F06DX (N8) INIT
       <73946976>
     3 F06NX (N10) INIT
       <1455974279>
     3 F06MX (N9) INIT
       <461486729>
   2 F07
     3 F07DX (N8) INIT
       <70365831>
     3 F07NX (N10) INIT
       <1382027303>
     3 F07MX (N9) INIT
       <455500660>
   2 F08
     3 F08DX (N8) INIT
       <66961471>
     3 F08NX (N10) INIT
       <1311661472>
     3 F08MX (N9) INIT
       <450140092>
   2 F09
     3 F09DX (N8) INIT
       <83724368>
     3 F09NX (N10) INIT
       <1244700001>
     3 F09MX (N9) INIT
       <445293922>
   2 F10
     3 F10DX (N8) INIT
       <60644966>
     3 F10NX (N10) INIT
       <1180975633>
     3 F10MX (N9) INIT
       <440803147>
   2 F11
     3 F11DX (N8) INIT
       <57714950>
     3 F11NX (N10) INIT
       <1120330667>
     3 F11MX (N9) INIT
       <436587025>
   2 F12
     3 F12DX (N8) INIT
       <54924299>
     3 F12NX (N10) INIT
       <1062615717>
     3 F12MX (N9) INIT
       <432355061>
   2 F13
     3 F13DX (N8) INIT
       <52264394>
     3 F13NX (N10) INIT
       <1007691418>
     3 F13MX (N9) INIT
       <427908847>
   2 F14
     3 F14DX (N8) INIT
       <49726303>
     3 F14NX (N10) INIT
       <955425483>
     3 F14MX (N9) INIT
       <422985180>
   2 F15
     3 F15DX (N8) INIT
       <47303924>
     3 F15NX (N10) INIT
       <905699180>
     3 F15MX (N9) INIT
       <417539104>
   2 F16
     3 F16DX (N8) INIT
       <44991439>
     3 F16NX (N10) INIT
       <858395256>
     3 F16MX (N9) INIT
       <411547463>
   2 F17
     3 F17DX (N8) INIT
       <42784287>
     3 F17NX (N10) INIT
       <813403817>
     3 F17MX (N9) INIT
       <405077183>
   2 F18
     3 F18DX (N8) INIT
       <40678894>
     3 F18NX (N10) INIT
       <770619530>
     3 F18MX (N9) INIT
       <398272617>
   2 F19
     3 F19DX (N8) INIT
       <38672844>
     3 F19NX (N10) INIT
       <729940636>
     3 F19MX (N9) INIT
       <391376557>
   2 F20
     3 F20DX (N8) INIT
       <36762772>
     3 F20NX (N10) INIT
       <691267792>
     3 F20MX (N9) INIT
       <384525837>
   2 F21
     3 F21DX (N8) INIT
       <34945641>
     3 F21NX (N10) INIT
       <654505020>
     3 F21MX (N9) INIT
       <377873558>
   2 F22
     3 F22DX (N8) INIT
       <33217996>
     3 F22NX (N10) INIT
       <619559379>
     3 F22MX (N9) INIT
       <371516860>
   2 F23
     3 F23DX (N8) INIT
       <31576396>
     3 F23NX (N10) INIT
       <586341383>
     3 F23MX (N9) INIT
       <365537743>
   2 F24
     3 F24DX (N8) INIT
       <30016822>
     3 F24NX (N10) INIT
       <554764987>
     3 F24MX (N9) INIT
       <359944118>
   2 F25
     3 F25DX (N8) INIT
       <28535420>
     3 F25NX (N10) INIT
       <524748165>
     3 F25MX (N9) INIT
       <354741178>
   2 F26
     3 F26DX (N8) INIT
       <27128486>
     3 F26NX (N10) INIT
       <496212745>
     3 F26MX (N9) INIT
       <349930837>
   2 F27
     3 F27DX (N8) INIT
       <25791956>
     3 F27NX (N10) INIT
       <469084259>
     3 F27MX (N9) INIT
       <345460984>
   2 F28
     3 F28DX (N8) INIT
       <24521764>
     3 F28NX (N10) INIT
       <443292303>
     3 F28MX (N9) INIT
       <341260612>
   2 F29
     3 F29DX (N8) INIT
       <23314358>
     3 F29NX (N10) INIT
       <418770539>
     3 F29MX (N9) INIT
       <337290383>
   2 F30
     3 F30DX (N8) INIT
       <22166182>
     3 F30NX (N10) INIT
       <395456181>
     3 F30MX (N9) INIT
       <333493479>
   2 F31
     3 F31DX (N8) INIT
       <21074126>
     3 F31NX (N10) INIT
       <373289999>
     3 F31MX (N9) INIT
       <329841241>
   2 F32
     3 F32DX (N8) INIT
       <20034872>
     3 F32NX (N10) INIT
       <352215873>
     3 F32MX (N9) INIT
       <326268689>
   2 F33
     3 F33DX (N8) INIT
       <19045912>
     3 F33NX (N10) INIT
       <332181001>
     3 F33MX (N9) INIT
       <322776916>
   2 F34
     3 F34DX (N8) INIT
       <18104320>
     3 F34NX (N10) INIT
       <313135089>
     3 F34MX (N9) INIT
       <319312459>
   2 F35
     3 F35DX (N8) INIT
       <17207724>
     3 F35NX (N10) INIT
       <295030769>
     3 F35MX (N9) INIT
       <315863955>
   2 F36
     3 F36DX (N8) INIT
       <16353728>
     3 F36NX (N10) INIT
       <277823045>
     3 F36MX (N9) INIT
       <312405972>
   2 F37
     3 F37DX (N8) INIT
       <15540091>
     3 F37NX (N10) INIT
       <261469317>
     3 F37MX (N9) INIT
       <308917141>
   2 F38
     3 F38DX (N8) INIT
       <14764567>
     3 F38NX (N10) INIT
       <245929226>
     3 F38MX (N9) INIT
       <305365175>
   2 F39
     3 F39DX (N8) INIT
       <14025214>
     3 F39NX (N10) INIT
       <231164659>
     3 F39MX (N9) INIT
       <301737300>
   2 F40
     3 F40DX (N8) INIT
       <13320079>
     3 F40NX (N10) INIT
       <217139445>
     3 F40MX (N9) INIT
       <298010590>
   2 F41
     3 F41DX (N8) INIT
       <12647478>
     3 F41NX (N10) INIT
       <203819366>
     3 F41MX (N9) INIT
       <294179415>
   2 F42
     3 F42DX (N8) INIT
       <12005589>
     3 F42NX (N10) INIT
       <191171888>
     3 F42MX (N9) INIT
       <290216566>
   2 F43
     3 F43DX (N8) INIT
       <11393189>
     3 F43NX (N10) INIT
       <179166299>
     3 F43MX (N9) INIT
       <286146093>
   2 F44
     3 F44DX (N8) INIT
       <10808665>
     3 F44NX (N10) INIT
       <167773110>
     3 F44MX (N9) INIT
       <281946915>
   2 F45
     3 F45DX (N8) INIT
       <10250835>
     3 F45NX (N10) INIT
       <156964445>
     3 F45MX (N9) INIT
       <277633730>
   2 F46
     3 F46DX (N8) INIT
       <09718280>
     3 F46NX (N10) INIT
       <146713610>
     3 F46MX (N9) INIT
       <273191727>
   2 F47
     3 F47DX (N8) INIT
       <09209967>
     3 F47NX (N10) INIT
       <136995330>
     3 F47MX (N9) INIT
       <268638009>
   2 F48
     3 F48DX (N8) INIT
       <08724734>
     3 F48NX (N10) INIT
       <127785363>
     3 F48MX (N9) INIT
       <263971656>
   2 F49
     3 F49DX (N8) INIT
       <08261574>
     3 F49NX (N10) INIT
       <119060629>
     3 F49MX (N9) INIT
       <259202092>
   2 F50
     3 F50DX (N8) INIT
       <07819306>
     3 F50NX (N10) INIT
       <110799055>
     3 F50MX (N9) INIT
       <254315980>
   2 F51
     3 F51DX (N8) INIT
       <07396988>
     3 F51NX (N10) INIT
       <102979749>
     3 F51MX (N9) INIT
       <249319040>
   2 F52
     3 F52DX (N8) INIT
       <06993324>
     3 F52NX (N10) INIT
       <095582761>
     3 F52MX (N9) INIT
       <244176354>
   2 F53
     3 F53DX (N8) INIT
       <06607292>
     3 F53NX (N10) INIT
       <088589437>
     3 F53MX (N9) INIT
       <238874714>
   2 F54
     3 F54DX (N8) INIT
       <06237849>
     3 F54NX (N10) INIT
       <081982149>
     3 F54MX (N9) INIT
       <233393785>
   2 F55
     3 F55DX (N8) INIT
       <05884015>
     3 F55NX (N10) INIT
       <075744296>
     3 F55MX (N9) INIT
       <227714358>
   2 F56
     3 F56DX (N8) INIT
       <05545151>
     3 F56NX (N10) INIT
       <069860281>
     3 F56MX (N9) INIT
       <221847138>
   2 F57
     3 F57DX (N8) INIT
       <05220575>
     3 F57NX (N10) INIT
       <064315130>
     3 F57MX (N9) INIT
       <215794999>
   2 F58
     3 F58DX (N8) INIT
       <04909876>
     3 F58NX (N10) INIT
       <059094555>
     3 F58MX (N9) INIT
       <209585022>
   2 F59
     3 F59DX (N8) INIT
       <04612525>
     3 F59NX (N10) INIT
       <054184679>
     3 F59MX (N9) INIT
       <203230221>
   2 F60
     3 F60DX (N8) INIT
       <04327998>
     3 F60NX (N10) INIT
       <049572154>
     3 F60MX (N9) INIT
       <196741930>
   2 F61
     3 F61DX (N8) INIT
       <04055623>
     3 F61NX (N10) INIT
       <045244156>
     3 F61MX (N9) INIT
       <190113927>
   2 F62
     3 F62DX (N8) INIT
       <03794750>
     3 F62NX (N10) INIT
       <041188533>
     3 F62MX (N9) INIT
       <183339122>
   2 F63
     3 F63DX (N8) INIT
       <03544694>
     3 F63NX (N10) INIT
       <037393783>
     3 F63MX (N9) INIT
       <176403748>
   2 F64
     3 F64DX (N8) INIT
       <03304803>
     3 F64NX (N10) INIT
       <033849089>
     3 F64MX (N9) INIT
       <169294108>
   2 F65
     3 F65DX (N8) INIT
       <03074599>
     3 F65NX (N10) INIT
       <030544286>
     3 F65MX (N9) INIT
       <162010941>
   2 F66
     3 F66DX (N8) INIT
       <02853755>
     3 F66NX (N10) INIT
       <027469687>
     3 F66MX (N9) INIT
       <154567478>
   2 F67
     3 F67DX (N8) INIT
       <02642170>
     3 F67NX (N10) INIT
       <024615932>
     3 F67MX (N9) INIT
       <146998239>
   2 F68
     3 F68DX (N8) INIT
       <02439754>
     3 F68NX (N10) INIT
       <021973762>
     3 F68MX (N9) INIT
       <139338460>
   2 F69
     3 F69DX (N8) INIT
       <02246456>
     3 F69NX (N10) INIT
       <019534008>
     3 F69MX (N9) INIT
       <131626523>
   2 F70
     3 F70DX (N8) INIT
       <02062097>
     3 F70NX (N10) INIT
       <017287552>
     3 F70MX (N9) INIT
       <123888019>
   2 F71
     3 F71DX (N8) INIT
       <01886308>
     3 F71NX (N10) INIT
       <015225455>
     3 F71MX (N9) INIT
       <116128630>
   2 F72
     3 F72DX (N8) INIT
       <01718696>
     3 F72NX (N10) INIT
       <013339147>
     3 F72MX (N9) INIT
       <108349857>
   2 F73
     3 F73DX (N8) INIT
       <01558857>
     3 F73NX (N10) INIT
       <011620451>
     3 F73MX (N9) INIT
       <100550245>
   2 F74
     3 F74DX (N8) INIT
       <01406475>
     3 F74NX (N10) INIT
       <010061594>
     3 F74MX (N9) INIT
       <092735167>
   2 F75
     3 F75DX (N8) INIT
       <01261555>
     3 F75NX (N10) INIT
       <008655119>
     3 F75MX (N9) INIT
       <084940626>
   2 F76
     3 F76DX (N8) INIT
       <01124358>
     3 F76NX (N10) INIT
       <007393564>
     3 F76MX (N9) INIT
       <077228321>
   2 F77
     3 F77DX (N8) INIT
       <00995292>
     3 F77NX (N10) INIT
       <006269206>
     3 F77MX (N9) INIT
       <069675856>
   2 F78
     3 F78DX (N8) INIT
       <00874796>
     3 F78NX (N10) INIT
       <005273914>
     3 F78MX (N9) INIT
       <062365665>
   2 F79
     3 F79DX (N8) INIT
       <00763238>
     3 F79NX (N10) INIT
       <004399118>
     3 F79MX (N9) INIT
       <055375637>
   2 F80
     3 F80DX (N8) INIT
       <00660710>
     3 F80NX (N10) INIT
       <003635880>
     3 F80MX (N9) INIT
       <048757265>
   2 F81
     3 F81DX (N8) INIT
       <00567053>
     3 F81NX (N10) INIT
       <002975170>
     3 F81MX (N9) INIT
       <042537779>
   2 F82
     3 F82DX (N8) INIT
       <00482005>
     3 F82NX (N10) INIT
       <002408117>
     3 F82MX (N9) INIT
       <036733326>
   2 F83
     3 F83DX (N8) INIT
       <00405229>
     3 F83NX (N10) INIT
       <001926112>
     3 F83MX (N9) INIT
       <031350934>
   2 F84
     3 F84DX (N8) INIT
       <00336433>
     3 F84NX (N10) INIT
       <001520883>
     3 F84MX (N9) INIT
       <026400968>
   2 F85
     3 F85DX (N8) INIT
       <00275474>
     3 F85NX (N10) INIT
       <001184450>
     3 F85MX (N9) INIT
       <021907190>
   2 F86
     3 F86DX (N8) INIT
       <00222229>
     3 F86NX (N10) INIT
       <000908976>
     3 F86MX (N9) INIT
       <017894442>
   2 F87
     3 F87DX (N8) INIT
       <00176494>
     3 F87NX (N10) INIT
       <000686747>
     3 F87MX (N9) INIT
       <014379195>
   2 F88
     3 F88DX (N8) INIT
       <00137909>
     3 F88NX (N10) INIT
       <000510253>
     3 F88MX (N9) INIT
       <011361148>
   2 F89
     3 F89DX (N8) INIT
       <00105958>
     3 F89NX (N10) INIT
       <000372344>
     3 F89MX (N9) INIT
       <008822703>
   2 F90
     3 F90DX (N8) INIT
       <00079994>
     3 F90NX (N10) INIT
       <000266386>
     3 F90MX (N9) INIT
       <006730901>
   2 F91
     3 F91DX (N8) INIT
       <00059289>
     3 F91NX (N10) INIT
       <000186392>
     3 F91MX (N9) INIT
       <005041350>
   2 F92
     3 F92DX (N8) INIT
       <00043085>
     3 F92NX (N10) INIT
       <000127103>
     3 F92MX (N9) INIT
       <003703215>
   2 F93
     3 F93DX (N8) INIT
       <00030633>
     3 F93NX (N10) INIT
       <000084018>
     3 F93MX (N9) INIT
       <002663233>
   2 F94
     3 F94DX (N8) INIT
       <00021236>
     3 F94NX (N10) INIT
       <000053385>
     3 F94MX (N9) INIT
       <001869364>
   2 F95
     3 F95DX (N8) INIT
       <00014240>
     3 F95NX (N10) INIT
       <000032149>
     3 F95MX (N9) INIT
       <001270915>
   2 F96
     3 F96DX (N8) INIT
       <00009087>
     3 F96NX (N10) INIT
       <000017909>
     3 F96MX (N9) INIT
       <000823428>
   2 F97
     3 F97DX (N8) INIT
       <00005326>
     3 F97NX (N10) INIT
       <000008822>
     3 F97MX (N9) INIT
       <000490625>
   2 F98
     3 F98DX (N8) INIT
       <00002637>
     3 F98NX (N10) INIT
       <000003496>
     3 F98MX (N9) INIT
       <000247029>
   2 F99
     3 F99DX (N8) INIT
       <00000859>
     3 F99NX (N10) INIT
       <000000859>
     3 F99MX (N9) INIT
       <000081801>
   2 F100
     3 F100DX (N8) INIT
       <00000001>
     3 F100NX (N10) INIT
       <000000001>
     3 F100MX (N9) INIT
       <000000100>
 1 REDEFINE MORT-TABLE-F /* BEGIN REDEFINE: MORT-TABLE-
   2 MORT-TABLE-ELEMENTS (1:101)
     3 TF-DX (N7.1)
     3 TF-NX (N9.1)
     3 TF-MX (N6.3)
END-DEFINE
