DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
/* ATHISMTB created by ACCORD on: 02/09/05 at: 08:50:21.5
/* start of original copybook: ATHISMTB
 1 MORT-TABLE-B
/* X18 @ 2.857%
/* DX NX MX
   2 F15
     3 F15DX (N8)
       INIT
       <64643372>
     3 F15NX (N10)
       INIT
       <1834690901>
     3 F15MX (N10)
       INIT
       <1368221271>
   2 F16
     3 F16DX (N8)
       INIT
       <62813242>
     3 F16NX (N10)
       INIT
       <1770047529>
     3 F16MX (N10)
       INIT
       <1364764600>
   2 F17
     3 F17DX (N8)
       INIT
       <61031266>
     3 F17NX (N10)
       INIT
       <1707234287>
     3 F17MX (N10)
       INIT
       <1361039691>
   2 F18
     3 F18DX (N8)
       INIT
       <59292680>
     3 F18NX (N10)
       INIT
       <1646203021>
     3 F18MX (N10)
       INIT
       <1357064112>
   2 F19
     3 F19DX (N8)
       INIT
       <57606005>
     3 F19NX (N10)
       INIT
       <1586906741>
     3 F19MX (N10)
       INIT
       <1352740482>
   2 F20
     3 F20DX (N8)
       INIT
       <55960550>
     3 F20NX (N10)
       INIT
       <1529300736>
     3 F20MX (N10)
       INIT
       <1348203921>
   2 F21
     3 F21DX (N8)
       INIT
       <54359918>
     3 F21NX (N10)
       INIT
       <1473340186>
     3 F21MX (N10)
       INIT
       <1343579179>
   2 F22
     3 F22DX (N8)
       INIT
       <52804014>
     3 F22NX (N10)
       INIT
       <1418980268>
     3 F22MX (N10)
       INIT
       <1338981197>
   2 F23
     3 F23DX (N8)
       INIT
       <51291616>
     3 F23NX (N10)
       INIT
       <1366176254>
     3 F23MX (N10)
       INIT
       <1334412056>
   2 F24
     3 F24DX (N8)
       INIT
       <49822039>
     3 F24NX (N10)
       INIT
       <1314884638>
     3 F24MX (N10)
       INIT
       <1329924054>
   2 F25
     3 F25DX (N8)
       INIT
       <48393597>
     3 F25NX (N10)
       INIT
       <1265062599>
     3 F25MX (N10)
       INIT
       <1325467750>
   2 F26
     3 F26DX (N8)
       INIT
       <47005638>
     3 F26NX (N10)
       INIT
       <1216669002>
     3 F26MX (N10)
       INIT
       <1321091958>
   2 F27
     3 F27DX (N8)
       INIT
       <45656573>
     3 F27NX (N10)
       INIT
       <1169663364>
     3 F27MX (N10)
       INIT
       <1316750307>
   2 F28
     3 F28DX (N8)
       INIT
       <44344896>
     3 F28NX (N10)
       INIT
       <1124006791>
     3 F28MX (N10)
       INIT
       <1312400198>
   2 F29
     3 F29DX (N8)
       INIT
       <43070038>
     3 F29NX (N10)
       INIT
       <1079661895>
     3 F29MX (N10)
       INIT
       <1308088746>
   2 F30
     3 F30DX (N8)
       INIT
       <41830157>
     3 F30NX (N10)
       INIT
       <1036591857>
     3 F30MX (N10)
       INIT
       <1303733833>
   2 F31
     3 F31DX (N8)
       INIT
       <40624342>
     3 F31NX (N10)
       INIT
       <0994761700>
     3 F31MX (N10)
       INIT
       <1299341617>
   2 F32
     3 F32DX (N8)
       INIT
       <39451313>
     3 F32NX (N10)
       INIT
       <0954137358>
     3 F32MX (N10)
       INIT
       <1294878555>
   2 F33
     3 F33DX (N8)
       INIT
       <38310238>
     3 F33NX (N10)
       INIT
       <0914686045>
     3 F33MX (N10)
       INIT
       <1290352761>
   2 F34
     3 F34DX (N8)
       INIT
       <37199932>
     3 F34NX (N10)
       INIT
       <0876375807>
     3 F34MX (N10)
       INIT
       <1285734323>
   2 F35
     3 F35DX (N8)
       INIT
       <36118910>
     3 F35NX (N10)
       INIT
       <0839175875>
     3 F35MX (N10)
       INIT
       <1280960247>
   2 F36
     3 F36DX (N8)
       INIT
       <35066144>
     3 F36NX (N10)
       INIT
       <0803056965>
     3 F36MX (N10)
       INIT
       <1276009007>
   2 F37
     3 F37DX (N8)
       INIT
       <34039971>
     3 F37NX (N10)
       INIT
       <0767990821>
     3 F37MX (N10)
       INIT
       <1270792918>
   2 F38
     3 F38DX (N8)
       INIT
       <33038864>
     3 F38NX (N10)
       INIT
       <0733950850>
     3 F38MX (N10)
       INIT
       <1265233142>
   2 F39
     3 F39DX (N8)
       INIT
       <32061095>
     3 F39NX (N10)
       INIT
       <0700911986>
     3 F39MX (N10)
       INIT
       <1259226462>
   2 F40
     3 F40DX (N8)
       INIT
       <31105096>
     3 F40NX (N10)
       INIT
       <0668850891>
     3 F40MX (N10)
       INIT
       <1252680790>
   2 F41
     3 F41DX (N8)
       INIT
       <30169737>
     3 F41NX (N10)
       INIT
       <0637745795>
     3 F41MX (N10)
       INIT
       <1245543743>
   2 F42
     3 F42DX (N8)
       INIT
       <29254294>
     3 F42NX (N10)
       INIT
       <0607576058>
     3 F42MX (N10)
       INIT
       <1237800230>
   2 F43
     3 F43DX (N8)
       INIT
       <28357812>
     3 F43NX (N10)
       INIT
       <0578321764>
     3 F43MX (N10)
       INIT
       <1229409932>
   2 F44
     3 F44DX (N8)
       INIT
       <27479704>
     3 F44NX (N10)
       INIT
       <0549963952>
     3 F44MX (N10)
       INIT
       <1220366979>
   2 F45
     3 F45DX (N8)
       INIT
       <26619434>
     3 F45NX (N10)
       INIT
       <0522484248>
     3 F45MX (N10)
       INIT
       <1210668781>
   2 F46
     3 F46DX (N8)
       INIT
       <25776004>
     3 F46NX (N10)
       INIT
       <0495864814>
     3 F46MX (N10)
       INIT
       <1200265117>
   2 F47
     3 F47DX (N8)
       INIT
       <24948523>
     3 F47NX (N10)
       INIT
       <0470088810>
     3 F47MX (N10)
       INIT
       <1189113524>
   2 F48
     3 F48DX (N8)
       INIT
       <24136204>
     3 F48NX (N10)
       INIT
       <0445140287>
     3 F48MX (N10)
       INIT
       <1177179763>
   2 F49
     3 F49DX (N8)
       INIT
       <23337664>
     3 F49NX (N10)
       INIT
       <0421004083>
     3 F49MX (N10)
       INIT
       <1164367504>
   2 F50
     3 F50DX (N8)
       INIT
       <22551929>
     3 F50NX (N10)
       INIT
       <0397666419>
     3 F50MX (N10)
       INIT
       <1150617634>
   2 F51
     3 F51DX (N8)
       INIT
       <21778178>
     3 F51NX (N10)
       INIT
       <0375114490>
     3 F51MX (N10)
       INIT
       <1135883723>
   2 F52
     3 F52DX (N8)
       INIT
       <21015518>
     3 F52NX (N10)
       INIT
       <0353336312>
     3 F52MX (N10)
       INIT
       <1120109707>
   2 F53
     3 F53DX (N8)
       INIT
       <20264037>
     3 F53NX (N10)
       INIT
       <0332320794>
     3 F53MX (N10)
       INIT
       <1103335298>
   2 F54
     3 F54DX (N8)
       INIT
       <19523471>
     3 F54NX (N10)
       INIT
       <0312056757>
     3 F54MX (N10)
       INIT
       <1085564888>
   2 F55
     3 F55DX (N8)
       INIT
       <18792885>
     3 F55NX (N10)
       INIT
       <0292533286>
     3 F55MX (N10)
       INIT
       <1066735491>
   2 F56
     3 F56DX (N8)
       INIT
       <18071550>
     3 F56NX (N10)
       INIT
       <0273740401>
     3 F56MX (N10)
       INIT
       <1046801947>
   2 F57
     3 F57DX (N8)
       INIT
       <17358576>
     3 F57NX (N10)
       INIT
       <0255668851>
     3 F57MX (N10)
       INIT
       <1025700796>
   2 F58
     3 F58DX (N8)
       INIT
       <16653309>
     3 F58NX (N10)
       INIT
       <0238310275>
     3 F58MX (N10)
       INIT
       <1003390099>
   2 F59
     3 F59DX (N8)
       INIT
       <15955165>
     3 F59NX (N10)
       INIT
       <0221656966>
     3 F59MX (N10)
       INIT
       <0979832643>
   2 F60
     3 F60DX (N8)
       INIT
       <15263950>
     3 F60NX (N10)
       INIT
       <0205701801>
     3 F60MX (N10)
       INIT
       <0955028930>
   2 F61
     3 F61DX (N8)
       INIT
       <14579234>
     3 F61NX (N10)
       INIT
       <0190437851>
     3 F61MX (N10)
       INIT
       <0928955164>
   2 F62
     3 F62DX (N8)
       INIT
       <13900995>
     3 F62NX (N10)
       INIT
       <0175858617>
     3 F62MX (N10)
       INIT
       <0901627098>
   2 F63
     3 F63DX (N8)
       INIT
       <13229440>
     3 F63NX (N10)
       INIT
       <0161957622>
     3 F63MX (N10)
       INIT
       <0873083669>
   2 F64
     3 F64DX (N8)
       INIT
       <12564862>
     3 F64NX (N10)
       INIT
       <0148728182>
     3 F64MX (N10)
       INIT
       <0843372434>
   2 F65
     3 F65DX (N8)
       INIT
       <11907404>
     3 F65NX (N10)
       INIT
       <0136163320>
     3 F65MX (N10)
       INIT
       <0812527408>
   2 F66
     3 F66DX (N8)
       INIT
       <11257028>
     3 F66NX (N10)
       INIT
       <0124255916>
     3 F66MX (N10)
       INIT
       <0780564232>
   2 F67
     3 F67DX (N8)
       INIT
       <10613720>
     3 F67NX (N10)
       INIT
       <0112998888>
     3 F67MX (N10)
       INIT
       <0747501418>
   2 F68
     3 F68DX (N8)
       INIT
       <09977558>
     3 F68NX (N10)
       INIT
       <0102385168>
     3 F68MX (N10)
       INIT
       <0713366397>
   2 F69
     3 F69DX (N8)
       INIT
       <09348874>
     3 F69NX (N10)
       INIT
       <0092407610>
     3 F69MX (N10)
       INIT
       <0678212028>
   2 F70
     3 F70DX (N8)
       INIT
       <08728718>
     3 F70NX (N10)
       INIT
       <0083058736>
     3 F70MX (N10)
       INIT
       <0642164286>
   2 F71
     3 F71DX (N8)
       INIT
       <08118810>
     3 F71NX (N10)
       INIT
       <0074330018>
     3 F71MX (N10)
       INIT
       <0605418745>
   2 F72
     3 F72DX (N8)
       INIT
       <07521603>
     3 F72NX (N10)
       INIT
       <0066211208>
     3 F72MX (N10)
       INIT
       <0568249208>
   2 F73
     3 F73DX (N8)
       INIT
       <06939733>
     3 F73NX (N10)
       INIT
       <0058689605>
     3 F73MX (N10)
       INIT
       <0530954585>
   2 F74
     3 F74DX (N8)
       INIT
       <06375821>
     3 F74NX (N10)
       INIT
       <0051749872>
     3 F74MX (N10)
       INIT
       <0493839502>
   2 F75
     3 F75DX (N8)
       INIT
       <05831573>
     3 F75NX (N10)
       INIT
       <0045374051>
     3 F75MX (N10)
       INIT
       <0457124437>
   2 F76
     3 F76DX (N8)
       INIT
       <05307873>
     3 F76NX (N10)
       INIT
       <0039542478>
     3 F76MX (N10)
       INIT
       <0420952398>
   2 F77
     3 F77DX (N8)
       INIT
       <04805143>
     3 F77NX (N10)
       INIT
       <0034234605>
     3 F77MX (N10)
       INIT
       <0385422802>
   2 F78
     3 F78DX (N8)
       INIT
       <04323541>
     3 F78NX (N10)
       INIT
       <0029429462>
     3 F78MX (N10)
       INIT
       <0350609535>
   2 F79
     3 F79DX (N8)
       INIT
       <03863306>
     3 F79NX (N10)
       INIT
       <0025105921>
     3 F79MX (N10)
       INIT
       <0316595275>
   2 F80
     3 F80DX (N8)
       INIT
       <03425507>
     3 F80NX (N10)
       INIT
       <0021242615>
     3 F80MX (N10)
       INIT
       <0283546290>
   2 F81
     3 F81DX (N8)
       INIT
       <03011843>
     3 F81NX (N10)
       INIT
       <0017817108>
     3 F81MX (N10)
       INIT
       <0251694756>
   2 F82
     3 F82DX (N8)
       INIT
       <02624298>
     3 F82NX (N10)
       INIT
       <0014805265>
     3 F82MX (N10)
       INIT
       <0221306102>
   2 F83
     3 F83DX (N8)
       INIT
       <02264831>
     3 F83NX (N10)
       INIT
       <0012180967>
     3 F83MX (N10)
       INIT
       <0192648691>
   2 F84
     3 F84DX (N8)
       INIT
       <01935049>
     3 F84NX (N10)
       INIT
       <0009916136>
     3 F84MX (N10)
       INIT
       <0165961414>
   2 F85
     3 F85DX (N8)
       INIT
       <01635885>
     3 F85NX (N10)
       INIT
       <0007981087>
     3 F85MX (N10)
       INIT
       <0141419851>
   2 F86
     3 F86DX (N8)
       INIT
       <01367592>
     3 F86NX (N10)
       INIT
       <0006345202>
     3 F86MX (N10)
       INIT
       <0119134531>
   2 F87
     3 F87DX (N8)
       INIT
       <01129805>
     3 F87NX (N10)
       INIT
       <0004977610>
     3 F87MX (N10)
       INIT
       <0099154517>
   2 F88
     3 F88DX (N8)
       INIT
       <00921600>
     3 F88NX (N10)
       INIT
       <0003847805>
     3 F88MX (N10)
       INIT
       <0081472136>
   2 F89
     3 F89DX (N8)
       INIT
       <00741539>
     3 F89NX (N10)
       INIT
       <0002926205>
     3 F89MX (N10)
       INIT
       <0066025942>
   2 F90
     3 F90DX (N8)
       INIT
       <00587748>
     3 F90NX (N10)
       INIT
       <0002184666>
     3 F90MX (N10)
       INIT
       <0052706538>
   2 F91
     3 F91DX (N8)
       INIT
       <00458063>
     3 F91NX (N10)
       INIT
       <0001596918>
     3 F91MX (N10)
       INIT
       <0041370637>
   2 F92
     3 F92DX (N8)
       INIT
       <00350166>
     3 F92NX (N10)
       INIT
       <0001138855>
     3 F92MX (N10)
       INIT
       <0031853312>
   2 F93
     3 F93DX (N8)
       INIT
       <00261716>
     3 F93NX (N10)
       INIT
       <0000788689>
     3 F93MX (N10)
       INIT
       <0023980943>
   2 F94
     3 F94DX (N8)
       INIT
       <00190461>
     3 F94NX (N10)
       INIT
       <0000526973>
     3 F94MX (N10)
       INIT
       <0017582338>
   2 F95
     3 F95DX (N8)
       INIT
       <00134267>
     3 F95NX (N10)
       INIT
       <0000336512>
     3 F95MX (N10)
       INIT
       <0012492012>
   2 F96
     3 F96DX (N8)
       INIT
       <00090981>
     3 F96NX (N10)
       INIT
       <0000202245>
     3 F96MX (N10)
       INIT
       <0008536357>
   2 F97
     3 F97DX (N8)
       INIT
       <00058083>
     3 F97NX (N10)
       INIT
       <0000111264>
     3 F97MX (N10)
       INIT
       <0005499211>
   2 F98
     3 F98DX (N8)
       INIT
       <00033329>
     3 F98NX (N10)
       INIT
       <0000053181>
     3 F98MX (N10)
       INIT
       <0003185157>
   2 F99
     3 F99DX (N8)
       INIT
       <00015469>
     3 F99NX (N10)
       INIT
       <0000019852>
     3 F99MX (N10)
       INIT
       <0001491735>
   2 F00
     3 F00DX (N8)
       INIT
       <00004383>
     3 F00NX (N10)
       INIT
       <0000004383>
     3 F00MX (N10)
       INIT
       <0000426132>
 1 REDEFINE MORT-TABLE-B /* BEGIN REDEFINE: MORT-TABLE-
   2 MORT-TABLE-B-ARRAY (1:86)
     3 TB-DX (N7.1)
     3 TB-NX (N9.1)
     3 TB-MX (N7.3)
END-DEFINE
