DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
/*  ATHISMTJ created by ACCORD on: 31/08/05 at: 12:27:20.6
/*  start of original copybook: ATHISMTJ
 1 MORT-TABLE-J
/*  80 CSO @ 5.75% NON-SMOKER
/*  DX NX MX
   2 F00
     3 F00DX (N8)
       INIT
       <99999999>
     3 F00NX (N10)
       INIT
       <1771961879>
     3 F00MX (N9)
       INIT
       <365219102>
   2 F01
     3 F01DX (N8)
       INIT
       <94313948>
     3 F01NX (N10)
       INIT
       <1671961879>
     3 F01MX (N9)
       INIT
       <340349126>
   2 F02
     3 F02DX (N8)
       INIT
       <89093904>
     3 F02NX (N10)
       INIT
       <1577647931>
     3 F02MX (N9)
       INIT
       <331162912>
   2 F03
     3 F03DX (N8)
       INIT
       <84166146>
     3 F03NX (N10)
       INIT
       <1488554027>
     3 F03MX (N9)
       INIT
       <322822031>
   2 F04
     3 F04DX (N8)
       INIT
       <79512534>
     3 F04NX (N10)
       INIT
       <1404387881>
     3 F04MX (N9)
       INIT
       <315101791>
   2 F05
     3 F05DX (N8)
       INIT
       <75119230>
     3 F05NX (N10)
       INIT
       <1324875347>
     3 F05MX (N9)
       INIT
       <308109074>
   2 F06
     3 F06DX (N8)
       INIT
       <70972219>
     3 F06NX (N10)
       INIT
       <1249756117>
     3 F06MX (N9)
       INIT
       <301857661>
   2 F07
     3 F07DX (N8)
       INIT
       <67057502>
     3 F07NX (N10)
       INIT
       <1178783898>
     3 F07MX (N9)
       INIT
       <296286934>
   2 F08
     3 F08DX (N8)
       INIT
       <63361887>
     3 F08NX (N10)
       INIT
       <1111726396>
     3 F08MX (N9)
       INIT
       <291340714>
   2 F09
     3 F09DX (N8)
       INIT
       <59871743>
     3 F09NX (N10)
       INIT
       <1048364509>
     3 F09MX (N9)
       INIT
       <286847239>
   2 F10
     3 F10DX (N8)
       INIT
       <56574409>
     3 F10NX (N10)
       INIT
       <988492766>
     3 F10MX (N9)
       INIT
       <282657551>
   2 F11
     3 F11DX (N8)
       INIT
       <53458138>
     3 F11NX (N10)
       INIT
       <931918357>
     3 F11MX (N9)
       INIT
       <278645391>
   2 F12
     3 F12DX (N8)
       INIT
       <50510484>
     3 F12NX (N10)
       INIT
       <878460219>
     3 F12MX (N9)
       INIT
       <274550769>
   2 F13
     3 F13DX (N8)
       INIT
       <47720110>
     3 F13NX (N10)
       INIT
       <827949735>
     3 F13MX (N9)
       INIT
       <270156656>
   2 F14
     3 F14DX (N8)
       INIT
       <45077114>
     3 F14NX (N10)
       INIT
       <780229625>
     3 F14MX (N9)
       INIT
       <265328060>
   2 F15
     3 F15DX (N8)
       INIT
       <42574110>
     3 F15NX (N10)
       INIT
       <735152511>
     3 F15MX (N9)
       INIT
       <260127814>
   2 F16
     3 F16DX (N8)
       INIT
       <40204454>
     3 F16NX (N10)
       INIT
       <692578401>
     3 F16MX (N9)
       INIT
       <254652717>
   2 F17
     3 F17DX (N8)
       INIT
       <37961748>
     3 F17NX (N10)
       INIT
       <652373947>
     3 F17MX (N9)
       INIT
       <248987849>
   2 F18
     3 F18DX (N8)
       INIT
       <35841276>
     3 F18NX (N10)
       INIT
       <614412199>
     3 F18MX (N9)
       INIT
       <243352081>
   2 F19
     3 F19DX (N8)
       INIT
       <33837213>
     3 F19NX (N10)
       INIT
       <578570923>
     3 F19MX (N9)
       INIT
       <237827441>
   2 F20
     3 F20DX (N8)
       INIT
       <31943929>
     3 F20NX (N10)
       INIT
       <544733710>
     3 F20MX (N9)
       INIT
       <232483833>
   2 F21
     3 F21DX (N8)
       INIT
       <30156279>
     3 F21NX (N10)
       INIT
       <512789781>
     3 F21MX (N9)
       INIT
       <227409235>
   2 F22
     3 F22DX (N8)
       INIT
       <28469238>
     3 F22NX (N10)
       INIT
       <482633502>
     3 F22MX (N9)
       INIT
       <222675405>
   2 F23
     3 F23DX (N8)
       INIT
       <26877382>
     3 F23NX (N10)
       INIT
       <454164264>
     3 F23MX (N9)
       INIT
       <218287144>
   2 F24
     3 F24DX (N8)
       INIT
       <25375552>
     3 F24NX (N10)
       INIT
       <427286882>
     3 F24MX (N9)
       INIT
       <214245961>
   2 F25
     3 F25DX (N8)
       INIT
       <23958601>
     3 F25NX (N10)
       INIT
       <401911330>
     3 F25MX (N9)
       INIT
       <210526591>
   2 F26
     3 F26DX (N8)
       INIT
       <22621903>
     3 F26NX (N10)
       INIT
       <377952729>
     3 F26MX (N9)
       INIT
       <207128190>
   2 F27
     3 F27DX (N8)
       INIT
       <21360424>
     3 F27NX (N10)
       INIT
       <355330826>
     3 F27MX (N9)
       INIT
       <203983530>
   2 F28
     3 F28DX (N8)
       INIT
       <20169693>
     3 F28NX (N10)
       INIT
       <333970402>
     3 F28MX (N9)
       INIT
       <201054583>
   2 F29
     3 F29DX (N8)
       INIT
       <19045530>
     3 F29NX (N10)
       INIT
       <313800709>
     3 F29MX (N9)
       INIT
       <198308016>
   2 F30
     3 F30DX (N8)
       INIT
       <17984023>
     3 F30NX (N10)
       INIT
       <294755179>
     3 F30MX (N9)
       INIT
       <195714528>
   2 F31
     3 F31DX (N8)
       INIT
       <16981339>
     3 F31NX (N10)
       INIT
       <276771156>
     3 F31MX (N9)
       INIT
       <193231659>
   2 F32
     3 F32DX (N8)
       INIT
       <16034077>
     3 F32NX (N10)
       INIT
       <259789817>
     3 F32MX (N9)
       INIT
       <190839004>
   2 F33
     3 F33DX (N8)
       INIT
       <15139051>
     3 F33NX (N10)
       INIT
       <243755740>
     3 F33MX (N9)
       INIT
       <188519239>
   2 F34
     3 F34DX (N8)
       INIT
       <14293268>
     3 F34NX (N10)
       INIT
       <228616689>
     3 F34MX (N9)
       INIT
       <186257313>
   2 F35
     3 F35DX (N8)
       INIT
       <13493792>
     3 F35NX (N10)
       INIT
       <214323421>
     3 F35MX (N9)
       INIT
       <184027228>
   2 F36
     3 F36DX (N8)
       INIT
       <12738012>
     3 F36NX (N10)
       INIT
       <200829629>
     3 F36MX (N9)
       INIT
       <181819781>
   2 F37
     3 F37DX (N8)
       INIT
       <12023358>
     3 F37NX (N10)
       INIT
       <188091617>
     3 F37MX (N9)
       INIT
       <179615474>
   2 F38
     3 F38DX (N8)
       INIT
       <11347549>
     3 F38NX (N10)
       INIT
       <176068259>
     3 F38MX (N9)
       INIT
       <177409736>
   2 F39
     3 F39DX (N8)
       INIT
       <10708331>
     3 F39NX (N10)
       INIT
       <164720710>
     3 F39MX (N9)
       INIT
       <175188562>
   2 F40
     3 F40DX (N8)
       INIT
       <10103602>
     3 F40NX (N10)
       INIT
       <154012379>
     3 F40MX (N9)
       INIT
       <172940598>
   2 F41
     3 F41DX (N8)
       INIT
       <09531494>
     3 F41NX (N10)
       INIT
       <143908777>
     3 F41MX (N9)
       INIT
       <170666735>
   2 F42
     3 F42DX (N8)
       INIT
       <08990160>
     3 F42NX (N10)
       INIT
       <134377283>
     3 F42MX (N9)
       INIT
       <168359333>
   2 F43
     3 F43DX (N8)
       INIT
       <08477869>
     3 F43NX (N10)
       INIT
       <125387123>
     3 F43MX (N9)
       INIT
       <166012949>
   2 F44
     3 F44DX (N8)
       INIT
       <07993087>
     3 F44NX (N10)
       INIT
       <116909254>
     3 F44MX (N9)
       INIT
       <163631895>
   2 F45
     3 F45DX (N8)
       INIT
       <07534287>
     3 F45NX (N10)
       INIT
       <108916167>
     3 F45MX (N9)
       INIT
       <161213143>
   2 F46
     3 F46DX (N8)
       INIT
       <07099970>
     3 F46NX (N10)
       INIT
       <101381880>
     3 F46MX (N9)
       INIT
       <158748044>
   2 F47
     3 F47DX (N8)
       INIT
       <06688810>
     3 F47NX (N10)
       INIT
       <094281910>
     3 F47MX (N9)
       INIT
       <156237013>
   2 F48
     3 F48DX (N8)
       INIT
       <06299562>
     3 F48NX (N10)
       INIT
       <087593100>
     3 F48MX (N9)
       INIT
       <153681675>
   2 F49
     3 F49DX (N8)
       INIT
       <05931000>
     3 F49NX (N10)
       INIT
       <081293538>
     3 F49MX (N9)
       INIT
       <151078444>
   2 F50
     3 F50DX (N8)
       INIT
       <05581983>
     3 F50NX (N10)
       INIT
       <075362538>
     3 F50MX (N9)
       INIT
       <148425604>
   2 F51
     3 F51DX (N8)
       INIT
       <05251392>
     3 F51NX (N10)
       INIT
       <069780555>
     3 F51MX (N9)
       INIT
       <145717760>
   2 F52
     3 F52DX (N8)
       INIT
       <04937997>
     3 F52NX (N10)
       INIT
       <064529163>
     3 F52MX (N9)
       INIT
       <142931918>
   2 F53
     3 F53DX (N8)
       INIT
       <04640783>
     3 F53NX (N10)
       INIT
       <059591166>
     3 F53MX (N9)
       INIT
       <140060182>
   2 F54
     3 F54DX (N8)
       INIT
       <04358782>
     3 F54NX (N10)
       INIT
       <054950383>
     3 F54MX (N9)
       INIT
       <137093604>
   2 F55
     3 F55DX (N8)
       INIT
       <04091031>
     3 F55NX (N10)
       INIT
       <050591601>
     3 F55MX (N9)
       INIT
       <134018745>
   2 F56
     3 F56DX (N8)
       INIT
       <03836749>
     3 F56NX (N10)
       INIT
       <046500570>
     3 F56MX (N9)
       INIT
       <130834878>
   2 F57
     3 F57DX (N8)
       INIT
       <03595260>
     3 F57NX (N10)
       INIT
       <042663821>
     3 F57MX (N9)
       INIT
       <127547788>
   2 F58
     3 F58DX (N8)
       INIT
       <03365912>
     3 F58NX (N10)
       INIT
       <039068561>
     3 F58MX (N9)
       INIT
       <124161630>
   2 F59
     3 F59DX (N8)
       INIT
       <03148042>
     3 F59NX (N10)
       INIT
       <035702649>
     3 F59MX (N9)
       INIT
       <120676359>
   2 F60
     3 F60DX (N8)
       INIT
       <02940971>
     3 F60NX (N10)
       INIT
       <032554607>
     3 F60MX (N9)
       INIT
       <117086254>
   2 F61
     3 F61DX (N8)
       INIT
       <02744100>
     3 F61NX (N10)
       INIT
       <029613636>
     3 F61MX (N9)
       INIT
       <113390229>
   2 F62
     3 F62DX (N8)
       INIT
       <02556801>
     3 F62NX (N10)
       INIT
       <026869536>
     3 F62MX (N9)
       INIT
       <109580932>
   2 F63
     3 F63DX (N8)
       INIT
       <02378441>
     3 F63NX (N10)
       INIT
       <024312735>
     3 F63MX (N9)
       INIT
       <105647201>
   2 F64
     3 F64DX (N8)
       INIT
       <02208475>
     3 F64NX (N10)
       INIT
       <021934294>
     3 F64MX (N9)
       INIT
       <101583052>
   2 F65
     3 F65DX (N8)
       INIT
       <02046458>
     3 F65NX (N10)
       INIT
       <019725819>
     3 F65MX (N9)
       INIT
       <097389550>
   2 F66
     3 F66DX (N8)
       INIT
       <01892088>
     3 F66NX (N10)
       INIT
       <017679361>
     3 F66MX (N9)
       INIT
       <093079891>
   2 F67
     3 F67DX (N8)
       INIT
       <01745140>
     3 F67NX (N10)
       INIT
       <015787273>
     3 F67MX (N9)
       INIT
       <088673060>
   2 F68
     3 F68DX (N8)
       INIT
       <01605397>
     3 F68NX (N10)
       INIT
       <014042133>
     3 F68MX (N9)
       INIT
       <084187674>
   2 F69
     3 F69DX (N8)
       INIT
       <01472654>
     3 F69NX (N10)
       INIT
       <012436736>
     3 F69MX (N9)
       INIT
       <079642455>
   2 F70
     3 F70DX (N8)
       INIT
       <01346611>
     3 F70NX (N10)
       INIT
       <010964082>
     3 F70MX (N9)
       INIT
       <075045547>
   2 F71
     3 F71DX (N8)
       INIT
       <01226569>
     3 F71NX (N10)
       INIT
       <009617471>
     3 F71MX (N9)
       INIT
       <070363286>
   2 F72
     3 F72DX (N8)
       INIT
       <01112622>
     3 F72NX (N10)
       INIT
       <008390902>
     3 F72MX (N9)
       INIT
       <065637954>
   2 F73
     3 F73DX (N8)
       INIT
       <01004780>
     3 F73NX (N10)
       INIT
       <007278280>
     3 F73MX (N9)
       INIT
       <060903394>
   2 F74
     3 F74DX (N8)
       INIT
       <00902468>
     3 F74NX (N10)
       INIT
       <006273500>
     3 F74MX (N9)
       INIT
       <056135555>
   2 F75
     3 F75DX (N8)
       INIT
       <00805727>
     3 F75NX (N10)
       INIT
       <005371032>
     3 F75MX (N9)
       INIT
       <051368481>
   2 F76
     3 F76DX (N8)
       INIT
       <00714731>
     3 F76NX (N10)
       INIT
       <004565305>
     3 F76MX (N9)
       INIT
       <046649926>
   2 F77
     3 F77DX (N8)
       INIT
       <00629673>
     3 F77NX (N10)
       INIT
       <003850574>
     3 F77MX (N9)
       INIT
       <042030363>
   2 F78
     3 F78DX (N8)
       INIT
       <00550742>
     3 F78NX (N10)
       INIT
       <003220901>
     3 F78MX (N9)
       INIT
       <037561023>
   2 F79
     3 F79DX (N8)
       INIT
       <00478039>
     3 F79NX (N10)
       INIT
       <002670159>
     3 F79MX (N9)
       INIT
       <033285290>
   2 F80
     3 F80DX (N8)
       INIT
       <00411498>
     3 F80NX (N10)
       INIT
       <002192120>
     3 F80MX (N9)
       INIT
       <029230432>
   2 F81
     3 F81DX (N8)
       INIT
       <00350950>
     3 F81NX (N10)
       INIT
       <001780622>
     3 F81MX (N9)
       INIT
       <025413131>
   2 F82
     3 F82DX (N8)
       INIT
       <00296185>
     3 F82NX (N10)
       INIT
       <001429672>
     3 F82MX (N9)
       INIT
       <021844893>
   2 F83
     3 F83DX (N8)
       INIT
       <00246986>
     3 F83NX (N10)
       INIT
       <001133487>
     3 F83MX (N9)
       INIT
       <018535464>
   2 F84
     3 F84DX (N8)
       INIT
       <00203206>
     3 F84NX (N10)
       INIT
       <000886501>
     3 F84MX (N9)
       INIT
       <015500397>
   2 F85
     3 F85DX (N8)
       INIT
       <00164744>
     3 F85NX (N10)
       INIT
       <000683295>
     3 F85MX (N9)
       INIT
       <012759086>
   2 F86
     3 F86DX (N8)
       INIT
       <00131484>
     3 F86NX (N10)
       INIT
       <000518551>
     3 F86MX (N9)
       INIT
       <010328822>
   2 F87
     3 F87DX (N8)
       INIT
       <00103222>
     3 F87NX (N10)
       INIT
       <000387067>
     3 F87MX (N9)
       INIT
       <008217621>
   2 F88
     3 F88DX (N8)
       INIT
       <00079665>
     3 F88NX (N10)
       INIT
       <000283845>
     3 F88MX (N9)
       INIT
       <006423162>
   2 F89
     3 F89DX (N8)
       INIT
       <00060411>
     3 F89NX (N10)
       INIT
       <000204180>
     3 F89MX (N9)
       INIT
       <004930876>
   2 F90
     3 F90DX (N8)
       INIT
       <00044973>
     3 F90NX (N10)
       INIT
       <000143769>
     3 F90MX (N9)
       INIT
       <003715578>
   2 F91
     3 F91DX (N8)
       INIT
       <00032830>
     3 F91NX (N10)
       INIT
       <000098796>
     3 F91MX (N9)
       INIT
       <002745860>
   2 F92
     3 F92DX (N8)
       INIT
       <00023461>
     3 F92NX (N10)
       INIT
       <000065966>
     3 F92MX (N9)
       INIT
       <001987419>
   2 F93
     3 F93DX (N8)
       INIT
       <00016369>
     3 F93NX (N10)
       INIT
       <000042505>
     3 F93MX (N9)
       INIT
       <001405740>
   2 F94
     3 F94DX (N8)
       INIT
       <00011088>
     3 F94NX (N10)
       INIT
       <000026136>
     3 F94MX (N9)
       INIT
       <000966707>
   2 F95
     3 F95DX (N8)
       INIT
       <00007205>
     3 F95NX (N10)
       INIT
       <000015048>
     3 F95MX (N9)
       INIT
       <000638718>
   2 F96
     3 F96DX (N8)
       INIT
       <00004379>
     3 F96NX (N10)
       INIT
       <000007843>
     3 F96MX (N9)
       INIT
       <000395294>
   2 F97
     3 F97DX (N8)
       INIT
       <00002351>
     3 F97NX (N10)
       INIT
       <000003464>
     3 F97MX (N9)
       INIT
       <000216234>
   2 F98
     3 F98DX (N8)
       INIT
       <00000958>
     3 F98NX (N10)
       INIT
       <000001113>
     3 F98MX (N9)
       INIT
       <000089733>
   2 F99
     3 F99DX (N8)
       INIT
       <00000155>
     3 F99NX (N10)
       INIT
       <000000155>
     3 F99MX (N9)
       INIT
       <000014649>
   2 F100
     3 F100DX (N8)
       INIT
       <00000001>
     3 F100NX (N10)
       INIT
       <000000001>
     3 F100MX (N9)
       INIT
       <000000001>
   2 F101 (20)
    3 F101DX (N8)
      INIT
      <00000001>
    3 F101NX (N10)
      INIT
      <000000001>
    3 F101MX (N9)
      INIT
      <000000001>
 1 REDEFINE MORT-TABLE-J /* BEGIN REDEFINE: MORT-TABLE-
   2 MORT-TABLE-J-STRUCTURE (1:121)
     3 TJ-DX (N7.1)
     3 TJ-NX (N9.1)
     3 TJ-MX (N6.3)
END-DEFINE
