DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
/*  ATHISMTG created by ACCORD on: 02/09/05 at: 08:50:24.8
/*  start of original copybook: ATHISMTG
 1 MORT-TABLE-G
/*  X-18 @ 5.5% MORTALITY RATES
/*  DX NX MX
   2 F15
     3 F15DX (N8) INIT
       <44181952>
     3 F15NX (N9) INIT
       <793811293>
     3 F15MX (N9) INIT
       <279842500>
   2 F16
     3 F16DX (N8) INIT
       <41855594>
     3 F16NX (N9) INIT
       <749629341>
     3 F16MX (N9) INIT
       <277539148>
   2 F17
     3 F17DX (N8) INIT
       <39649350>
     3 F17NX (N9) INIT
       <707773747>
     3 F17MX (N9) INIT
       <275119237>
   2 F18
     3 F18DX (N8) INIT
       <37557142>
     3 F18NX (N9) INIT
       <668124397>
     3 F18MX (N9) INIT
       <272601181>
   2 F19
     3 F19DX (N8) INIT
       <35572487>
     3 F19NX (N9) INIT
       <630567255>
     3 F19MX (N9) INIT
       <269931281>
   2 F20
     3 F20DX (N8) INIT
       <33690686>
     3 F20NX (N9) INIT
       <594994768>
     3 F20MX (N9) INIT
       <267200074>
   2 F21
     3 F21DX (N8) INIT
       <31907154>
     3 F21NX (N9) INIT
       <561304082>
     3 F21MX (N9) INIT
       <264485531>
   2 F22
     3 F22DX (N8) INIT
       <30217435>
     3 F22NX (N9) INIT
       <529396928>
     3 F22MX (N9) INIT
       <261854306>
   2 F23
     3 F23DX (N8) INIT
       <28616627>
     3 F23NX (N9) INIT
       <499179493>
     3 F23MX (N9) INIT
       <259305090>
   2 F24
     3 F24DX (N8) INIT
       <27100352>
     3 F24NX (N9) INIT
       <470562866>
     3 F24MX (N9) INIT
       <256863873>
   2 F25
     3 F25DX (N8) INIT
       <25663905>
     3 F25NX (N9) INIT
       <443462514>
     3 F25MX (N9) INIT
       <254500623>
   2 F26
     3 F26DX (N8) INIT
       <24303352>
     3 F26NX (N9) INIT
       <417798609>
     3 F26MX (N9) INIT
       <252238205>
   2 F27
     3 F27DX (N8) INIT
       <23014468>
     3 F27NX (N9) INIT
       <393495257>
     3 F27MX (N9) INIT
       <250049675>
   2 F28
     3 F28DX (N8) INIT
       <21793283>
     3 F28NX (N9) INIT
       <370480789>
     3 F28MX (N9) INIT
       <247911815>
   2 F29
     3 F29DX (N8) INIT
       <20636482>
     3 F29NX (N9) INIT
       <348687506>
     3 F29MX (N9) INIT
       <245846035>
   2 F30
     3 F30DX (N8) INIT
       <19540303>
     3 F30NX (N9) INIT
       <328051024>
     3 F30MX (N9) INIT
       <243811705>
   2 F31
     3 F31DX (N8) INIT
       <18501611>
     3 F31NX (N9) INIT
       <308510721>
     3 F31MX (N9) INIT
       <241811351>
   2 F32
     3 F32DX (N8) INIT
       <17517255>
     3 F32NX (N9) INIT
       <290009110>
     3 F32MX (N9) INIT
       <239829653>
   2 F33
     3 F33DX (N8) INIT
       <16584441>
     3 F33NX (N9) INIT
       <272491855>
     3 F33MX (N9) INIT
       <237870444>
   2 F34
     3 F34DX (N8) INIT
       <15700357>
     3 F34NX (N9) INIT
       <255907414>
     3 F34MX (N9) INIT
       <235921217>
   2 F35
     3 F35DX (N8) INIT
       <14862211>
     3 F35NX (N9) INIT
       <240207057>
     3 F35MX (N9) INIT
       <233956780>
   2 F36
     3 F36DX (N8) INIT
       <14067541>
     3 F36NX (N9) INIT
       <225344846>
     3 F36MX (N9) INIT
       <231970483>
   2 F37
     3 F37DX (N8) INIT
       <13313760>
     3 F37NX (N9) INIT
       <211277305>
     3 F37MX (N9) INIT
       <229930359>
   2 F38
     3 F38DX (N8) INIT
       <12598477>
     3 F38NX (N9) INIT
       <197963545>
     3 F38MX (N9) INIT
       <227810289>
   2 F39
     3 F39DX (N8) INIT
       <11919354>
     3 F39NX (N9) INIT
       <185365068>
     3 F39MX (N9) INIT
       <225577185>
   2 F40
     3 F40DX (N8) INIT
       <11274240>
     3 F40NX (N9) INIT
       <173445714>
     3 F40MX (N9) INIT
       <223204664>
   2 F41
     3 F41DX (N8) INIT
       <10661263>
     3 F41NX (N9) INIT
       <162171474>
     3 F41MX (N9) INIT
       <220682602>
   2 F42
     3 F42DX (N8) INIT
       <10078785>
     3 F42NX (N9) INIT
       <151510211>
     3 F42MX (N9) INIT
       <218014782>
   2 F43
     3 F43DX (N8) INIT
       <09525168>
     3 F43NX (N9) INIT
       <141431426>
     3 F43MX (N9) INIT
       <215196546>
   2 F44
     3 F44DX (N8) INIT
       <08998982>
     3 F44NX (N9) INIT
       <131906258>
     3 F44MX (N9) INIT
       <212235184>
   2 F45
     3 F45DX (N8) INIT
       <08498877>
     3 F45NX (N9) INIT
       <122907276>
     3 F45MX (N9) INIT
       <209138808>
   2 F46
     3 F46DX (N8) INIT
       <08023423>
     3 F46NX (N9) INIT
       <114408399>
     3 F46MX (N9) INIT
       <205900408>
   2 F47
     3 F47DX (N8) INIT
       <07571298>
     3 F47NX (N9) INIT
       <106384976>
     3 F47MX (N9) INIT
       <202516158>
   2 F48
     3 F48DX (N8) INIT
       <07141277>
     3 F48NX (N9) INIT
       <098813678>
     3 F48MX (N9) INIT
       <198985268>
   2 F49
     3 F49DX (N8) INIT
       <06732024>
     3 F49NX (N9) INIT
       <091672401>
     3 F49MX (N9) INIT
       <195289421>
   2 F50
     3 F50DX (N8) INIT
       <06342396>
     3 F50NX (N9) INIT
       <084940377>
     3 F50MX (N9) INIT
       <191422474>
   2 F51
     3 F51DX (N8) INIT
       <05971351>
     3 F51NX (N9) INIT
       <078597981>
     3 F51MX (N9) INIT
       <187382588>
   2 F52
     3 F52DX (N8) INIT
       <05617881>
     3 F52NX (N9) INIT
       <072626630>
     3 F52MX (N9) INIT
       <183165868>
   2 F53
     3 F53DX (N8) INIT
       <05281288>
     3 F53NX (N9) INIT
       <067008749>
     3 F53MX (N9) INIT
       <178794060>
   2 F54
     3 F54DX (N8) INIT
       <04960806>
     3 F54NX (N9) INIT
       <061727461>
     3 F54MX (N9) INIT
       <174278697>
   2 F55
     3 F55DX (N8) INIT
       <04655540>
     3 F55NX (N9) INIT
       <056766655>
     3 F55MX (N9) INIT
       <169614112>
   2 F56
     3 F56DX (N8) INIT
       <04364690>
     3 F56NX (N9) INIT
       <052111115>
     3 F56MX (N9) INIT
       <164799708>
   2 F57
     3 F57DX (N8) INIT
       <04087460>
     3 F57NX (N9) INIT
       <047746425>
     3 F57MX (N9) INIT
       <159830976>
   2 F58
     3 F58DX (N8) INIT
       <03823150>
     3 F58NX (N9) INIT
       <043658965>
     3 F58MX (N9) INIT
       <154709042>
   2 F59
     3 F59DX (N8) INIT
       <03571112>
     3 F59NX (N9) INIT
       <039835815>
     3 F59MX (N9) INIT
       <149436372>
   2 F60
     3 F60DX (N8) INIT
       <03330815>
     3 F60NX (N9) INIT
       <036264703>
     3 F60MX (N9) INIT
       <144023842>
   2 F61
     3 F61DX (N8) INIT
       <03101700>
     3 F61NX (N9) INIT
       <032933888>
     3 F61MX (N9) INIT
       <138476706>
   2 F62
     3 F62DX (N8) INIT
       <02883316>
     3 F62NX (N9) INIT
       <029832188>
     3 F62MX (N9) INIT
       <132808374>
   2 F63
     3 F63DX (N8) INIT
       <02675280>
     3 F63NX (N9) INIT
       <026948872>
     3 F63MX (N9) INIT
       <127036272>
   2 F64
     3 F64DX (N8) INIT
       <02477233>
     3 F64NX (N9) INIT
       <024273592>
     3 F64MX (N9) INIT
       <121178535>
   2 F65
     3 F65DX (N8) INIT
       <02288799>
     3 F65NX (N9) INIT
       <021796359>
     3 F65MX (N9) INIT
       <115249613>
   2 F66
     3 F66DX (N8) INIT
       <02109579>
     3 F66NX (N9) INIT
       <019507560>
     3 F66MX (N9) INIT
       <109259681>
   2 F67
     3 F67DX (N8) INIT
       <01939193>
     3 F67NX (N9) INIT
       <017397981>
     3 F67MX (N9) INIT
       <103218899>
   2 F68
     3 F68DX (N8) INIT
       <01777293>
     3 F68NX (N9) INIT
       <015458788>
     3 F68MX (N9) INIT
       <097138460>
   2 F69
     3 F69DX (N8) INIT
       <01623587>
     3 F69NX (N9) INIT
       <013681495>
     3 F69MX (N9) INIT
       <091033322>
   2 F70
     3 F70DX (N8) INIT
       <01477910>
     3 F70NX (N9) INIT
       <012057908>
     3 F70MX (N9) INIT
       <084929869>
   2 F71
     3 F71DX (N8) INIT
       <01340205>
     3 F71NX (N9) INIT
       <010579998>
     3 F71MX (N9) INIT
       <078864132>
   2 F72
     3 F72DX (N8) INIT
       <01210517>
     3 F72NX (N9) INIT
       <009239793>
     3 F72MX (N9) INIT
       <072822117>
   2 F73
     3 F73DX (N8) INIT
       <01088891>
     3 F73NX (N9) INIT
       <008029276>
     3 F73MX (N9) INIT
       <067030337>
   2 F74
     3 F74DX (N8) INIT
       <00975347>
     3 F74NX (N9) INIT
       <006940385>
     3 F74MX (N9) INIT
       <061362622>
   2 F75
     3 F75DX (N8) INIT
       <00869742>
     3 F75NX (N9) INIT
       <005965038>
     3 F75MX (N9) INIT
       <055876806>
   2 F76
     3 F76DX (N8) INIT
       <00771803>
     3 F76NX (N9) INIT
       <005095296>
     3 F76MX (N9) INIT
       <050617131>
   2 F77
     3 F77DX (N8) INIT
       <00681198>
     3 F77NX (N9) INIT
       <004323493>
     3 F77MX (N9) INIT
       <045580298>
   2 F78
     3 F78DX (N8) INIT
       <00597569>
     3 F78NX (N9) INIT
       <003642295>
     3 F78MX (N9) INIT
       <040768654>
   2 F79
     3 F79DX (N8) INIT
       <00520582>
     3 F79NX (N9) INIT
       <003044726>
     3 F79MX (N9) INIT
       <036185219>
   2 F80
     3 F80DX (N8) INIT
       <00450025>
     3 F80NX (N9) INIT
       <002524144>
     3 F80MX (N9) INIT
       <031843421>
   2 F81
     3 F81DX (N8) INIT
       <00385767>
     3 F81NX (N9) INIT
       <002074119>
     3 F81MX (N9) INIT
       <027763768>
   2 F82
     3 F82DX (N8) INIT
       <00327708>
     3 F82NX (N9) INIT
       <001688352>
     3 F82MX (N9) INIT
       <023968995>
   2 F83
     3 F83DX (N8) INIT
       <00275735>
     3 F83NX (N9) INIT
       <001360644>
     3 F83MX (N9) INIT
       <020480062>
   2 F84
     3 F84DX (N8) INIT
       <00229683>
     3 F84NX (N9) INIT
       <001084909>
     3 F84MX (N9) INIT
       <017312382>
   2 F85
     3 F85DX (N8) INIT
       <00189309>
     3 F85NX (N9) INIT
       <000855226>
     3 F85MX (N9) INIT
       <014472367>
   2 F86
     3 F86DX (N8) INIT
       <00154297>
     3 F86NX (N9) INIT
       <000665917>
     3 F86MX (N9) INIT
       <011958057>
   2 F87
     3 F87DX (N8) INIT
       <00124275>
     3 F87NX (N9) INIT
       <000511620>
     3 F87MX (N9) INIT
       <009760313>
   2 F88
     3 F88DX (N8) INIT
       <00098834>
     3 F88NX (N9) INIT
       <000387345>
     3 F88MX (N9) INIT
       <007864029>
   2 F89
     3 F89DX (N8) INIT
       <00077531>
     3 F89NX (N9) INIT
       <000288511>
     3 F89MX (N9) INIT
       <006249055>
   2 F90
     3 F90DX (N8) INIT
       <00059912>
     3 F90NX (N9) INIT
       <000210980>
     3 F90MX (N9) INIT
       <004891335>
   2 F91
     3 F91DX (N8) INIT
       <00045523>
     3 F91NX (N9) INIT
       <000151068>
     3 F91MX (N9) INIT
       <003764753>
   2 F92
     3 F92DX (N8) INIT
       <00033928>
     3 F92NX (N9) INIT
       <000105545>
     3 F92MX (N9) INIT
       <002842600>
   2 F93
     3 F93DX (N8) INIT
       <00024723>
     3 F93NX (N9) INIT
       <000071617>
     3 F93MX (N9) INIT
       <002098939>
   2 F94
     3 F94DX (N8) INIT
       <00017541>
     3 F94NX (N9) INIT
       <000046894>
     3 F94MX (N9) INIT
       <001509639>
   2 F95
     3 F95DX (N8) INIT
       <00012056>
     3 F95NX (N9) INIT
       <000029353>
     3 F95MX (N9) INIT
       <001052574>
   2 F96
     3 F96DX (N8) INIT
       <00007965>
     3 F96NX (N9) INIT
       <000017297>
     3 F96MX (N9) INIT
       <000706290>
   2 F97
     3 F97DX (N8) INIT
       <00004957>
     3 F97NX (N9) INIT
       <000009332>
     3 F97MX (N9) INIT
       <000447075>
   2 F98
     3 F98DX (N8) INIT
       <00002773>
     3 F98NX (N9) INIT
       <000004375>
     3 F98MX (N9) INIT
       <000254522>
   2 F99
     3 F99DX (N8) INIT
       <00001255>
     3 F99NX (N9) INIT
       <000001602>
     3 F99MX (N9) INIT
       <000117142>
   2 F00
     3 F00DX (N8) INIT
       <00000347>
     3 F00NX (N9) INIT
       <000000347>
     3 F00MX (N9) INIT
       <000032860>
 1 REDEFINE MORT-TABLE-G /* BEGIN REDEFINE: MORT-TABLE-
   2 MORT-TABLE-G-ARRAY (1:86)
     3 TG-DX (N7.1)
     3 TG-NX (N8.1)
     3 TG-MX (N6.3)
END-DEFINE
