DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-CAP-POLICY
  2 #CAP-MEMBER-NUMBER (N6.0)
  2 REDEFINE #CAP-MEMBER-NUMBER /* BEGIN REDEFINE: #CAP-MEMBER
    3 #CAP-MEMBER-NUMBER-A (A6)
  2 #CAP-X (I2)
  2 #CAP-IND (A3)
  2 #CAP-FND (L)
END-DEFINE
