DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 TR-REG-V VIEW OF A-TRANSACTION-REGISTER
  2 TRANSREG
    3 ID-NUMBER (N6.0)
    3 PROCESS-IND (A1) /* PM -06/2000 - SPLIT COMPANIES
    3 NAME (A25)
    3 DATE-LAST-UPDATE (N8.0)
    3 TERMINAL-ID (A8)
    3 CLERK-ID (A3)
    3 TRANSACTION-DATN (P9.0)
    3 TRANSACTION-TIMN (P7.0)
    3 OLD-DATA (A125/1)
    3 NEW-DATA (A125/1)
END-DEFINE
