DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 NT-V VIEW OF A-NOTES
  2 ID-NUMBER (N6.0)
  2 NOTE-TABLE (1:20) /* PERIODIC GROUP
    3 NOTE-TEXT (A60)
    3 REDEFINE NOTE-TEXT /* REDEF. BEGIN : NOTE-TEXT
      4 YTD-NEW-BUS-ACCUMS-P7 (P7/15)
    3 REDEFINE NOTE-TEXT /* REDEF. BEGIN : NOTE-TEXT
      4 YTD-NEW-BUS-ACCUMS (P5/20)
END-DEFINE
