DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 A-FIRS-VIEW VIEW OF A-FIRS
  2 ID-NUMBER (N6.0)
  2 MEMBER-FLAG (A1) /*
1 A-NOTES-VIEW VIEW OF A-NOTES
  2 ID-NUMBER (N6.0)
END-DEFINE
