* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PGM-ID: ATHPCLUP    ** UPDATE CERTIFIED LIST ON "NX" REC  **
DEFINE DATA
 LOCAL  USING GONERLXX
 LOCAL
1 NT-V VIEW OF A-NOTES
 2 ID-NUMBER       (N6)
 2 NOTE-TABLE    (40)
  3 NOTE-TEXT      (A60)
  3 REDEFINE NOTE-TEXT
   4 CERT-IDS      (P6/15)
*
1 #CERT-LABELS
 2 #CERT-LBL-ID        (A9)
 2 REDEFINE #CERT-LBL-ID
  3 #CERT-LBL-CN-NUM   (N6)
  3 #CERT-LBL-CN-FILL  (A3)
 2 #CERT-LBL-FILL      (A172)
*
1 #I1            (I2)
1 #I2            (I2)
1 #FOUND-REC     (L)
1 #ISN           (P8)
1 #PREM-CERT-CNT (P5)
1 #FPF-CERT-CNT  (P5)
1 #STOP-CERT-CNT (P5)
*
1 #DATN         (N8)
1 REDEFINE #DATN
 2 #DATN-CC     (N2)
 2 #DATN-YY     (N2)
 2 #DATN-MM     (N2)
 2 #DATN-DD     (N2)
*
END-DEFINE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*
FORMAT LS=133 PS=76
WRITE  TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
                  'BUILD CERTIFIED LIST ON "NX" RECORD (800009/10/11)'
                  5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
MOVE *DATN TO #DATN
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*       P R E M I U M   C E R T I F I E D S
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*
MOVE TRUE TO #FOUND-REC
FIND (1) NT-V WITH ID-NUMBER = 800009
  IF NO RECORDS FOUND
    WRITE 'NO NX 800009 REC FOUND'
    RESET #FOUND-REC
  END-NOREC
  MOVE *ISN TO #ISN
END-FIND
*
IF #FOUND-REC
  GET NT-V #ISN
  RESET NOTE-TEXT (*)
END-IF
*
MOVE 1 TO #I1
MOVE 1 TO #I2
*
REPEAT
  READ WORK 1 ONCE RECORD #CERT-LABELS
    AT END
      MOVE 999999 TO CERT-IDS (#I1, #I2)
      ESCAPE BOTTOM
    END-ENDFILE
*
  ADD 1 TO #PREM-CERT-CNT
  MOVE #CERT-LBL-CN-NUM TO CERT-IDS (#I1, #I2)
*
  IF #I2 = 15
    IF #I1 GE 40
      WRITE 'EXCEEDED 600 CERTIFIED NOTICES'
    ELSE
      ADD 1 TO #I1     /* CAN HANDLE UP TO 600 CERTS
    END-IF
*
    MOVE 1 TO #I2
  ELSE
    ADD 1 TO #I2
  END-IF
END-REPEAT
*
IF #PREM-CERT-CNT GT 1      /* TO PREVENT WIPING OUT RECORD OF DOING
  IF #FOUND-REC             /* DSDCTH82
    UPDATE (0062)
  ELSE
    MOVE 800009 TO NT-V.ID-NUMBER
    STORE NT-V
  END-IF
END-IF
*
END TRANSACTION
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*       F P F / S N G - P R M    C E R T I F I E D S
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*
MOVE TRUE TO #FOUND-REC
FIND (1) NT-V WITH ID-NUMBER = 800010
  IF NO RECORDS FOUND
    WRITE 'NO NX 800010 REC FOUND'
    RESET #FOUND-REC
  END-NOREC
  MOVE *ISN TO #ISN
END-FIND
*
IF #FOUND-REC
  GET NT-V #ISN
  RESET NOTE-TEXT (*)
END-IF
*
MOVE 1 TO #I1
MOVE 1 TO #I2
*
REPEAT
  READ WORK 2 ONCE RECORD #CERT-LABELS
    AT END
      MOVE 999999 TO CERT-IDS (#I1, #I2)
      ESCAPE BOTTOM
    END-ENDFILE
*
  ADD 1 TO #FPF-CERT-CNT
  MOVE #CERT-LBL-CN-NUM TO CERT-IDS (#I1, #I2)
*
  IF #I2 = 15
    IF #I1 GE 40
      WRITE 'EXCEEDED 600 CERTIFIED NOTICES'
    ELSE
      ADD 1 TO #I1     /* CAN HANDLE UP TO 600 CERTS
    END-IF
*
    MOVE 1 TO #I2
  ELSE
    ADD 1 TO #I2
  END-IF
END-REPEAT
*
IF #FOUND-REC
  UPDATE (0117)
ELSE
  MOVE 800010 TO NT-V.ID-NUMBER
  STORE NT-V
END-IF
*
END TRANSACTION
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*       S T O P   A L L O T M E N T   C E R T I F I E D S
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*
MOVE TRUE TO #FOUND-REC
FIND (1) NT-V WITH ID-NUMBER = 800011
  IF NO RECORDS FOUND
    WRITE 'NO NX 800011 REC FOUND'
    RESET #FOUND-REC
  END-NOREC
  MOVE *ISN TO #ISN
END-FIND
*
IF #FOUND-REC
  GET NT-V #ISN
  RESET NOTE-TEXT (*)
END-IF
*
MOVE 1 TO #I1
MOVE 1 TO #I2
*
REPEAT
  READ WORK 3 ONCE RECORD #CERT-LABELS
    AT END
      MOVE 999999 TO CERT-IDS (#I1, #I2)
      ESCAPE BOTTOM
    END-ENDFILE
  ADD 1 TO #STOP-CERT-CNT
  MOVE #CERT-LBL-CN-NUM TO CERT-IDS (#I1, #I2)
  IF #I2 = 15
    IF #I1 GE 40
      WRITE 'EXCEEDED 600 CERTIFIED NOTICES'
    ELSE
      ADD 1 TO #I1     /* CAN HANDLE UP TO 600 CERTS
    END-IF
    MOVE 1 TO #I2
  ELSE
    ADD 1 TO #I2
  END-IF
END-REPEAT
*
IF #FOUND-REC
  UPDATE (0170)
ELSE
  MOVE 800011 TO NT-V.ID-NUMBER
  STORE NT-V
END-IF
*
END TRANSACTION
*
WRITE 'TOTAL PREM-CERTIFIEDS = ' #PREM-CERT-CNT
WRITE 'TOTAL FPF-CERTIFIEDS  = ' #FPF-CERT-CNT
WRITE 'TOTAL STOP-CERTIFIEDS = ' #STOP-CERT-CNT
*
END
