* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ATHPafal - AFSC allotment check
* AFFL DOES NOT HAVR ALLOTMENTS SO THIS WILL NEVER RUN    RE1
************************************************************************
*     MODIFICATION LOG
* USER DATE       TAG  REASON
* RSE  09/18/2009 RE1  Change Documentation
************************************************************************
DEFINE DATA
LOCAL USING G4090LNX
LOCAL
1 #PARM-INPUT     (A19)
1 REDEFINE #PARM-INPUT
 2 #PARM-DESC     (A10)   /* 'updt date'
 2 #PARM-DATE     (N8)
*
1 ST-V VIEW OF A-STATUS
  2 ID-NUMBER
  2 SSN
  2 PROCESS-IND
  2 NAME
  2 MODE  (1)
*
1 AT-V VIEW OF A-APPL-TRACKING
  2 ID-NUMBER
  2 SSN
  2 INTRO-FLAG
  2 NAME
*
1 #ALLOTMENT-FILE
  2 #AR-ID-NUMBER   (N6)
  2 #AR-SERV        (A1)
  2 #AR-SSN         (N9)
  2 #AR-ST-SP       (A1)
  2 #AR-REAS        (A2)
  2 #AR-ACT-RET     (A1)
  2 #AR-BLNK-CODE   (A3)
  2 #AR-EFF-DT      (A4)
  2 #AR-STP-DT      (A4)
  2 #AR-AMT         (P8.2)
  2 #AR-NAME        (A25)
  2 #AR-FILLER      (A38)
*
1 #YYYYMMDD        (N8)
1 REDEFINE #YYYYMMDD
  2 #YYYY          (N4)
  2 #MM            (N2)
  2 #DD            (N2)
*
1 #CNT            (P5)
1 #CNT-2          (P5)
1 #CNT-3          (P5)
1 #CNT-4          (P5)
1 #CNT-5          (P5)
1 #CNT-6          (P5)
1 #CNT-7          (P5)
1 #CNT-8          (P5)
1 #I1             (I2)
1 #I2             (I2)
1 #I3             (I2)
1 #I4             (I2)
1 #I5             (I2)
END-DEFINE
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
FORMAT LS=133 PS=66
WRITE TITLE LEFT 'PROGRAM:' *PROGRAM
    8X  'AAFMAA allotment MESSAGES'
    5X  'DATE:' *DAT4U 2X 'TIME:' *TIMX
    2X  'PAGE:' *PAGE-NUMBER (2)
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
FORMAT(2)  LS=133 PS=66
WRITE (2) TITLE LEFT 'PROGRAM:' *PROGRAM
    8X  'AFSC allotments on AAFMAA Allotment file'        
    8X  'AFFL allotments on AAFMAA Allotment file'        
    5X  'DATE:' *DAT4U 2X 'TIME:' *TIMX
    2X  'PAGE:' *PAGE-NUMBER (2)
*
*
* INPUT #PARM-INPUT
* * * * * * * * * * * * * * * P H A S E 1 - U P D A T E  T I C K E R S
READ WORK 1 RECORD #ALLOTMENT-FILE
* IF  (#AR-AMT GT 20.00)
*   ESCAPE TOP
* END-IF
*
  FIND ST-V WITH SSN = #AR-SSN
    DISPLAY #AR-SSN ST-V.ID-NUMBER
      PROCESS-IND
      #AR-AMT ST-V.NAME
    IF PROCESS-IND = 'S'                   
      ADD 1 TO #CNT-2
      DISPLAY (2) #CNT-2 ST-V.ID-NUMBER ST-V.SSN MODE (1)
       ST-V.NAME PROCESS-IND
          #AR-AMT
*     ESCAPE TOP
    END-IF
  END-FIND
*
  FIND AT-V WITH SSN = #AR-SSN
    DISPLAY #AR-SSN AT-V.ID-NUMBER
      INTRO-FLAG
      #AR-AMT AT-V.NAME
    IF INTRO-FLAG = 'V'
      ADD 1 TO #CNT-2
      DISPLAY (2) #CNT-2 AT-V.ID-NUMBER AT-V.SSN AT-V.NAME INTRO-FLAG
          #AR-AMT
*     ESCAPE TOP
    END-IF
  END-FIND
END-WORK
*
END
