* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*** <@ NATURAL META INFORMATION BEGIN
***
*** @Mode REPORT
***
*** NATURAL META INFORMATION END @>
* PROGRAM-ID: ATHPPRNT - modify print file for printing
**
**  SAG-AB 20060711 Changes to accommodate Unix page throw and line spacing
**  SAG-AB 20060808 Also adjusted line-count that was counting writes not lines
**  PM1  PAM  20070222 Ensure that first record in refund file is checked
** DW1  DRW  Chg line Limit from 50 to 65  and then chged to 56
*
DEFINE DATA
LOCAL
*
1 INPUT-FILE   (A81)
1 REDEFINE INPUT-FILE
  2 INP-POS-1-80  (A80)
1 REDEFINE INPUT-FILE
  2 INP-POS-1      (A1)
  2 INP-POS-2-81  (A80)
  2 REDEFINE INP-POS-2-81
    3 INP-POS-2   (A1)
    3 INP-CMND    (A2)
    3 IMP-FIL1    (A1)
    3 INP-ID      (A6)
    3 INP-10-20   (A11)
    3 INP-REF     (A3)
    3 INP-REST    (A56)
*
1 OUTPUT-FILE  (A82)      /* SAG-AB 20060711
*
1 #1ST-TIME    (L)
1 #FOUND-REF   (L)
1 #LAST-ID     (A6)
1 #RECS-IN    (P7)
1 #RECS-OUT   (P7)
1 #PAGES-OUT   (P7)
1 #RECS-CLEARED (P7)
*
* 1 #PAGE-TOP  (B2) INIT <00001100>    /* hex "0C"
* 1 #PAGE-TOP  (A1) INIT <'~'>
1 #PAGE-TOP  (A1) INIT <H'0C'>
* 1 #PAGE-TOP  (H1) INIT <0C>    /* hex "0C"
1 #LINES-ON-A-PAGE   (N3)
*
END-DEFINE
*
* * * * * * * REPORT HEADER * * * * * *
FORMAT      LS=145 PS=76
FORMAT (1)  LS=145 PS=76
FORMAT (2)  LS=133 PS=76
WRITE  (2) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
  '(2) AAFMAA Print lines deleted'
  5X 'DATE: '*DATX 5X 'TIME: ' *TIMX  //
*
MOVE TRUE TO #1ST-TIME
READ WORK 1 RECORD INPUT-FILE
  ADD +1 TO #RECS-IN
*
  IF INP-POS-1 NE #PAGE-TOP           /* SAG-AB 20060824 START
    MOVE INP-POS-1-80 TO INP-POS-2-81
    RESET INP-POS-1
  END-IF                              /* SAG-AB 20060711 END

  IF INP-POS-2 NE ' '
    WRITE (2) INPUT-FILE
    RESET INP-POS-2-81                    /* SAG-AB 20060711
**  RESET INPUT-FILE                      /* SAG-AB 20060711
    ADD 1 TO #RECS-CLEARED
  END-IF
*
**IF INP-POS-1 = '1'           /* top of page  SAG-AB 20060711
  IF INP-POS-1 = #PAGE-TOP      /* top of page  SAG-AB 20060711
   OR #1ST-TIME                                                           /* PM1
    IF INP-REF = 'REF'   /* TOP OF PAGE OF AD REF
      MOVE TRUE TO #FOUND-REF
      MOVE INP-ID TO #LAST-ID
    ELSE
      IF (#FOUND-REF) AND (INP-ID = #LAST-ID)
        RESET #FOUND-REF
        ESCAPE TOP
      END-IF
    END-IF
*
    IF #1ST-TIME                                                          /* PM1
      RESET #1ST-TIME                                                     /* PM1
    END-IF                                                                /* PM1
*
    ADD 1 TO #PAGES-OUT
    RESET #LINES-ON-A-PAGE
**  RESET INP-POS-1            /* SAG-AB 20060711  START
*
**  IF #1ST-TIME   /* no page top on 1st record
**    RESET #1ST-TIME
**  ELSE
**    MOVE #PAGE-TOP TO INP-POS-1   /* aafm top of page
**  END-IF
**ELSE
**  IF INP-POS-1 = '0'  /* skip 1 line
**    RESET INP-POS-1
**    RESET OUTPUT-FILE
**    PERFORM WRITE-PRINT-LINE
**  ELSE
**    IF INP-POS-1 = '-'  /* skip 2 line
**      RESET INP-POS-1
**      RESET OUTPUT-FILE
**      PERFORM WRITE-PRINT-LINE
**      PERFORM WRITE-PRINT-LINE
**    END-IF
**  END-IF                      /* SAG-AB 20060711  END
  END-IF
*
  MOVE INPUT-FILE TO OUTPUT-FILE
  PERFORM WRITE-PRINT-LINE
END-WORK
*
WRITE  'TOTAL RECS read    =' #RECS-IN
WRITE  'TOTAL RECS written =' #RECS-OUT
WRITE  'TOTAL pages written=' #PAGES-OUT
WRITE  'TOTAL RECS cleared =' #RECS-CLEARED
*
* * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE WRITE-PRINT-LINE
* * * * * * * * * * * * * * * * *
*
* IF #LINES-ON-A-PAGE GT 50    /* Chged to 65 8/30/2007
IF #LINES-ON-A-PAGE GT 56         /* DW1

**IF #LINES-ON-A-PAGE GE 76
  IF OUTPUT-FILE NE ' '
    WRITE 'Deleted-line=' OUTPUT-FILE
  END-IF
ELSE
  WRITE WORK 2 OUTPUT-FILE
  ADD +1 TO #RECS-OUT
  ADD +1 TO #LINES-ON-A-PAGE
END-IF
*
END-SUBROUTINE
*
END
