* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ATHPDOWR   ** DOWNLOAD ANN REPORT ADDRS IN CHUNKS
*     Usually run in March at request of Tom Hargis
*
***************************************************************************
*                       MODIFICATION LOG                                  *
* USER DATE       TAG   REASON                                            *
* DRW  03082006   XXX   CREATED FROM ATHPDOWN                             *
* SAG  04072006   AB    Replaced Hex '05' with Hex '09' for ASCII         *
* DRW  03042007   DRW1  Add labels to totals for readability              *
* DRW 03/20/2008  DW2   Separate G/F from Others and add ANN RPT FLAG to  *
*                       files                                             *
* YAK  03162009   YK1   Add separate fields for name, suffix and retired  *
*                       Format SSN numnber to keep leading zeroes         *
* RSE  10132009   RE1   Change PROCESS-IND/600K logic for Unification     *
* PAM  03/05/2010 PM1   Modified for 2010 changes                         *
* PAM  03/17/2010 PM2   Added military service                            *
* PAM  03/24/2010 PM3   Added parm for compressed or non-compressed files *
*                       indicates header or no header record              *
* vxt  03/08/2011 vt1   Change the source for name, address, phone and e-mail info
* bz   04/03/2013 change output from PRINTER(0) to PRINTER(1)
* NGG  20130806   NG1   Address Normalization                             *
* TMT  06/10/2014 TT1   CONTACT NORMALIZATION - GENDER AND DOB            *
* bz   3/31/2015  bz    OI-1758 Change logic for APO and email            *
***************************************************************************
*
*
DEFINE DATA
GLOBAL USING BCOMMGXX WITH MASTER-BLOCK                      /*           vt1
LOCAL USING GONERLXX           /* WORK FIELDS FOR GONERCXX
LOCAL USING ADDA0001           /* ADDRESS PDA                 VT1
local using G3500AAD           /* pda for G3500sad program    vt1
LOCAL
**1 #TAB       (A1) INIT <H'05'> /* SAG-AB 20060407
1 #TAB       (A1) INIT <H'09'>   /* SAG-AB 20060407
1 #SSN-a       (A9)                /* yk1
1 #RETIRED   (A3)                /* yk1
*
1 #NO-ADDR     (N5)
1 #AR-X         (I2)
1 #ADDR-CODE-X  (I2)
1 #ANN-RPT-OCC     (3)   /* 1- full 2-summary   3-none
  2 #ADDR-CODE-OCC     (4)   /* 1-foreign/2-apos/3-others/4-48-states
    3 #ANN-RPT-CNT-GF   (P6)        /* Grand-fathered   DW2
    3 #ANN-RPT-CNT-IP   (P6)        /* ALL ELSE (INS-PLUS)  DW2
*
1  ST-V VIEW OF A-STATUS
  2 ID-NUMBER
  2 REDEFINE ID-NUMBER
    3 ID-NUMBER-A   (A6)
  2 member-contact-id                                       /* vt1
  2 spouse-contact-id                                       /* vt1
  2 SSN
  2 WIDOW-FLAG
  2 APPL-SOURCE
  2 PROCESS-IND
  2 MBR-SINCE
*  2 DATE-OF-BIRTH                 /* TT1
  2 SUSPEND-CODE
  2 INS-MAIL-CODE
  2 ANNUAL-RPT-FLAG
  2 DATE-BOOK
  2 CHIEF-OF-STAFF-IND
*  2 SEX                           /* TT1
  2 DATE-OTHER-UPDATE
  2 NAME
  2 NAME-SP
  2 INTRO-FLAG
  2 HANDLE-FLAG
  2 DI-BA-MAIL-CD
  2 RANK
  2 TITLE-SP
  2 MILITARY-STATUS
  2 MILITARY-SERVICE
  2 NUMBER-MEMBERSHIPS
  2 SOC-SEC-ST-DATE
  2 SOC-SEC-PIA
*   2 TELE-NUMBER
*   2 HOME-TELE-INTR
*   2 REDEFINE HOME-TELE-INTR
*     3 HOME-TELE-INTR-A   (A6)
*   2 WORK-TELE-INTR
*   2 REDEFINE WORK-TELE-INTR
*     3 WORK-TELE-INTR-A   (A6)
*   2 FAX-NUMBER   (P17)
*   2 FAX-NUMBER-INTR
*   2 REDEFINE FAX-NUMBER-INTR
*     3 FAX-NUMBER-INTR-A   (A6)
*   2 NXT-OF-KIN-TELE-NUMBER
*
1 #ANN-RPT-FLAG            (A1)       /* DW2
1 #G-F                     (L)        /* DW2
** 1 #PHONE     (N11)                                          /* vt1 \/
** 1 REDEFINE #PHONE
**  2 #PHONE-1    (A1)
**  2 #PHONE-A    (A10)                                        /* vt1 /\
*
1 #FAX       (N17)
1 REDEFINE #FAX
  2 #FAX-7    (A7)
  2 #FAX-A    (A10)
*
1 #HOME-PHONE  (A16)
1 #WORK-PHONE  (A16)
1 #FAX-PHONE   (A16)
*
** 1 #INTERNET-ADDR  (A60)                                  /* vt1
*
1 #SPLIT    (A1)
1 #ERR-MSG  (A60)
1 #STREET   (A70)                         /* vt1  was a25
1 #STREET-2 (A70)                         /* vt1  was a25
1 #CITY     (A50)                         /* vt1 was a22
1 #STATE    (A2)
** 1 #NAME      (A25)                                            /* vt1
1 #LAST      (A25)
1 #FIRST-20  (A20)
1 #MI        (A1)
*
1 #FORMAT-CN      (A7)
1 #FORMAT-MEMSHIP (A2)
1 #DEAR-NAME    (A70)                            /* vt1 was a28
1 #middle-name       (a25)                                      /* vt1
1 #suffix         (a10)                                         /* vt1
1 #XXX            (A3) INIT <'XXX'>
1 #EDIT-INVALID (L)
1 #RANK-LITERAL (A23)
1 #HOLD-RANK-5  (A5)
1 #DISPL        (P2)
1 #PASS-COMMAND (A2)   INIT <'AD'>
*
1 #ERROR-MESSAGE  (A25)
1 #EXTRACTS       (P6)
*
1 #NUM-RECS          (P5)
1 #EXTRACT-250    (A250)
1 #EXTRACT-150    (A150)
1 #EXTRACT-125    (A125)
1 #REC-OVERFLOW      (A250)
1 REDEFINE #REC-OVERFLOW
  2 #REC-OVF-1ST-125   (A125)
  2 #REC-OVF-2ND-125   (A125)
*
1 #I1    (I2)
1 #I2    (I2)
1 #I3    (I2)
*
1 #YYYYMMDD    (N8)
1 REDEFINE #YYYYMMDD
  2 #YYYY   (N4)
  2 #MM     (N2)
  2 #DD     (N2)
1 REDEFINE #YYYYMMDD
  2 #YYYY-A (A4)
  2 #MM-A   (A2)
  2 #DD-A   (A2)
*
1 #LETTER-TABLE
  2 #1T (A26) INIT <'AaBbCcDdEeFfGgHhIiJjKkLlMm'>
  2 #2T (A26) INIT <'NnOoPpQqRrSsTtUuVvWwXxYyZz'>
1 REDEFINE #LETTER-TABLE
  2 #LETTER-OCC  (26)
    3 #UPPER     (A1)
    3 #LOWER     (A1)
*
1 #HOLD-LAST-NAME        (A25)
1 REDEFINE #HOLD-LAST-NAME
  2 #HOLD-LAST-NAME-A     (A1/25)
*
1 #JCL-PARM       (A1)    /* PM3
1 #contact-id     (n8)    /* vt1 \/
1 #ZIP            (A10)   /* NG1 \/
1 CNRY VIEW OF A-GEN-TABLE
  2 GEN-KEY                           (A4)
  2 GEN-SUB-KEY                       (A3)
  2 GEN-ALPHA-VALUE                   (A50)
  2 GEN-DESCRIPTION                   (A75)
1 #TABLE-KEY  (A7) 1 REDEFINE #TABLE-KEY
  2 #GEN-KEY         (A4)
  2 #SUB-KEY         (A3)
*                            NG1 /\
1 #Phones    (10)
  2 #Phone           (A36)
  2 #phone-Type      (A16)
  2 #Code             (A1)
  2 #Preferred (A1)
1 #ret-code        (N3)
*
1 #idx          (i2)
1 #idx1         (i2)
1 #idx2         (i2)
1 #name-f       (a70)
1 #country      (a50)
1 #pda-rank
  2 #PASS-COMMAND-r       (A2)
  2 #RANK-PASS-r          (A3)
  2 #MIL-ID-PASS-r        (A3)
  2 #INVALID-r            (L)
  2 #RANK-PAY-TBL-DISPL-r (P2)
  2 #RANK-LITERAL-PASS-r  (A23)
  2 #RANK-DISPLAY-r       (A5)
*
  2 #CONTACT-ID-r         (N8)
  2 #RANK-ABBR          (A) DYNAMIC
  2 #LETTER-ENV         (A) DYNAMIC
  2 #SALUTATION         (A) DYNAMIC
  2 #SALUTATION-WITH-NAME (A) DYNAMIC
*
1 cont view of A-contacts
  2 id-number
  2 contact-id
1 #rank-n                  (a3)                                                      /* vt1 /\
*
1 v_A         (A) DYNAMIC
1 v_A_Length  (I2)
END-DEFINE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*
FORMAT (1)    LS=133 PS=62
WRITE  (1)    TITLE LEFT 'PROGRAM:' *PROGRAM
  5X 'DATE:' *DAT4U 5X 'TIME:' *TIMX
FORMAT (2) LS=133 PS=62
WRITE  (2) TITLE LEFT 'PROGRAM:' *PROGRAM  '   Extracted addr info'
  5X 'DATE:' *DAT4U 5X 'TIME:' *TIMX
*
INPUT #JCL-PARM                        /* PM3
WRITE (2) #JCL-PARM                        /* PM3
*
COMPRESS
  'FORMATED-NAME'
  #TAB 'STREET' #TAB 'STREET-2'
  #TAB 'CITY' #TAB 'STATE' #TAB 'ZIP'
  #TAB 'CN'
  #TAB 'SSN'
  #TAB 'RANK'
  #TAB 'MILITARY SERV'              /* PM2
  #TAB 'INTERNET-ADDR'
  #TAB 'HOME-PHONE'
  #TAB 'WORK-PHONE'
  #TAB 'FAX-PHONE'
  #TAB 'ANN-RPT-FLAG'               /* DW2
  #TAB 'FIRST-NAME'                 /* yk1
  #TAB 'MIDDLE-INIT'                /* yk1
  #TAB 'LAST-NAME'                  /* yk1
  #TAB 'SUFFIX'                     /* yk1
  #TAB 'RETIRED'                    /* yk1
  INTO #EXTRACT-250 LEAVING NO
WRITE WORK FILE 1 #EXTRACT-250
WRITE WORK FILE 2 #EXTRACT-250
WRITE WORK FILE 3 #EXTRACT-250
WRITE WORK FILE 4 #EXTRACT-250
WRITE WORK FILE 5 #EXTRACT-250
WRITE WORK FILE 6 #EXTRACT-250
WRITE WORK FILE 7 #EXTRACT-250
WRITE WORK FILE 8 #EXTRACT-250
WRITE WORK FILE 9 #EXTRACT-250
*
IF #JCL-PARM = 'S'                     /* PM3 - indicates seperate files
  WRITE WORK FILE 10 #EXTRACT-250
  WRITE WORK FILE 11 #EXTRACT-250
  WRITE WORK FILE 12 #EXTRACT-250
  WRITE WORK FILE 13 #EXTRACT-250
  WRITE WORK FILE 14 #EXTRACT-250
  WRITE WORK FILE 15 #EXTRACT-250
  WRITE WORK FILE 16 #EXTRACT-250
  WRITE WORK FILE 17 #EXTRACT-250
  WRITE WORK FILE 18 #EXTRACT-250
END-IF                                 /* PM3
*
READ ST-V BY MEMBER-KEY FROM '001900'                                     /* NG1 BEGIN
  RESET #PDA-ADDRESS                                        /* VT1 \/
  MOVE ST-V.MEMBER-CONTACT-ID TO #ADD-CONTACT-ID
  MOVE 'P' TO #ADD-TYPE
  CALLNAT 'ADDN0001' #PDA-ADDRESS
*   #ADDRESS-1   := #ADD-LINE-1
*   #ADDRESS-2   := #ADD-LINE-2
*   #ADDRESS-3   := #ADD-LINE-3
*   #CITY        := #ADD-CITY
*   #STATE       := #ADD-STATE
*   #ZIP-CODE-F  := #ADD-ZIP-CODE
*   #COUNTRY     := #ADD-COUNTRY
*
  /* vt1 /\
  IF  (WIDOW-FLAG = 'Y')             /* BYPASS WIDOWS ON MBR RUN
      OR (NUMBER-MEMBERSHIPS = 0)    /* BYPASS INACTIVE MBRS ON MEMBER RUN
      OR  (MILITARY-SERVICE = 'EMP') /* BYPASS EMPLOYEES
*       AND (ID-NUMBER NE 116944))   /* include lisa milman
      OR (#ADD-LINE-1 = ' ' AND #ADD-LINE-2 = ' ' AND #ADD-LINE-3 = ' ')      /*  VT1 /\
      OR #ADD-RETURNED-MAIL = 'Y'                 /* UNDELIVERABLE    NG1
*     OR (ADDRESS-CHG-CODE = 'U' OR = 'V')        /* UNDELIVERABLE
      OR (PROCESS-IND = 'C')                      /* NO CONTACT ENTITIES
      OR (INTRO-FLAG = 'S' OR = 'K' OR = 'G' )    /* NO SPS OR GEN
    ESCAPE TOP
  END-IF
  MOVE ST-V.MILITARY-STATUS TO #MIL-STATUS
*
  if #ADD-LINE-1 = ' '                                                          /* NG1 END
    ADD 1 TO #NO-ADDR
    WRITE (2) #NO-ADDR ST-V.ID-NUMBER NAME 'No Address'
  END-IF
*
  IF   (ST-V.PROCESS-IND = 'G')      /* G/F    DW2
      AND (ST-V.ID-NUMBER LT 106030)
    MOVE TRUE TO #G-F
  ELSE
    RESET #G-F
  END-IF
*
**  IF ST-V.ZIP-CODE = 0                                   /* vt1
  IF #ADD-ZIP-CODE = 0                                     /* VT1
    MOVE 1 TO #ADDR-CODE-X  /* Foreign
  ELSE
    v_A := *TRIM(#ADD-CITY)                                             /* bz OI-1758
    v_A_Length := *LENGTH(v_A)                                          /* bz OI-1758
    IF ( #ADD-CITY = MASK ('APO') OR = MASK ('FPO') OR = MASK ('DPO') ) /* PM1
       AND *Length(v_A) = 3                                             /* bz OI-1758
       
      MOVE 2 TO #ADDR-CODE-X    /* APO'S
    ELSE
      IF #ADD-STATE = 'AK' OR = 'HI' OR = 'PR' OR = 'GU' OR = 'AS'
          OR = 'MH' OR = 'MP' OR = 'PW' OR = 'VI'
        MOVE 3 TO #ADDR-CODE-X  /* special states
      ELSE
        MOVE 4 TO #ADDR-CODE-X   /* 48 states
      END-IF
    END-IF
  END-IF
*
  IF ST-V.ANNUAL-RPT-FLAG = 'F'
    MOVE 1 TO #AR-X  /* Full REport
    MOVE ST-V.ANNUAL-RPT-FLAG TO #ANN-RPT-FLAG      /* DW2
  ELSE
    IF ST-V.ANNUAL-RPT-FLAG = 'S'
      MOVE 2 TO #AR-X  /* Summary Rpt
      MOVE ST-V.ANNUAL-RPT-FLAG TO #ANN-RPT-FLAG      /* DW2
    ELSE
      MOVE 3 TO #AR-X  /* No report
      MOVE 'N' TO #ANN-RPT-FLAG                       /* DW2
    END-IF
  END-IF
*
  IF #G-F                                            /* DW2
    ADD 1 TO #ANN-RPT-CNT-GF (#AR-X, #ADDR-CODE-X)
  ELSE
    ADD 1 TO #ANN-RPT-CNT-IP (#AR-X, #ADDR-CODE-X)
  END-IF
*
  ADD 1 TO #EXTRACTS
*
* IF #EXTRACTS GE 2149
*   ESCAPE BOTTOM
* END-IF
*
** RESET #DISPL #RANK-LITERAL #HOLD-RANK-5                         /* PM1   vt1 \/
**  CALLNAT 'GRANKSXX' #PASS-COMMAND ST-V.RANK MILITARY-SERVICE
**    #EDIT-INVALID #DISPL #RANK-LITERAL #HOLD-RANK-5
**  MOVE #RANK-LITERAL TO #FULL-RANK
*
* DISPLAY #DISPL #RANK-LITERAL #HOLD-RANK-5 MILITARY-SERVICE
*
  RESET #FIRST-NAME  #MIDDLE-NAME #LAST-NAME  #SUFFIX #RETIRED  #NAME-F  /* YK1  VT1
    #STREET #STREET-2
*
  MOVE ST-V.ID-NUMBER TO #CGA-SCR-ID
  IF WIDOW-FLAG = 'Y'
    MOVE ST-V.SPOUSE-CONTACT-ID TO #CONTACT-ID
    #NAME-F := FUNCTION-FRM-NAME(<#CONTACT-ID,#FIRST-NAME,#MIDDLE-NAME,#LAST-NAME,#SUFFIX>)
    MOVE TRUE TO #USE-SPS-GEN-INFO
    CALLNAT 'G3500SAD' #CGA-MASTER #PDA-AREA-G3500AAD
    #STREET      := #EXT-STREET
    #STREET-2    := #EXT-STREET-2
    #CITY        := #EXT-CITY
    #STATE       := #EXT-STATE
*
**   nedd to build the #formated-name with spouse-name
**    SEPARATE NAME-SP LEFT INTO #LAST-NAME #FIRST/MID
**      #SUFFIX #EXTRA1 #EXTRA2 WITH DELIMITER ','
**    SEPARATE #FIRST/MID INTO #FIRST-NAME #MIDDLE-INIT #EXTRA1
**      #EXTRA1 #EXTRA2 #EXTRA3 #EXTRA4
**      WITH DELIMITER ' '
**    COMPRESS TITLE-SP #FIRST/MID #LAST-NAME INTO #FORMATED-NAME
**    MOVE TITLE-SP TO #HOLD-RANK-5

  ELSE
    MOVE ST-V.MEMBER-CONTACT-ID TO #CONTACT-ID
    #NAME-F := FUNCTION-FRM-NAME(<#CONTACT-ID,#FIRST-NAME,#MIDDLE-NAME,#LAST-NAME,#SUFFIX>)
    RESET #USE-SPS-GEN-INFO
    CALLNAT 'G3500SAD' #CGA-MASTER #PDA-AREA-G3500AAD
    #STREET :=  #EXT-STREET
    #STREET-2 := #EXT-STREET-2
    #CITY        := #EXT-CITY
    #STATE       := #EXT-STATE
*
**  nedd to build the #formated-name with member name
**    SEPARATE ST-V.NAME LEFT INTO #LAST-NAME #FIRST/MID
**      #SUFFIX #EXTRA1 #EXTRA2 WITH DELIMITER ','
**    SEPARATE #FIRST/MID INTO #FIRST-NAME #MIDDLE-INIT
**      #EXTRA1 #EXTRA2 #EXTRA3 #EXTRA4
**      WITH DELIMITER ' '
*
**    IF CHIEF-OF-STAFF-IND = 'R' OR = 'Q' /* INDS RANK SECURITY
**        OR ST-V.INTRO-FLAG = 'S' OR = 'K' OR = 'G'
**      RESET #HOLD-RANK-5
**    END-IF
*
**    COMPRESS #HOLD-RANK-5 #FIRST/MID #LAST-NAME INTO #FORMATED-NAME
  END-IF
*
**  IF #SUFFIX NE ' '
**    COMPRESS #FORMATED-NAME ',' INTO #FORMATED-NAME LEAVING NO
**    COMPRESS #FORMATED-NAME #SUFFIX INTO #FORMATED-NAME
**  END-IF                                                                /* vt1 /\
*
**  IF #FULL-RANK = ' '                                 /* vt1
  if #ext-rank = ' '                                    /* vt1
    COMPRESS #EXT-FORMATED-NAME TO #DEAR-NAME                   /* vt1
  ELSE
    compress #ext-rank #last-name into #dear-name         /* vt1
*    COMPRESS #FULL-RANK #LAST-NAME INTO #DEAR-NAME       /* vt1
  END-IF
*
  IF  (#MIL-STATUS = 'R')
      AND (CHIEF-OF-STAFF-IND NE 'X')  /* recalled to act duty
      AND (NOT ST-V.RANK = 'MR' OR = 'MS' OR = 'MRS' OR = 'MIS'
      OR = 'REV' OR = 'DR' OR = ' ')
      AND (WIDOW-FLAG = ' ')     /* NOT RET ON WIDOWS
**    COMPRESS #FORMATED-NAME ', RET' INTO #FORMATED-NAME LEAVING NO
    #RETIRED := 'RET'               /* yk1
  END-IF
*
  RESET
    #HOME-PHONE
    #WORK-PHONE
    #FAX-PHONE
    #INTERNET-ADDR
    #rank-n                                                             /* vt1 \/
    #contact-id-r
*
  FIND (1) CONT WITH CONT.ID-NUMBER = ST-V.ID-NUMBER
    IF NO
      ESCAPE BOTTOM
    END-NOREC
    MOVE CONT.CONTACT-ID TO #CONTACT-ID-R
  END-FIND
*
  CALLNAT 'RANKN001' #PDA-RANK
  #RANK-N := #RANK-ABBR
*
  reset #phones(*)
*  move 'H' to #code(1)
  callnat 'Phonen1m' #contact-id #phones(*) #ret-code
  examine #phone-type(*) for 'Home' giving #idx
  if #idx ne 0
    #home-phone := #phone(#idx)
    examine #home-phone for '(' delete
    examine #home-phone for ')' delete
    examine #home-phone for '-' delete
  else
    #home-phone := '0'
  end-if
  examine #phone-type (*) for 'Business' giving index #idx1
  if #idx1 ne 0
    move #phone(#idx1) to #work-phone
    examine #work-phone for '(' delete
    examine #work-phone for ')' delete
    examine #work-phone for '-' delete
  else
    #work-phone := '0'
  end-if
  examine #phone-type(*) for 'Fax' giving index #idx2
  if #idx2 ne 0
    move #phone(#idx2) to #fax-phone
    examine #fax-phone for '(' delete
    examine #fax-phone for ')' delete
    examine #fax-phone for '-' delete
  else
    #fax-phone := '0'
  end-if
*
  #INTERNET-ADDR := get-EML(< #CONTACT-ID >)  /* bz OI-1758
*
  IF #COUNTRY-CODE NE 'US'         /* NG1
    #GEN-KEY := 'COUN'
    #SUB-KEY := #COUNTRY-CODE
    FIND (1) CNRY WITH SEC-KEY = #TABLE-KEY
      #CITY := CNRY.GEN-DESCRIPTION
    END-FIND
    RESET #STATE
  END-IF
*                                                                 /* vt1  /\
  #ZIP := DISPLAY-ZIP (< #EXT-ZIP >)            /* NG1
  COMPRESS #EXT-FORMATED-NAME        /* FULL FORMATED NAME (FOR MAILIMGS)  /*
    #TAB #STREET
    #TAB #STREET-2
    #TAB #CITY
    #TAB #STATE
    #TAB #ZIP
**  #TAB ST-V.ZIP-CODE-5-A                                           /* vt1
**  #tab #zip-code-5-a                                               /* vt1  NG1
    INTO #REC-OVERFLOW LEAVING NO
**  IF ST-V.ZIP-CODE-4 NE 0                                          /* vt1 \/
**        COMPRESS #REC-OVERFLOW '-' ST-V.ZIP-CODE-4-A
**          INTO) #REC-OVERFLOW LEAVING NO
*   if   #zip-code-4 ne 0
*     COMPRESS #REC-OVERFLOW '-' #zip-code-4-a
*       INTO  #REC-OVERFLOW LEAVING NO                                 /* vt1 /\
*   END-IF
  MOVE EDITED SSN (EM=999999999) TO #SSN-a        /* yk1                /* vt1
  COMPRESS #REC-OVERFLOW
    #TAB ST-V.ID-NUMBER
    #TAB #SSN-a                   /* yk1                                 /* vt1 \/
*    #TAB RANK
    #tab #rank-n                                                         /* vt1 /\
    #TAB ST-V.MILITARY-SERVICE /* PM2
    #TAB #INTERNET-ADDR
    #TAB #HOME-PHONE
    #TAB #WORK-PHONE
    #TAB #FAX-PHONE
    #TAB #ANN-RPT-FLAG         /* DW2
    #TAB #FIRST-NAME           /* yk1
*  #TAB #MIDDLE-INIT          /* yk1                                /* vt1
    #TAB #MIDDLE-NAME                                                 /* vt1
    #TAB #LAST-NAME            /* yk1
    #TAB #SUFFIX               /* yk1
    #TAB #RETIRED              /* yk1

    INTO #REC-OVERFLOW LEAVING NO
*
*  below to use raw address 1/2/3 instead of above
*    #TAB ST-V.ADDRESS-1 #TAB ST-V.ADDRESS-2 #TAB ST-V.ADDRESS-3
*    #TAB ST-V.ZIP-CODE-5-A INTO #REC-OVERFLOW LEAVING NO
* IF ST-V.ZIP-CODE-4 NE 0
*    COMPRESS #REC-OVERFLOW '-' ST-V.ZIP-CODE-4-A
*                               INTO #REC-OVERFLOW LEAVING NO
* end-if
*
* MOVE #LAST-NAME TO #HOLD-LAST-NAME
* PERFORM UPPER-LOWER
*
* IF #FULL-RANK = ' '
*   COMPRESS #FORMATED-NAME TO #DEAR-NAME
* ELSE
*   COMPRESS #FULL-RANK #HOLD-LAST-NAME INTO #DEAR-NAME
* END-IF
*  COMPRESS #REC-OVERFLOW
*       #TAB DATE-LAST-ADDR-UPDT
*            INTO #REC-OVERFLOW LEAVING NO
*  COMPRESS #REC-OVERFLOW
*       #TAB #HAS-SGLI
*       #TAB #HAS-VGLI
*            INTO #REC-OVERFLOW LEAVING NO
* COMPRESS #REC-OVERFLOW
*      #tab #DEAR-NAME
*           INTO #REC-OVERFLOW LEAVING NO
* MOVE ST-V.ISSUE-DATE (1) TO #YYYYMMDD
* COMPRESS #REC-OVERFLOW
*   #tab #MM-A '/' #DD-A '/'#YYYY-A
*     #tab ST-V.APPL-SOURCE
*     #tab #USER-SOURCE
*     #tab #DATE-RECEIVED
*       INTO #REC-OVERFLOW LEAVING NO
*
* COMPRESS #REC-OVERFLOW '~' INTO #REC-OVERFLOW LEAVING NO
* MOVE #REC-OVERFLOW TO #EXTRACT-150
* BELOW TO DO UNCOMPRESSESD FILE
  MOVE #REC-OVERFLOW TO #EXTRACT-250
*
*  below to split to output file by ann report group
*
  IF #AR-X = 1    /* full report
    IF #ADDR-CODE-X = 4 /* 48 states
      IF #G-F                                      /* DW2
        WRITE WORK FILE 1 #EXTRACT-250  /* G/F Full RPT 48 States
      ELSE
        WRITE WORK FILE 10 #EXTRACT-250 /* INS/PLUS Full RPT 48 States
      END-IF
    ELSE
      IF #ADDR-CODE-X = 2 OR = 3  /* apos & territories
        IF #G-F                                      /* DW2
          WRITE WORK FILE 2 #EXTRACT-250 /* G/F Full RPT APO's & Territories
        ELSE
          WRITE WORK FILE 11 #EXTRACT-250 /* INS/PLUS Full RPT APO's & Territories
        END-IF
      ELSE                        /* Foreign
        IF #G-F                                      /* DW2
          WRITE WORK FILE 3 #EXTRACT-250 /* G/F Full RPT Foreigns
        ELSE
          WRITE WORK FILE 12 #EXTRACT-250 /* INS/PLUS Full RPT Foreigns
        END-IF
      END-IF
    END-IF
  ELSE
    IF #AR-X = 3    /* no report
      IF #ADDR-CODE-X = 4 /* 48 states
        IF #G-F                                      /* DW2
          WRITE WORK FILE 4 #EXTRACT-250  /* G/F NO RPT 48 States
        ELSE
          WRITE WORK FILE 13 #EXTRACT-250 /* INS/PLUS NO RPT 48 States
        END-IF
      ELSE
        IF #ADDR-CODE-X = 2 OR = 3  /* apos & territories
          IF #G-F                                      /* DW2
            WRITE WORK FILE 5 #EXTRACT-250 /* G/F NO RPT APO's & Territories
          ELSE
            WRITE WORK FILE 14 #EXTRACT-250 /* INS/PLUS NO RPT APO's & Territories
          END-IF
        ELSE                        /* Foreign
          IF #G-F                                      /* DW2
            WRITE WORK FILE 6 #EXTRACT-250 /* G/F NO RPT Foreigns
          ELSE
            WRITE WORK FILE 15 #EXTRACT-250 /* INS/PLUS NO RPT Foreigns
          END-IF
        END-IF
      END-IF
    ELSE /* ar-x 2 (summary report)
      IF #ADDR-CODE-X = 4 /* 48 states
        IF #G-F                                      /* DW2
          WRITE WORK FILE 7 #EXTRACT-250  /* G/F SUMMARY RPT 48 States
        ELSE
          WRITE WORK FILE 16 #EXTRACT-250 /* INS/PLUS SUMMARY RPT 48 States
        END-IF
      ELSE
        IF #ADDR-CODE-X = 2 OR = 3  /* apos & territories
          IF #G-F                                      /* DW2
            WRITE WORK FILE 8 #EXTRACT-250 /* G/F SUMMARY RPT APO's & Territories
          ELSE
            WRITE WORK FILE 17 #EXTRACT-250 /* INS/PLUS SUMMARY RPT APO's & Territories
          END-IF
        ELSE                        /* Foreign
          IF #G-F                                      /* DW2
            WRITE WORK FILE 9 #EXTRACT-250 /* G/F SUMMARY RPT Foreigns
          ELSE
            WRITE WORK FILE 18 #EXTRACT-250 /* INS/PLUS SUMMARY RPT Foreigns
          END-IF
        END-IF
      END-IF
    END-IF
  END-IF
*
* WRITE WORK FILE 1 #EXTRACT-250
  ADD 1 TO #NUM-RECS
*
END-READ /* (0322)
*
WRITE (2) 'NUMBER MEMBERS  = ' #EXTRACTS
WRITE (2) 'NUMBER RECORDS  = ' #NUM-RECS
WRITE (2) 'Num No Addresss=' #NO-ADDR
*
WRITE (1) '1=Foreign/2=APO"s/ 3=Territories/4=48 states'
WRITE (1) 'APO"s and Territories are combined on the same file'
WRITE (1) '     Grandfathered      Ins/Plus'
FOR #I1 1 TO 3
  IF #I1 = 1
    WRITE (1) 'Full Report Counts'
  ELSE
    IF #I1 = 2
      WRITE (1) 'Summary Report Counts'
    ELSE
      WRITE (1) 'NO Report Counts'
    END-IF
  END-IF
*
  FOR #I2 1 TO 4
    DISPLAY (1) #I2 #ANN-RPT-CNT-GF (#I1, #I2) #ANN-RPT-CNT-IP (#I1, #I2)
  END-FOR
END-FOR
*
*
* * * * * * * * * * *
DEFINE UPPER-LOWER
* * * * * * * * *
*
FOR #I1 2 TO 25
  FOR #I2 1 TO 26
    IF #HOLD-LAST-NAME-A (#I1) = #UPPER (#I2)
      MOVE #LOWER (#I2) TO #HOLD-LAST-NAME-A (#I1)
    END-IF
  END-FOR
END-FOR
*
END-SUBROUTINE
*
END
