* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 5
* <Natural Source Header
*
******** CONVERTED TO NATURAL BY SOFTWARE AG ON 14/09/05 ********
*
* COMPOPT:RENT,RES,OPT
* LINKOPT:RENT,AMODE=31,RMODE=ANY
*  PROGRAM-ID.    ATHP10P1.
* AUTHOR.        PAUL C MCDONALD.
* DATE-COMPILED.  TODAY.
* REMARKS.                            VERSION 10.7
*        10.1   $ RECORD
*        10.2   FORMAT CHANGE
*        10.3   PRINT ANOTHER 435 LINE AND ADD TO ACCUMS
*                 FOR INT-RECEIVED                   VAN 061677
*        10.4   PRINT COMPOSITE-INTEREST-RATE WHEN
*                 CHANGED.                           DRW 122079
*        10.5   MAKE POSSIBLE TRAN CODE 434 WHICH IS
*                 PREM PMT WITH CAP AMT UPDATE       DRW 031080
*        10.6   ADD CODE TO BYPASS ACTING TOTAL PAGE PROCESSING
*                 PARM IN DRIVER MUST BE  =  2 EAR 112880
*        10.7   PREVENT OVERLAP BETWEEN 2 FICHE OF ONE MEMBERS
*                 ACTIVITY HISTORY                    DRW 011381
*        10.8   CHANGED REPORT HEADER FOR NEW NAME    CVA 042287
*        88.1   NATURAL CONVERSION CHANGES TO 'TIN1' FORMAT
*        88.2   ADD AIP PROCESSING IMPROVE STRUCTURE  DRW 111788
*        89.1   CALL WAASDATE                         DRW 020689
*        91.1   ADD EZ-PAY ACCOUNTING                 DRW 082191
*  DW1  08162005  ADD TRLOG DESCRIPTION TO FICHE
*    SKIP2
*            SUBPROGRAM TO FORMAT ACCOUNTING REGISTER.
*            THIS SUBPROGRAM IS CALLED INTO THE COMPUTER
*            BY M10A0, THE MAIN LINE PROGRAM.  ALL FORMATTING
*            OF PRINT LINES AND ACCUMULATING OF TOTALS IS
*            DONE BY THIS SUBPROGRAM.  ALL I/O INSTRUCTIONS ARE
*            LOCATED IN THE MAIN PROGRAM.
*            AN ACTION CODE IS PASSED BETWEEN THE MAIN PROGRAM
*            AND THIS SUBPROGRAM FOR COMMUNICATING BACK AND
*            FORTH.  ALSO, THE PRINT TAPE RECORD AND THE FORMATTED
*            PRINTER LINE ARE PASSED.
*
******************** MODIFICATIONS ************************************
* Converted to Natural by SAGUK ( UKCGC ) on 14/09/05
***********************************************************************
** Tag     Date    Who    Details
** SAG  12/20/2005 RH1 AB - reset work file # to 7 for job submission
**                in context of being called from ATHP10P0
** RHC  02/06/2006 SAG-AB Replaced PDA with GDA and Callnats with Fetches to
**                 programs that were formerly Cobol calls.
** SAG-AB 20060811 Rerouting end processes of TEST-ACCT-NO
* bz  06/09/2013  Rebranding (Search for AAFMAA)
******************************************************************
DEFINE DATA
**                  RHC  02/06/2006 SAG-AB START
GLOBAL USING ATHG10P0
**01 MICRO-RESPONSE                   (A3)
**01 TIN1
**  02 TIN1-SECT                      (A1)
**  02 TIN1-ACCT                      (A3)
**  02 TIN1-ID-9                      (A9)
**  02 REDEFINE TIN1-ID-9
**    03 FILLER-79                    (A2)
**    03 TIN1-ID                      (A7)
**  02 TIN1-DATE                      (A6)
**  02 TIN1-TRAN                      (A4)
**  02 TIN1-COL                       (A1)
**  02 TIN1-NAME                      (A25)
**  02 FILLER-80                      (A1)
**  02 TIN1-CERT                      (A5)
**  02 TIN1-ACCTNO                    (A3)
**  02 TIN1-LTRANDT                   (A6)
**  02 TIN1-DEBIT                     (N7.2)
**  02 REDEFINE TIN1-DEBIT
**    03 TIN1-DR                      (A9)
**  02 TIN1-CREDIT                    (N7.2)
**  02 REDEFINE TIN1-CREDIT
**    03 TIN1-CR                      (A9)
**  02 TIN1-REF                       (A10)
**  02 TIN1-DESC                      (A20)
**  02 REDEFINE TIN1-DESC
**    03 TIN1-DSC1                    (A3)
**    03 FILLER-81                    (A1)
**    03 TIN1-INTRT                   (A5)
**    03 FILLER-82                    (A11)
**  02 TIN1-MSG                       (A1)
**  02 TIN1-PROCESS-DATE              (A6)
**  02 FILLER-83                      (A4)
**  02 TIN1-AALP-CD                   (A1)
**  02 TIN1-CLERK                     (A4)
**  02 TIN1-TRDATE                    (A6)
**  02 TIN1-TRTIME                    (A6)
**  02 TIN1-TERMINAL                  (A4)
**  02 FILLER-84                      (A140)
**01 POUT1                            (A133)
**01 REDEFINE POUT1
**  02 POUT1-CC                       (A1)
**  02 POUT1-DATA                     (A132)
**01 COMMUN1
**  02 ACT-CODE                       (A1)
**  02 RUN-DATE                       (A8)
**  02 REDEFINE RUN-DATE
**    03 RD-MM                        (N2)
**    03 RD-DD                        (N2)
**    03 RD-YYYY                      (N4)
**  02 RUN-ORDER                      (A1)
**01 LINK-WORD
**  02 FRAME-COUNT                    (P4)
**  02 FICHE-COUNT                    (P4)
**  02 MAX-FICHE                      (P4)
**  02 MAX-LINES                      (P4)
**  02 LINE-COUNT                     (P4)
**  02 FRAME-KEY                      (A25)
**  02 TITLE-OPTION                   (A1)
**  02 MF-TITLE                       (A32)
**  02 TITLE-UP                       (N1)
**  02 ADVANCE-CODE                   (A2)
**  02 PRINT-LINE
**    03 PL-CC                        (A1)
**    03 PL-DATA                      (A132)
**  02 FZ-ACTION-SW                   (N1)
**01 ACTNG-REG
**  02 ACT-SUM-PROC                   (N1)
**01 GO-CODE                          (P2)
**                          RHC  02/06/2006 SAG-AB END
**************************************************************************
LOCAL
*
01 AC-TOT-LINE                      (A133)
01 PAN-VALET                        (A24) INIT <'003ATHP10P1  03/24/89'>
**                          RHC  02/06/2006 SAG-AB  START
**01 XXX-CNT                          (P9)
**01 PRT-X                            (P1)
**01 INDEX1                           (P2) INIT <1>
**01 AC1-RCT                          (P9.2)
**01 AC1-INT                          (P9.2)
**01 AC1-DIS                          (P9.2)
**01 ACDEBIT                          (P7.2)
**01 ACCREDIT                         (P7.2)
**01 AC1-JI                           (P7.2)
**01 AC1-L                            (P7.2)
**01 LINE-CT                          (P2) INIT <66>
**01 MAX-LINE                         (P2) INIT <54>
**01 LAST-CN                          (A7)
**01 FICH-PAGE-CT                     (P5)
**01 PAGE-CT                          (P5)
**01 HD-ACCTNO                        (A3)
**01 HD-DRCR                          (N7.2)
**01 ETI-PRINC                        (P7.2)
**01 APL-PRINC                        (P7.2)
**01 APL-PREM                         (P7.2)
**01 APL-INT-CAP                      (P7.2)
**01 ALP-PRINC                        (P7.2)
**01 AIP-INT                          (P7.2)
**01 ELP-PRINC                        (P7.2)
**01 EIP-INT                          (P7.2)
**01 EZPAY-PREMS                      (P7.2)
**01 TOTS                             (A1)
*
*****************************************************************
* W O R K - A R E A - F C O B O L *
*****************************************************************
*
**01 WORK-AREA-FCOBOL
**  02 FILLER-1(25)
**    03 AC1-ACC                      (P9.2)
**  02 FILLER-2(25)
**    03 AC1-REJ                      (P9.2)
**                          RHC  02/06/2006 SAG-AB  END
01 CTL-NAMES
  02 FILLER-3                       (A13) INIT <'PAYMENT'>
  02 FILLER-4                       (A13) INIT <'NEW LOAN'>
  02 FILLER-5                       (A13) INIT <'ADDL LOAN'>
  02 FILLER-6                       (A13) INIT <'CAPITALIZED'>
  02 FILLER-7                       (A13) INIT <'ADJUSTMENTS'>
  02 FILLER-8                       (A13) INIT <'NET CHANGE'>
  02 FILLER-9                       (A13) INIT <'.'>
  02 FILLER-10                      (A13) INIT <'PAYMENT'>
  02 FILLER-11                      (A13) INIT <'ADDL LOAN'>
  02 FILLER-12                      (A13) INIT <'CAPITALIZED'>
  02 FILLER-13                      (A13) INIT <'ADJUSTMENTS'>
  02 FILLER-14                      (A13) INIT <'NET CHANGE'>
  02 FILLER-15                      (A13) INIT <'.'>
  02 FILLER-16                      (A13) INIT <'.'>
  02 FILLER-17                      (A13) INIT <'ADJUSTMENT'>
  02 FILLER-18                      (A13) INIT <'PAYMENT'>
  02 FILLER-19                      (A13) INIT <'REVERSAL'>
  02 FILLER-20                      (A13) INIT <'PAYMENT'>
  02 FILLER-21                      (A13) INIT <'REVERSAL'>
  02 FILLER-22                      (A13) INIT <'STARTS'>
  02 FILLER-23                      (A13) INIT <'STOPS'>
  02 FILLER-24                      (A13) INIT <'STARTS'>
  02 FILLER-25                      (A13) INIT <'ADJUSTMENTS'>
  02 FILLER-26                      (A13) INIT <'DEBITS'>
  02 FILLER-27                      (A13) INIT <'CREDITS'>
01 REDEFINE CTL-NAMES
  02 CS-NAM                         (A13/25)
*
*****************************************************************
* L I N E - 1 *
*****************************************************************
*
01 LINE1
  02 LINE1-CC                       (A1)
  02 LINE1-ID                       (A7)
  02 FILLER-28                      (A2)
  02 LINE1-NAME                     (A25)
  02 FILLER-29                      (A1)
  02 LINE1-CLERK                    (A4)
  02 FILLER-30                      (A1)
  02 LINE1-DESC
    03 FILLER-31                    (A4)
    03 LINE1-DSC-REMAIN
      04 FILLER-32                  (A2)
      04 LINE1-INTRT                (A5)
    03 FILLER-33                    (A9)
  02 REDEFINE LINE1-DESC
    03 LINE1-DESC/ALPHA             (A20)
  02 FILLER-34                      (A1)
  02 LINE1-PROCESS-DATE             (A6)
  02 FILLER-35                      (A1)
  02 LINE1-TIME                     (A4)
  02 FILLER-36                      (A1)
  02 LINE1-DATE                     (A8)
  02 FILLER-37                      (A1)
  02 LINE1-LTRANDT                  (A8)
  02 FILLER-38                      (A1)
* 02 LINE1-DEBIT                    (N7.2) (EM=Z,ZZZ,ZZ9.99-)  /* EDS 08/23/2006
  02 LINE1-DEBIT                    (A13)                      /* EDS 08/23/2006
  02 FILLER-39                      (A1)
* 02 LINE1-CREDIT                   (N7.2) (EM=Z,ZZZ,ZZ9.99-)  /* EDS 08/23/2006
  02 LINE1-CREDIT                   (A13)                      /* EDS 08/23/2006
  02 FILLER-40                      (A1)
  02 LINE1-TRCD                     (A4)
  02 FILLER-41                      (A1)
  02 LINE1-MSG                      (A8)
01 REDEFINE LINE1
  02 LINE1/ALPHA                    (A133)                     /* EDS 08/31/2006
* 02 LINE1/ALPHA                    (A125)                     /* EDS 08/31/2006
*
*****************************************************************
* L I N E 2 *
*****************************************************************
*
01 LINE2
  02 FILLER-42                      (A83) INIT <'-'>
**02 FILLER-42                      (A79) INIT <'-'>           /* SAG-AB 20060821
**02 FILLER-43                      (A9) INIT <'TOTAL'>        /* SAG-AB 20060823
  02 FILLER-43                      (A7) INIT <'TOTAL'>        /* SAG-AB 20060823
**02 LN2-DEBIT                      (N7.2) (EM=Z,ZZZ,ZZ9.99)   /* SAG-AB 20060821
**02 LN2-DEBIT                      (N9.2) (EM=ZZZ,ZZZ,ZZ9.99) /* SAG-AB 20060821
  02 LN2-DEBIT                      (A14)                      /* EDS    08232006
**02 FILLER-44                      (A2)                       /* SAG-AB 20060831
**02 LN2-CREDIT                     (N7.2) (EM=Z,ZZZ,ZZ9.99)   /* SAG-AB 20060821
**02 LN2-CREDIT                     (N9.2) (EM=ZZZ,ZZZ,ZZ9.99) /* SAG-AB 20060821
  02 LN2-CREDIT                     (A14)                      /* EDS    08232006
01 REDEFINE LINE2
**02 LINE2/ALPHA                    (A112)                     /* SAG-AB 20060908
  02 LINE2/ALPHA                    (A118)                     /* SAG-AB 20060908
01 LINE5
  02 FILLER-45                      (A4)
  02 LN5-NAM                        (A13)
  02 LN5-AMT1                       (N9.2) (EM=ZZZ,ZZZ,ZZ9.99-)
  02 FILLER-46                      (A5)
  02 LN5-AMT2                       (N9.2) (EM=ZZZ,ZZZ,ZZ9.99-)
  02 FILLER-47                      (A5)
  02 LN5-AMT3                       (N9.2) (EM=ZZZ,ZZZ,ZZ9.99-)
01 REDEFINE LINE5
  02 LINE5/ALPHA                    (A60)
01 LINE6
  02 FILLER-48                      (A17) INIT <'0'>
  02 LN6-AMT1                       (N9.2) (EM=ZZZ,ZZZ,ZZ9.99-)
  02 FILLER-49                      (A5)
  02 LN6-AMT2                       (N9.2) (EM=ZZZ,ZZZ,ZZ9.99-)
  02 FILLER-50                      (A5)
  02 LN6-AMT3                       (N9.2) (EM=ZZZ,ZZZ,ZZ9.99-)
01 REDEFINE LINE6
  02 LINE6/ALPHA                    (A60)
01 LINE7
  02 FILLER-51                      (A41) INIT <'0ADJUST FROM INT PMTS TO PRIN PMTS'>
  02 LN7-AMT                        (N7.2) (EM=Z,ZZZ,ZZ9.99-)
01 REDEFINE LINE7
  02 LINE7/ALPHA                    (A50)
01 LINE8
  02 FILLER-52                      (A41) INIT <'0ADJUST PRINCIPAL BALANCE BY'>
  02 LN8-AMT                        (N7.2) (EM=Z,ZZZ,ZZ9.99-)
01 REDEFINE LINE8
  02 LINE8/ALPHA                    (A50)
*
*****************************************************************
* L I N E 9 A *
*****************************************************************
*
01 LINE9A
  02 FILLER-53                      (A41) INIT <'0ADJUST PRIN BALANCE BY APL INT CAP. AMT'>
  02 LINE9A-AMT                     (N7.2) (EM=Z,ZZZ,ZZZ.99-)
01 REDEFINE LINE9A
  02 LINE9A/ALPHA                   (A50)
01 LINE9
  02 FILLER-54                      (A41) INIT <'0ADJUST PRINCIPAL BALANCE BY APL AMOUNT'>
  02 LN9-AMT                        (N7.2) (EM=Z,ZZZ,ZZ9.99-)
01 REDEFINE LINE9
  02 LINE9/ALPHA                    (A50)
01 LINE10
  02 FILLER-55                      (A21) INIT <'0APL PREMM AMOUNT OF'>
  02 LN10-AMT1                      (N7.2) (EM=ZZZZZZZ.99-)
  02 FILLER-56                      (A44) INIT <' DOES NOT BALANCE WITH APL LOAN AMOUNT OF'>
  02 LN10-AMT2                      (N7.2) (EM=ZZZZZZZ.99-)
  02 FILLER-57                      (A26) INIT <' PROGRAM ERROR.  CALL EDS.'>
01 REDEFINE LINE10
  02 LINE10/ALPHA                   (A109)
01 LINE11
  02 FILLER-58                      (A41) INIT <'0ADJUST PRINCIPAL BALANCE BY ETI AMOUNT'>
  02 LN11-AMT1                      (N7.2) (EM=Z,ZZZ,ZZZ.99-)
01 REDEFINE LINE11
  02 LINE11/ALPHA                   (A50)
01 LINE12
  02 FILLER-59                      (A41) INIT <'0ADJUST PRINCIPAL BALANCE BY ALP AMOUNT'>
  02 LN12-AMT1                      (N7.2) (EM=Z,ZZZ,ZZZ.99-)
01 REDEFINE LINE12
  02 LINE12/ALPHA                   (A50)
01 LINE13
  02 FILLER-60                      (A41) INIT <'0ADJUST ACCRUED INTEREST BY AIP AMOUNT'>
  02 LN13-AMT1                      (N7.2) (EM=Z,ZZZ,ZZZ.99-)
01 REDEFINE LINE13
  02 LINE13/ALPHA                   (A50)
01 LINE14
  02 FILLER-61                      (A41) INIT <'0ADJUST PRINCIPAL BALANCE BY ELP AMOUNT'>
  02 LN14-AMT1                      (N7.2) (EM=Z,ZZZ,ZZZ.99-)
01 REDEFINE LINE14
  02 LINE14/ALPHA                   (A50)
01 LINE15
  02 FILLER-62                      (A41) INIT <'0ADJUST ACCRUED INTEREST BY EIP AMOUNT'>
  02 LN15-AMT1                      (N7.2) (EM=Z,ZZZ,ZZZ.99-)
01 REDEFINE LINE15
  02 LINE15/ALPHA                   (A50)
01 LINE16
  02 FILLER-63                      (A41) INIT <'0EZ-PAY PREMIUM PAYMENTS'>
  02 LN16-AMT1                      (N7.2) (EM=Z,ZZZ,ZZZ.99-)
01 REDEFINE LINE16
  02 LINE16/ALPHA                   (A50)
*
*****************************************************************
* H D G 1 *
*****************************************************************
*
01 HDG1
  02 FILLER-64                      (A38) INIT <'1'>
  02 FILLER-65                      (A86) INIT <'AAFMAA'>
  02 FILLER-66                      (A4) INIT <'PAGE'>
**02 HDG1-PG                        (N5)                  /* EDS 08/23/2006
  02 HDG1-PG                        (A5)                  /* EDS 08/23/2006
01 REDEFINE HDG1
  02 HDG1/ALPHA                     (A133)
**01 HDG2                                          SAG-AB 20060822 REMOVED TO GLOBAL
**  02 FILLER-67                      (A43)
**  02 FILLER-68                      (A24) INIT <'ACCOUNTING REGISTER  -'>
**  02 HDG2-ORDER                     (A13)
**  02 FILLER-69                      (A13) INIT <'      AS OF'>
**  02 HDG2-DATE                      (A10)
**  02 REDEFINE HDG2-DATE
**    03 HD-MM                        (N2)
**    03 HD-X1                        (A1)
**    03 HD-DD                        (N2)
**    03 HD-X2                        (A1)
**    03 HD-YYYY                      (N4)
**01 REDEFINE HDG2
**  02 HDG2/ALPHA                     (A103)
01 HDG3
  02 FILLER-70                      (A36) INIT <'0   ID'>
  02 FILLER-71                      (A4) INIT <'CLRK'>
  02 FILLER-72                      (A22)
  02 FILLER-73                      (A7) INIT <'TRANS'>
  02 FILLER-74                      (A6) INIT <'TRANS'>
  02 FILLER-75                      (A22) INIT <'CURRENT   PRIOR'>
  02 FILLER-76                      (A36) INIT <'DEBIT         CREDIT   TRAN'>
01 REDEFINE HDG3
  02 HDG3/ALPHA                     (A133)
01 HDG4
  02 FILLER-77                      (A75) INIT <' NUMBER             NAME                 DESCRIPTION          DATE   TIME'>
  02 FILLER-78                      (A59) INIT <'DATE      DATE        AMOUNT        AMOUNT   CODE  MSG'>
01 REDEFINE HDG4
  02 HDG4/ALPHA                     (A134)
01 HDG5                             (A35) INIT <'1M10A0   ACCOUNTING REGISTER TOTALS'>
01 HDG6                             (A69) INIT <'0                     ACCEPTED            REJECTED              TOTAL'>
01 HDG7                             (A73) INIT <'0                     RECEIPTS           INT TRAN           DISBURSEMENTS'>
*
*****************************************************************
* T I N 1 - D R - - Q 0 0 0 *
*****************************************************************
*
01 NUM                              (A9)
01 REDEFINE NUM
  02 NUM-X                          (A1/9)
01 TIN1-DR--Q000
  02 TIN1-DR--R000                  (N9)
01 REDEFINE TIN1-DR--Q000
  02 TIN1-DR--Q000/ALPHA            (A9)
*
01 TIN1-CR--Q001
  02 TIN1-CR--R001                  (N9)
01 REDEFINE TIN1-CR--Q001
  02 TIN1-CR--Q001/ALPHA            (A9)
*
01 DISP-DATE                        (A8)
01 REDEFINE DISP-DATE
  02 DD-MM                          (N2)
  02 DD-X1                          (A1)
  02 DD-DD                          (N2)
  02 DD-X2                          (A1)
  02 DD-YY                          (N2)
01 WORK-DATE                        (A6)
01 REDEFINE WORK-DATE
  02 WD-MM                          (N2)
  02 WD-DD                          (N2)
  02 WD-YY                          (N2)
*
01 X1                               (P3)
01 GOTO-ACRC                        (L)
*
END-DEFINE
*
*****************************************************************
*
ADD 1 TO XXX-CNT
*      SELECT ACCT-TOTALS ASSIGN TO UT-S-ATHNACTT.
IF ACT-CODE NE 'D'
  DECIDE ON FIRST VALUE OF ACT-CODE
    VALUE 'B'
      PERFORM INITA
    VALUE 'C'
      PERFORM TOT-FNLA
    VALUE 'E'
      PERFORM TOT-LNA
    NONE VALUES /* inc 'A'
      PERFORM TEST-ACCT-NO
  END-DECIDE
ELSE                                /* ACT-CODE IS 'D'
**DECIDE ON EVERY VALUE OF GO-CODE  /* SAG-AB 20060822
  DECIDE ON FIRST VALUE OF GO-CODE  /* SAG-AB 20060822
    VALUE 1
      PERFORM GO-CODE-1
    VALUE 2
      PERFORM GO-CODE-2
    VALUE 3
      PERFORM GO-CODE-3
    VALUE 4
      PERFORM GO-CODE-4
      PERFORM PRINTA
    VALUE 5
      PERFORM GO-CODE-5
      PERFORM PRINTA
    VALUE 6
      PERFORM GO-CODE-6
    VALUE 7
      PERFORM GO-CODE-7
    VALUE 8
      PERFORM GO-CODE-8
    VALUE 9
      PERFORM GO-CODE-9
    VALUE 10
      PERFORM GO-CODE-10
    VALUE 11
      PERFORM GO-CODE-11
    VALUE 12
      PERFORM GO-CODE-12
    VALUE 13
      PERFORM GO-CODE-13
    VALUE 14
      PERFORM GO-CODE-14
      PERFORM PRINTA
    VALUE 15
      PERFORM GO-CODE-15
      PERFORM PRINTA
    VALUE 16
      PERFORM GO-CODE-16
      PERFORM PRINTA
    VALUE 17
      PERFORM GO-CODE-17
      PERFORM PRINTA
    VALUE 18
      PERFORM GO-CODE-18
      PERFORM PRINTA
    VALUE 19
      PERFORM GO-CODE-19
      PERFORM PRINTA
    VALUE 20
      PERFORM GO-CODE-20
      PERFORM PRINTA
    VALUE 21
      PERFORM GO-CODE-21
      PERFORM PRINTA
    VALUE 22
      PERFORM GO-CODE-22
      PERFORM PRINTA
    VALUE 23
      PERFORM GO-CODE-23
      PERFORM PRINTA
    VALUE 24
      PERFORM GO-CODE-24
      PERFORM PRINTA
    VALUE 25
      PERFORM GO-CODE-25
      PERFORM PRINTA
    VALUE 26
      PERFORM GO-CODE-26
    VALUE 27
      PERFORM GO-CODE-27
      PERFORM PRINTA
    VALUE 28
      PERFORM GO-CODE-28
      PERFORM PRINTA
    VALUE 29
      PERFORM GO-CODE-29
      PERFORM PRINTA
    VALUE 30
      PERFORM GO-CODE-30
      PERFORM PRINTA
    VALUE 31
      PERFORM GO-CODE-31
      PERFORM PRINTA
    VALUE 32
      PERFORM GO-CODE-32
      PERFORM PRINTA
    VALUE 33
      PERFORM GO-CODE-33
    ANY VALUES                    /* SAG-AB 20060811 REMOVED
***      IF NOT (GO-CODE = 2 OR = 3 OR = 26) /* sag-ab 20060822 REMOVED
***        PERFORM PRINTA
***      END-IF
      ESCAPE MODULE
    NONE VALUES
      WRITE 'INVALID-GO-CODE'
  END-DECIDE
*
END-IF
*
*****************************************************************
*
DEFINE SUBROUTINE TEST-ACCT-NO
*
IF TIN1-DESC NE ' '
  MOVE TIN1-DESC TO LINE1-DESC/ALPHA
ELSE
  DECIDE ON FIRST VALUE OF TIN1-ACCTNO
    VALUE '410'
      MOVE 'INTEREST ' TO LINE1-DESC/ALPHA
    VALUE '110'
      MOVE 'PRINCIPAL' TO LINE1-DESC/ALPHA
    VALUE '190'
      MOVE 'INT ADJ  ' TO LINE1-DESC/ALPHA
    VALUE '801'
      MOVE 'TRANS REJ' TO LINE1-DESC/ALPHA
    VALUE '420'
      MOVE 'PREMIUM  ' TO LINE1-DESC/ALPHA
    VALUE '422'
      MOVE 'DUES PMT ' TO LINE1-DESC/ALPHA
    VALUE '115'
      MOVE 'PRINC ADJ' TO LINE1-DESC/ALPHA
    VALUE '430'
      MOVE '1ST FEE  ' TO LINE1-DESC/ALPHA
    VALUE '432'
      MOVE 'DUES FPF ' TO LINE1-DESC/ALPHA
    VALUE '440'
      MOVE 'ALLOTMENT' TO LINE1-DESC/ALPHA
    VALUE '445'
      MOVE 'E-Z PAY  ' TO LINE1-DESC/ALPHA
    VALUE '450'
      MOVE 'DR/CR ACC' TO LINE1-DESC/ALPHA
    NONE VALUES
      MOVE TIN1-DESC TO LINE1-DESC/ALPHA
  END-DECIDE
END-IF
*
FRMT-REC.
REPEAT
*
  REPEAT
    MOVE TIN1-ID TO LINE1-ID
    MOVE TIN1-NAME TO LINE1-NAME
    MOVE TIN1-CLERK TO LINE1-CLERK
    MOVE TIN1-PROCESS-DATE TO LINE1-PROCESS-DATE
    MOVE TIN1-TRTIME TO LINE1-TIME
    MOVE TIN1-DATE TO WORK-DATE
    MOVE WD-MM TO DD-MM
    MOVE '/' TO DD-X1
    MOVE WD-DD TO DD-DD
    MOVE '/' TO DD-X1
    MOVE WD-YY TO DD-YY
    MOVE DISP-DATE TO LINE1-DATE
    MOVE TIN1-LTRANDT TO WORK-DATE
    MOVE WD-MM TO DD-MM
    MOVE '/' TO DD-X1
    MOVE WD-DD TO DD-DD
    MOVE '/' TO DD-X1
    MOVE WD-YY TO DD-YY
    MOVE DISP-DATE TO LINE1-LTRANDT
**    MOVE TIN1-DR TO NUM                  /* SAG-AB 20060825 START
**    FOR X1 = 1 TO 9
**      IF NUM-X(X1) = ' '
**        MOVE '0' TO NUM-X(X1)
**      END-IF
**    END-FOR
**    MOVE NUM TO TIN1-DR
**    MOVE TIN1-CR TO NUM
**    FOR X1 = 1 TO 9
**      IF NUM-X(X1) = ' '
**        MOVE '0' TO NUM-X(X1)
**      END-IF
**    END-FOR
**    MOVE NUM TO TIN1-CR
**    MOVE TIN1-DR TO TIN1-DR--Q000/ALPHA
**    IF TIN1-DR--R000 NE MASK(999999999)
**      MOVE '00000000' TO TIN1-DR
**    END-IF
**    MOVE TIN1-CR TO TIN1-CR--Q001/ALPHA
**    IF TIN1-CR--R001 NE MASK(999999999)
**      MOVE '00000000' TO TIN1-CR
**    END-IF                               /* SAG-AB 20060825 END
*   MOVE TIN1-DEBIT TO LINE1-DEBIT                             /* EDS 08/23/2006
    MOVE EDITED TIN1-DEBIT (EM=Z,ZZZ,ZZ9.99-) TO LINE1-DEBIT   /* EDS 08/23/2006
*   MOVE TIN1-CREDIT TO LINE1-CREDIT                           /* EDS 08/23/2006
    MOVE EDITED TIN1-CREDIT (EM=Z,ZZZ,ZZ9.99-) TO LINE1-CREDIT /* EDS 08/23/2006
    MOVE TIN1-TRAN TO LINE1-TRCD
    IF TIN1-REF = 'AUTO APL' OR = 'ALP GEN' OR = 'AUTO ETI' OR = 'AIP GEN'
        OR = 'ELP GEN' OR = 'EIP GEN' OR = 'ALP REVERS'
      MOVE TIN1-REF TO LINE1-MSG
    ELSE
      MOVE TIN1-MSG TO LINE1-MSG
    END-IF
    ADD TIN1-DEBIT TO ACDEBIT
    ADD TIN1-CREDIT TO ACCREDIT
    IF TIN1-ACCTNO = '110' OR = '410' OR = '801' OR = '420' OR = '422' OR = '115' OR
        = '430' OR = '432' OR = '440' OR = '445' OR = '450' OR = '999' OR = '190'
      ESCAPE BOTTOM
    END-IF
    ESCAPE BOTTOM (FRMT-REC.)
  END-REPEAT
*
  REPEAT
*
    ACC-RECB.
    REPEAT
      IF GOTO-ACRC
        MOVE FALSE TO GOTO-ACRC
      ELSE
        IF TIN1-ACCTNO = '801'
          ESCAPE BOTTOM (ACC-RECB.)
        END-IF
      END-IF
*
      DECIDE FOR FIRST CONDITION
        WHEN TIN1-MSG NE 'A'
          IGNORE
        WHEN TIN1-TRAN = 'EZPR'
          IF TIN1-CREDIT + EZPAY-PREMS > 9999999.99   /* PM99
            MOVE 9999999.99 TO EZPAY-PREMS            /* PM99
          ELSE                                        /* PM99
            ADD TIN1-CREDIT TO EZPAY-PREMS
          END-IF                                      /* PM99
          MOVE 'J' TO ACT-CODE
          ESCAPE MODULE
        WHEN TIN1-TRAN = 'PREP' OR = '402'
          IF APL-PREM + TIN1-CREDIT > 9999999.99    /* YAK 01/12/2007
            MOVE 9999999.99 TO APL-PREM            /* FIX FOR TRANCATION
          ELSE
            ADD TIN1-CREDIT TO APL-PREM
          END-IF
        WHEN TIN1-AALP-CD = '1'
          IF ALP-PRINC + TIN1-CREDIT > 9999999.99     /* YAK 01/12/2007
            MOVE 9999999.99 TO ALP-PRINC              /* FIX FOR TRUNCATION
          ELSE
            ADD TIN1-CREDIT TO ALP-PRINC
          END-IF
          SUBTRACT TIN1-DEBIT FROM ALP-PRINC
        WHEN TIN1-AALP-CD = '3'
          IF ELP-PRINC + TIN1-CREDIT > 9999999.99     /* YAK 01/12/2007
            MOVE 9999999.99 TO ELP-PRINC              /* FIX FOR TRUNCATION
          ELSE
            ADD TIN1-CREDIT TO ELP-PRINC
          END-IF
        WHEN TIN1-AALP-CD = '2'
          IF TIN1-TRAN = 'PRNP' OR = 'PRNF' OR = 'PRNV'
            IF ALP-PRINC + TIN1-CREDIT > 9999999.99    /* YAK 01/12/2007
              MOVE 9999999.99 TO ALP-PRINC             /* FIX FOR TRUNCATION
            ELSE                                       /*
              ADD TIN1-CREDIT TO ALP-PRINC             /* ABEND LINE
            END-IF
            SUBTRACT TIN1-DEBIT FROM ALP-PRINC
          ELSE
            IF AIP-INT + TIN1-CREDIT > 9999999.99      /* YAK 01/12/2007
              MOVE 9999999.99 TO AIP-INT               /* FIX FOR TRANCATION
            ELSE
              ADD TIN1-CREDIT TO AIP-INT
            END-IF
            SUBTRACT TIN1-DEBIT FROM AIP-INT
          END-IF
        WHEN TIN1-AALP-CD = '4'
          IF TIN1-TRAN = 'PRNP' OR = 'PRNF' OR = 'PRNV'
            IF ELP-PRINC + TIN1-CREDIT > 9999999.99    /* YAK 01/12/2007
              MOVE 9999999.99 TO ELP-PRINC             /* FIX FOR TRUNCATION
            ELSE
              ADD TIN1-CREDIT TO ELP-PRINC
            END-IF
          ELSE
            IF EIP-INT + TIN1-CREDIT > 9999999.99      /* YAK 01/12/2007
              MOVE 9999999.99 TO EIP-INT               /* FIX FOR TRANCATION
            ELSE
              ADD TIN1-CREDIT TO EIP-INT
            END-IF
          END-IF
        WHEN TIN1-TRAN = 'NEWL' OR = '431 '
          IF APL-PRINC + TIN1-DEBIT > 9999999.99       /* YAK 01/12/2007
            MOVE 9999999.99 TO APL-PRINC              /* FIX FOR TRUNCATION
          ELSE
            ADD TIN1-DEBIT TO APL-PRINC
          END-IF
        WHEN TIN1-TRAN = 'PRNP' OR = 'PRNF' OR = 'PRNV' OR = '433 '
          IF ETI-PRINC + TIN1-CREDIT > 9999999.99      /* YAK 01/12/2007
            MOVE 9999999.99 TO ETI-PRINC               /* FIX FOR TRUNCATION
          ELSE
            ADD TIN1-CREDIT TO ETI-PRINC
          END-IF
        WHEN NOT (TIN1-TRAN = 'ADDL' OR = '435 ')
          IGNORE
        WHEN TIN1-COL = '1'
          SUBTRACT TIN1-CREDIT FROM APL-PRINC
        WHEN TIN1-COL = '3'
          IF APL-PRINC + TIN1-DEBIT > 9999999.99     /* YAK 01/12/2007
            MOVE 9999999.99 TO APL-PRINC            /* FIX FOR TRANCATION
          ELSE
            ADD TIN1-DEBIT TO APL-PRINC
          END-IF
        WHEN TIN1-CREDIT = 0
          IF APL-PRINC + TIN1-DEBIT > 9999999.99     /* YAK 01/12/2007
            MOVE 9999999.99 TO APL-PRINC            /* FIX FOR TRANCATION
          ELSE
            ADD TIN1-DEBIT TO APL-PRINC
          END-IF
          SUBTRACT TIN1-DEBIT FROM APL-INT-CAP
        WHEN NONE
          SUBTRACT TIN1-CREDIT FROM APL-PRINC
          IF APL-INT-CAP + TIN1-CREDIT > 9999999.99    /* YAK 01/12/2007
            MOVE 9999999.99 TO APL-INT-CAP            /* FIX FOR TRANCATION
          ELSE
            ADD TIN1-CREDIT TO APL-INT-CAP
          END-IF
      END-DECIDE
*
      ARC-A.
      REPEAT
        DECIDE FOR EVERY CONDITION
          WHEN TIN1-TRAN = 'PRER' OR = '401 ' OR = 'DUER'
            MOVE 17 TO INDEX1
            MOVE '1' TO TIN1-COL
          WHEN TIN1-TRAN = 'FPFR' OR = '411 ' OR = 'FPDR'
            MOVE 19 TO INDEX1
            MOVE '1' TO TIN1-COL
          WHEN TIN1-TRAN = 'STOP' OR = '413 '
            MOVE 21 TO INDEX1
            MOVE '1' TO TIN1-COL
          WHEN TIN1-TRAN = 'ADJ' AND TIN1-ACCTNO = '445'
            MOVE 23 TO INDEX1
          WHEN TIN1-TRAN = 'RDCR' OR = '415 '
            MOVE 25 TO INDEX1
            MOVE '1' TO TIN1-COL
          WHEN ANY
            PERFORM ACC-DEBIT-ACCT
            ESCAPE BOTTOM (FRMT-REC.)
          WHEN NONE
            IGNORE
        END-DECIDE
        DECIDE FOR EVERY CONDITION
          WHEN TIN1-TRAN = 'ADCR' OR = '416 '
            MOVE 24 TO INDEX1
          WHEN TIN1-TRAN = 'FPFP' OR = '412 ' OR = 'FPDP'
            MOVE 18 TO INDEX1
          WHEN TIN1-TRAN = 'INTP' OR = 'INTF' OR = 'INTV' OR = '421 '
            MOVE 08 TO INDEX1
          WHEN TIN1-TRAN = '422 '
            MOVE 11 TO INDEX1
          WHEN (TIN1-TRAN = 'STRT' OR = '414 ') AND TIN1-ACCTNO = '440'
            MOVE 20 TO INDEX1
          WHEN TIN1-TRAN = 'STRT' AND TIN1-ACCTNO = '445'
            MOVE 22 TO INDEX1
          WHEN TIN1-TRAN = 'PREP' OR = '402 ' OR = 'DUEP'
            MOVE 16 TO INDEX1
          WHEN TIN1-TRAN = 'INPP' OR = 'INPF' OR = 'INPV' OR = '423 '
            MOVE 08 TO INDEX1
          WHEN TIN1-TRAN = 'IADJ' OR = 'IADF' OR = 'IADV' OR = '424 '
            MOVE 11 TO INDEX1
          WHEN TIN1-TRAN = 'AIAJ' OR = 'AIAF' OR = 'AIAV' OR = '426 '
            MOVE 15 TO INDEX1
          WHEN TIN1-TRAN = 'PRNP' OR = 'PRNF' OR = 'PRNV' OR = 'CAPI' OR = 'CAPF'
              OR = 'CAPV' OR = '433' OR = '434'
            MOVE 01 TO INDEX1
          WHEN TIN1-TRAN = 'FLNP' OR = 'FLNF' OR = 'FLNV' OR = '437 '
            MOVE 08 TO INDEX1
          WHEN ANY
            PERFORM ACC-CREDIT-ACCT
            ESCAPE BOTTOM (FRMT-REC.)
          WHEN NONE
            IGNORE
        END-DECIDE
        IF TIN1-TRAN = 'NEWL' OR = '431 '
          IF TIN1-COL = '2'
            MOVE 09 TO INDEX1
            SUBTRACT TIN1-CREDIT FROM AC1-DIS
            PERFORM ACC-CREDIT-ACCT
          ELSE
            MOVE 02 TO INDEX1
            PERFORM ACC-DEBIT-ACCT
          END-IF
          ESCAPE BOTTOM (FRMT-REC.)
        END-IF
        IF TIN1-TRAN = 'ADDL' OR TIN1-TRAN = '435 '
          IF TIN1-ACCTNO = '801' AND TIN1-COL NE '3'
            ADD TIN1-CREDIT TO AC1-DIS
          END-IF
          IF TIN1-COL = '3'
            MOVE 03 TO INDEX1
            PERFORM ACC-DEBIT-ACCT
          ELSE
            IF TIN1-COL = '2'
              MOVE 09 TO INDEX1
              SUBTRACT TIN1-CREDIT FROM AC1-DIS
              PERFORM ACC-CREDIT-ACCT
            ELSE
              IF TIN1-COL = '1'
                MOVE 03 TO INDEX1
                SUBTRACT TIN1-CREDIT FROM AC1-DIS
                SUBTRACT TIN1-CREDIT FROM AC1-ACC(3)
                SUBTRACT TIN1-CREDIT FROM AC1-ACC(3)
                PERFORM ACC-CREDIT-ACCT
              END-IF
            END-IF
          END-IF
          ESCAPE BOTTOM (FRMT-REC.)
        END-IF
        IF TIN1-TRAN = 'PADJ' OR = 'PADF' OR = 'PADV' OR = '436 ' OR = 'CADJ'
            OR = 'CADF' OR = 'CADV'
          MOVE 05 TO INDEX1
          IF TIN1-MSG = 'J' OR = 'I'
            IF AC1-JI + TIN1-CREDIT > 9999999.99    /* YAK 01/12/2007
              MOVE 9999999.99 TO AC1-JI              /* FIX FOR TRANCATION
            ELSE
              ADD TIN1-CREDIT TO AC1-JI
            END-IF
            SUBTRACT TIN1-DEBIT FROM AC1-JI
            SUBTRACT TIN1-CREDIT FROM TIN1-DEBIT
            SUBTRACT TIN1-DEBIT FROM AC1-RCT
            PERFORM ADEBITA
          ELSE
            IF TIN1-MSG = 'L'
              IF AC1-L + TIN1-CREDIT > 9999999.99    /* YAK 01/12/2007
                MOVE 9999999.99 TO AC1-L             /* FIX FOR TRANCATION
              ELSE
                ADD TIN1-CREDIT TO AC1-L
              END-IF
              SUBTRACT TIN1-DEBIT FROM AC1-L
              SUBTRACT TIN1-CREDIT FROM TIN1-DEBIT
              PERFORM ADEBITA
            ELSE
              MOVE '1' TO TIN1-COL
              PERFORM ACC-DEBIT-ACCT
            END-IF
          END-IF
          ESCAPE BOTTOM (FRMT-REC.)
        END-IF
        IF TIN1-TRAN = 'UPDI' OR = '439 '
          SUBTRACT TIN1-CREDIT FROM TIN1-DEBIT
          MOVE 04 TO INDEX1
          PERFORM ADEBITA
          ESCAPE BOTTOM (FRMT-REC.)
        END-IF
        IF TIN1-TRAN = 'CVIN' OR = '429 '
          SUBTRACT TIN1-DEBIT FROM TIN1-CREDIT
          MOVE 10 TO INDEX1
          PERFORM ACREDITA
          ESCAPE BOTTOM (FRMT-REC.)
        END-IF
*
        ESCAPE BOTTOM (FRMT-REC.)
      END-REPEAT
*
      ESCAPE BOTTOM (ACC-RECB.)
    END-REPEAT /* (ACC-RECB.)
*
    IF TIN1-TRAN = 'PRER' OR = '401 ' OR = 'FPFR' OR = '411 ' OR = 'STOP'
        OR = '413 ' OR = 'RDCR' OR = '415 ' OR = 'PADJ' OR = 'PADF' OR = 'PADV' OR = '436 '
      MOVE TIN1-CREDIT TO HD-DRCR
      MOVE TIN1-DEBIT TO TIN1-CREDIT
      MOVE HD-DRCR TO TIN1-DEBIT
    END-IF
*
    MOVE TRUE TO GOTO-ACRC
*
  END-REPEAT
*
END-REPEAT /* (FRMT-REC.)
**                    store in global while writing headers
MOVE LINE1/ALPHA TO P10P1-LINE1-GLOBAL   /* SAG-AB 20060822
*
PERFORM PRNT-LNE
*
**PERFORM PRNT-X1    /* SAG-AB 20060811 see subr. PRNT-LNE
*
PERFORM BLK-PG
*
PERFORM PRINTA       /* if did not escape from prnt-lne or blk-pg
ESCAPE MODULE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE INITA
*
IF MICRO-RESPONSE = 'YES'
  MOVE 63 TO P10P1.MAX-LINE
END-IF
IF RUN-ORDER = '1'
  MOVE 'ACCOUNT ORDER' TO P10P1-HDG2-ORDER
ELSE
  MOVE 'ID ORDER     ' TO P10P1-HDG2-ORDER
END-IF
MOVE RD-MM TO P10P1-HD-MM
MOVE '/' TO P10P1-HD-X1
MOVE RD-DD TO P10P1-HD-DD
MOVE '/' TO P10P1-HD-X2
MOVE RD-YYYY TO P10P1-HD-YYYY
RESET AC1-ACC(*) AC1-REJ(*)
MOVE 'K' TO ACT-CODE
ESCAPE MODULE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE TOT-LNA
*
IF ACT-SUM-PROC = 2
  MOVE 'N' TO ACT-CODE
  ESCAPE MODULE
END-IF
**MOVE ACDEBIT TO LN2-DEBIT                               /* EDS 08232006
**MOVE ACCREDIT TO LN2-CREDIT                             /* EDS 08232006
MOVE EDITED ACDEBIT (EM=ZZZ,ZZZ,ZZ9.99) TO LN2-DEBIT    /* EDS 08232006
MOVE EDITED ACCREDIT (EM=ZZZ,ZZZ,ZZ9.99) TO LN2-CREDIT  /* EDS 08232006
**MOVE 0000000.00 TO ACDEBIT ACCREDIT    /* SAG-AB 20060821
MOVE 0000000.00 TO ACDEBIT ACCREDIT    /* SAG-AB 20060821
MOVE LINE2/ALPHA TO POUT1/ALPHA
MOVE 3 TO GO-CODE
PERFORM PRINTA
ESCAPE MODULE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE TOT-FNLA
*
**DEFINE WORK FILE 7  'dummy' /* Work File 7 definition in SCL
MOVE 'Y' TO TOTS
*
**MOVE HDG5 TO POUT1/ALPHA   /* SAG-AB 20060817
**MOVE 4 TO GO-CODE          /* SAG-AB 20060817
**PERFORM PRINTA             /* SAG-AB 20060817
PERFORM GO-CODE-26           /* SAG-AB 20060817
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-1
*
ADD 1 TO FICH-PAGE-CT
PERFORM BLK-PG
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-2
*
MOVE 'J' TO ACT-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-3
*
MOVE 66 TO P10P1.LINE-CT
MOVE 'N' TO ACT-CODE
ESCAPE MODULE             /* SAG-AB 20060821
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-4
*
MOVE HDG6 TO POUT1/ALPHA
MOVE 5 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-5
*
MOVE 'ACCOUNTING REGISTER TOTAL' TO FRAME-KEY
MOVE '0 PRINCIPAL 110' TO POUT1/ALPHA
MOVE 6 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-6
*
FOR INDEX1 = 1 TO 5
  PERFORM SET-LN
END-FOR
SUBTRACT AC1-ACC(1) FROM AC1-ACC(6)
ADD AC1-ACC(2) TO AC1-ACC(6)
ADD AC1-ACC(3) TO AC1-ACC(6)
ADD AC1-ACC(4) TO AC1-ACC(6)
ADD AC1-ACC(5) TO AC1-ACC(6)
MOVE 06 TO INDEX1
PERFORM SET-LN
MOVE '0 INTEREST 410' TO POUT1/ALPHA
MOVE 7 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-7
*
FOR INDEX1 = 8 TO 11
  PERFORM SET-LN
END-FOR
COMPUTE AC1-ACC(12) = AC1-ACC(12) + AC1-ACC(8) + AC1-ACC(9) + AC1-ACC(10) + AC1-ACC(11)
MOVE 12 TO INDEX1
PERFORM SET-LN
MOVE '0 ACCRUED INT 190' TO POUT1/ALPHA
MOVE 8 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-8
*
MOVE 15 TO INDEX1
PERFORM SET-LN
MOVE '0 PREMIUM 420' TO POUT1/ALPHA
MOVE 9 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-9
*
FOR INDEX1 = 16 TO 17
  PERFORM SET-LN
END-FOR
MOVE '0 FIRST PLACEMENT  430' TO POUT1/ALPHA
MOVE 10 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-10
*
FOR INDEX1 = 18 TO 19
  PERFORM SET-LN
END-FOR
MOVE '0 ALLOTMENT  440' TO POUT1/ALPHA
MOVE 11 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-11
*
FOR INDEX1 = 20 TO 21
  PERFORM SET-LN
END-FOR
MOVE '0 EZ-PAY 445' TO POUT1/ALPHA
MOVE 12 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-12
*
FOR INDEX1 = 22 TO 23
  PERFORM SET-LN
END-FOR
MOVE '0 DR/CR  450' TO POUT1/ALPHA
MOVE 13 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-13
*
FOR INDEX1 = 24 TO 25
  PERFORM SET-LN
END-FOR
MOVE HDG7 TO POUT1/ALPHA
MOVE 14 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-14
*
MOVE AC1-RCT TO LN6-AMT1
MOVE AC1-INT TO LN6-AMT2
MOVE AC1-DIS TO LN6-AMT3
MOVE LINE6/ALPHA TO POUT1/ALPHA
MOVE 15 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-15
*
IF AC1-JI = 0
  PERFORM GO-CODE-16
END-IF
MOVE AC1-JI TO LN7-AMT
MOVE LINE7/ALPHA TO POUT1/ALPHA
MOVE 16 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-16
*
IF AC1-L = 0
  MOVE APL-PRINC TO LN9-AMT
  MOVE LINE9/ALPHA TO POUT1/ALPHA
  MOVE 18 TO GO-CODE
ELSE
  MOVE AC1-L TO LN8-AMT
  MOVE LINE8/ALPHA TO POUT1/ALPHA
  MOVE 17 TO GO-CODE
END-IF
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-17
*
MOVE APL-PRINC TO LN9-AMT
MOVE LINE9/ALPHA TO POUT1/ALPHA
MOVE 18 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-18
*
MOVE APL-INT-CAP TO LINE9A-AMT
MOVE LINE9A/ALPHA TO POUT1/ALPHA
MOVE 19 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-19
*
IF APL-PRINC = APL-PREM
  MOVE ETI-PRINC TO LN11-AMT1
  MOVE LINE11/ALPHA TO POUT1/ALPHA
  MOVE 21 TO GO-CODE
ELSE
  MOVE APL-PREM TO LN10-AMT1
  MOVE APL-PRINC TO LN10-AMT2
  MOVE LINE10/ALPHA TO POUT1/ALPHA
  MOVE 20 TO GO-CODE
END-IF
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-20
*
MOVE ETI-PRINC TO LN11-AMT1
MOVE LINE11/ALPHA TO POUT1/ALPHA
MOVE 21 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-21
*
MOVE ALP-PRINC TO LN12-AMT1
MOVE LINE12/ALPHA TO POUT1/ALPHA
MOVE 22 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-22
*
MOVE AIP-INT TO LN13-AMT1
MOVE LINE13/ALPHA TO POUT1/ALPHA
MOVE 23 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-23
*
MOVE ELP-PRINC TO LN14-AMT1
MOVE LINE14/ALPHA TO POUT1/ALPHA
MOVE 24 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-24
*
MOVE EIP-INT TO LN15-AMT1
MOVE LINE15/ALPHA TO POUT1/ALPHA
MOVE 25 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-25
*
MOVE EZPAY-PREMS TO LN16-AMT1
MOVE LINE16/ALPHA TO POUT1/ALPHA
MOVE 26 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-26
*
CLOSE WORK FILE 7            /* SAG 12/20/2005 RH1 AB
MOVE 'M' TO ACT-CODE
ESCAPE MODULE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE GO-CODE-27
*
IF MICRO-RESPONSE NE 'Y' AND P10P1.PAGE-CT = 0
  MOVE '$-A001' TO POUT1/ALPHA
  MOVE 28 TO GO-CODE
ELSE
  ADD 1 TO P10P1.PAGE-CT
  ADD 1 TO FICH-PAGE-CT
  MOVE EDITED P10P1.PAGE-CT (EM=ZZZZ9) TO HDG1-PG   /* EDS 08/23/2006
  MOVE HDG1/ALPHA TO POUT1/ALPHA
  MOVE 29 TO GO-CODE
END-IF
*
END-SUBROUTINE
*
**********************************************************************
*
DEFINE SUBROUTINE GO-CODE-28
*
ADD 1 TO P10P1.PAGE-CT
ADD 1 TO FICH-PAGE-CT
MOVE EDITED P10P1.PAGE-CT (EM=ZZZZ9) TO HDG1-PG   /* EDS 08/23/2006
MOVE HDG1/ALPHA TO POUT1/ALPHA
MOVE 29 TO GO-CODE
*
END-SUBROUTINE
*
**********************************************************************
*
DEFINE SUBROUTINE GO-CODE-29
*
MOVE P10P1-HDG2/ALPHA TO POUT1/ALPHA
MOVE 30 TO GO-CODE
*
END-SUBROUTINE
*
**********************************************************************
*
DEFINE SUBROUTINE GO-CODE-30
*
MOVE HDG3/ALPHA TO POUT1/ALPHA
MOVE 31 TO GO-CODE
*
END-SUBROUTINE
*
**********************************************************************
*
DEFINE SUBROUTINE GO-CODE-31
*
MOVE HDG4/ALPHA TO POUT1/ALPHA
MOVE 32 TO GO-CODE
*
END-SUBROUTINE
*
**********************************************************************
*
DEFINE SUBROUTINE GO-CODE-32
*
MOVE 33 TO GO-CODE
*
END-SUBROUTINE
*
**********************************************************************
*
DEFINE SUBROUTINE GO-CODE-33
*
MOVE 6 TO P10P1.LINE-CT
RESET HD-ACCTNO
MOVE TIN1-ID-9 TO FRAME-KEY
IF P10P1.PRT-X = 1
  PERFORM PRNT-X1
  PERFORM BLK-PG
ELSE
  PERFORM RESET-OLD-CN
END-IF
*
END-SUBROUTINE
*
***********************************************************************
*
DEFINE SUBROUTINE SET-LN
*
MOVE CS-NAM(INDEX1) TO LN5-NAM
MOVE AC1-ACC(INDEX1) TO LN5-AMT1
MOVE AC1-REJ(INDEX1) TO LN5-AMT2
ADD AC1-ACC(INDEX1) TO AC1-REJ(INDEX1)
MOVE AC1-REJ(INDEX1) TO LN5-AMT3
MOVE LINE5/ALPHA TO POUT1/ALPHA
MOVE 27 TO GO-CODE
PERFORM PRINTA
ESCAPE MODULE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE RESET-OLD-CN
**          retrieve from store in global while writing headers
MOVE P10P1-LINE1-GLOBAL TO LINE1/ALPHA   /* SAG-AB 20060822
*
MOVE TIN1-ID TO LAST-CN
MOVE LINE1/ALPHA TO POUT1/ALPHA
ADD 1 TO P10P1.LINE-CT
MOVE 2 TO GO-CODE
PERFORM PRINTA
ESCAPE MODULE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE PRINTA
*
IF TOTS = 'Y'
  MOVE POUT1/ALPHA TO AC-TOT-LINE
  WRITE WORK FILE 7 AC-TOT-LINE      /* SAG 12/20/2005 RH1 AB
END-IF
MOVE 'L' TO ACT-CODE
ESCAPE MODULE                        /* SAG-AB 20060822
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE ACC-CREDIT-ACCT
*
SUBTRACT TIN1-DEBIT FROM TIN1-CREDIT
IF TIN1-COL = '3'
  ADD TIN1-CREDIT TO AC1-DIS
ELSE
  IF TIN1-COL = '2'
    ADD TIN1-CREDIT TO AC1-INT
  ELSE
    ADD TIN1-CREDIT TO AC1-RCT
  END-IF
END-IF
PERFORM ACREDITA
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE ACREDITA
*
IF TIN1-ACCTNO = '801'
  ADD TIN1-CREDIT TO AC1-REJ(INDEX1)
ELSE
  ADD TIN1-CREDIT TO AC1-ACC(INDEX1)
END-IF
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE ACC-DEBIT-ACCT
*
SUBTRACT TIN1-CREDIT FROM TIN1-DEBIT
IF TIN1-COL = '1'
  ADD TIN1-DEBIT TO AC1-RCT
ELSE
  IF TIN1-COL = '2'
    ADD TIN1-DEBIT TO AC1-INT
  ELSE
    ADD TIN1-DEBIT TO AC1-DIS
  END-IF
END-IF
PERFORM ADEBITA
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE ADEBITA
*
IF TIN1-ACCTNO = '801'
  ADD TIN1-DEBIT TO AC1-REJ(INDEX1)
ELSE
  ADD TIN1-DEBIT TO AC1-ACC(INDEX1)
END-IF
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE BLK-PG
*
IF FICH-PAGE-CT = 207
  RESET FICH-PAGE-CT
  MOVE 2 TO P10P1.PRT-X
  IF MICRO-RESPONSE NE 'Y' AND P10P1.PAGE-CT = 0
    MOVE '$-A001' TO POUT1/ALPHA
    MOVE 28 TO GO-CODE
**  PERFORM PRINTA   /* SAG-AB 20060811
**  ESCAPE MODULE    /* SAG-AB 20060811
  ELSE
    PERFORM GO-CODE-28
  END-IF
  PERFORM PRINTA     /* SAG-AB 20060811
  ESCAPE MODULE      /* SAG-AB 20060811
END-IF
MOVE '1' TO POUT1/ALPHA
MOVE 'L' TO ACT-CODE  /* SAG-AB 20061011
MOVE 1 TO GO-CODE
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE PRNT-X1
*

IF RUN-ORDER = '1' AND TIN1-ACCTNO = HD-ACCTNO
  RESET LINE1-DESC
END-IF
MOVE TIN1-ACCTNO TO HD-ACCTNO
IF FICH-PAGE-CT < 205 OR TIN1-ID = LAST-CN
  PERFORM RESET-OLD-CN
END-IF
*
END-SUBROUTINE
*
*****************************************************************
*
DEFINE SUBROUTINE PRNT-LNE
*
IF P10P1.LINE-CT > P10P1.MAX-LINE
  MOVE 1 TO P10P1.PRT-X
  IF MICRO-RESPONSE NE 'Y' AND P10P1.PAGE-CT = 0
    MOVE '$-A001' TO POUT1/ALPHA
    MOVE 28 TO GO-CODE
**  PERFORM PRINTA      /* SAG-AB 20060811
**  ESCAPE MODULE       /* SAG-AB 20060811
  ELSE
    PERFORM GO-CODE-28
  END-IF
  PERFORM PRINTA        /* SAG-AB 20060811
  ESCAPE MODULE         /* SAG-AB 20060811
ELSE                    /* SAG-AB 20060811
  PERFORM PRNT-X1       /* SAG-AB 20060811
END-IF
*
END-SUBROUTINE
*
*****************************************************************
*
END
