* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ATHPTELE - UPDATE DATABASE with home phone
*
DEFINE DATA
LOCAL
*                                       /* with new last cn number
1 ST-ISN-V VIEW OF A-STATUS
1 #ISN    (P8)
*
1 ST-V VIEW OF A-STATUS
 2 WIDOW-FLAG            (A1)
 2 ID-NUMBER             (N6)
* 2 TELE-NUMBER           (P11)
*
1 #TELE-MATCH
 2 #ID-NUMBER            (N6)
 2 REDEFINE #ID-NUMBER
  3 #ID-NUMBER-A         (A6)
 2 #FILL                 (A1)
 2 #PHONE                (N10)
 2 REDEFINE #PHONE
  3 #PHONE-A             (A10)
 2 REDEFINE #PHONE
  3 #PHONE-3             (A3)
  3 REDEFINE #PHONE-3
   4 #PHONE-3-N          (N3)
  3 #PHONE-7             (A7)
*
1 #FOUND-MEMBER  (L)
1 #FOUND-WIDOW   (L)
1 #COUNTERS
  2 #RECS-READ        (P7)
  2 #RECS-WRITTEN     (P7)
  2 #NUM-NO-PHN       (P7)
  2 #UPDATES          (P7)
  2 #NOT-FOUND        (P7)
  2 #PHN-ALREADY      (P7)
  2 #CNT              (P7)
  2 #I1               (I2)
  2 #I2               (I2)
*
END-DEFINE
*
* * * * * * * REPORT HEADER * * * * * *
FORMAT (2)  LS=133 PS=76
WRITE  (2) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
               'TELE-MATCH LISTING'
               5X 'DATE: '*DATX 5X 'TIME: ' *TIMX  //
FORMAT (3)  LS=133 PS=76
WRITE  (3) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
               'ZIP-CODE 11 UPDATE - NOT FOUNDS AND RECENT CHANGES'
               5X 'DATE: '*DATX 5X 'TIME: ' *TIMX  //
FORMAT (4)  LS=133 PS=76
WRITE  (4) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
               'ZIP-CODE 11 UPDATE - address changes'
               5X 'DATE: '*DATX 5X 'TIME: ' *TIMX  //
FORMAT (5)  LS=133 PS=76
WRITE  (5) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
               'ZIP-CODE 11 UPDATE - city/state changes'
               5X 'DATE: '*DATX 5X 'TIME: ' *TIMX  //
FORMAT (6)  LS=133 PS=76
WRITE  (6) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
               'ZIP-CODE 11 UPDATE - ZIP-5 changes'
               5X 'DATE: '*DATX 5X 'TIME: ' *TIMX  //
FORMAT (7)  LS=133 PS=76
WRITE  (7) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
               'CURRENT ZIP-11"S NOT UPDATED BECAUSE ADDR NOT FOUND'
               5X 'DATE: '*DATX 5X 'TIME: ' *TIMX  //
*
READ WORK 2 RECORD #TELE-MATCH
  ADD +1 TO #RECS-READ
*
  IF #PHONE NE MASK (NNNNNNNNNN)
    ADD 1 TO #NUM-NO-PHN
    ESCAPE TOP
  END-IF
*
* IF #RECS-READ GT 400
*   ESCAPE BOTTOM
* END-IF
*
  MOVE TRUE TO #FOUND-WIDOW #FOUND-MEMBER
  FIND (1) ST-ISN-V WITH MEMBER-KEY = #ID-NUMBER-A
    IF NO RECORDS FOUND
      RESET #FOUND-MEMBER
      FIND (1) ST-ISN-V WITH WIDOW-KEY = #ID-NUMBER-A
        IF NO RECORDS FOUND
          RESET #FOUND-WIDOW
          WRITE  (3) #ID-NUMBER-A ' ID NOT FOUND **********'
                     #PHONE
          WRITE  (3) ' '
          ADD 1 TO #NOT-FOUND
        END-NOREC
*
        IF #FOUND-WIDOW
          MOVE *ISN TO #ISN
        END-IF
      END-FIND
    END-NOREC
*
    IF #FOUND-MEMBER
      MOVE *ISN TO #ISN
    END-IF
  END-FIND
*
  IF #FOUND-MEMBER OR #FOUND-WIDOW
    IGNORE
  ELSE
    END TRANSACTION
    ESCAPE TOP
  END-IF
*
  GET ST-V #ISN
*
*   IF TELE-NUMBER NE 0
*     ADD 1 TO #PHN-ALREADY
*     END TRANSACTION
*     ESCAPE TOP
*   END-IF
*
*  MOVE #PHONE TO TELE-NUMBER
  DISPLAY (2) ID-NUMBER #PHONE
*
*   ADD 1 TO #UPDATES
*   UPDATE (0117)
*
  END TRANSACTION
END-WORK
*
WRITE  (2) 'TOTAL RECS READ    =' #RECS-READ
WRITE  (2) 'TOTAL NOT FOUNDS   =' #NOT-FOUND
WRITE  (2) 'TOTAL NO PHONES    =' #NUM-NO-PHN
WRITE  (2) 'TOTAL PHONE ALREADY=' #PHN-ALREADY
WRITE  (2) 'TOTAL UPDATES      =' #UPDATES
*
*
END
