* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ATHPABEN - Forced abend
*
*
DEFINE DATA
LOCAL
*
1 #TEST    (A1/10)
1 #I1      (I2)
END-DEFINE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*
FOR #I1 1 TO 20
  MOVE '1' TO #TEST (#I1)
END-FOR
*
END
