* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PGM-ID: athpmrup
* THIS PROGRAM rebuilds yesterdays mr's"
*           <<<<<   MAKE SURE 'MESSAGES' ARE PROPERLY PROCESSED >>>>>>>>
DEFINE DATA
LOCAL
*
1 MR-V VIEW OF A-REQUEST
  2 ID-NUMBER        (N6)
  2 MEMBER-NAME      (A20)
  2 CLERK-ID         (A3)
  2 ZIP-CODE         (N5)
  2 REDEFINE ZIP-CODE
   3 FIR-IND         (N1)
   3 MSG-IND         (N1)
   3 RET-IND         (N1)
   3 FIN-IND         (N1)
   3 FAS-IND         (N1)
  2 REQUEST-DATE     (N4)
  2 ASSUM-RET-DATE   (N8)
  2 MESSAGE          (A60/20)
*
1 NT-V VIEW OF A-NOTES
  2 ID-NUMBER        (N6)
  2 NOTE-TABLE       (40)
    3 NOTE-TEXT      (A60)
    3 REDEFINE NOTE-TEXT
     4 NOTE-RQST-IDS (P7/15)
*
1 ST-V VIEW OF STATUS
  2 ID-NUMBER        (N6)
  2 NAME             (A25)
*
1 #I1                 (I1)
1 #I2                 (I1)
1 #NUM-EXTR           (P5)
1 #FOUND-MR           (L)
*
1 #NOTE-ID            (N6)
1 #ID-N               (N6)
1 REDEFINE #ID-N
 2 #ID-A              (A6)
*
END-DEFINE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*
FIND (1) NT-V WITH ID-NUMBER = 800003
  FOR #I1 1 TO 40
    FOR #I2 1 TO 15
      IF NOTE-RQST-IDS (#I1, #I2) NE 0
*      AND (NOTE-RQST-IDS (#I1, #I2) GE 18161) /* <<<<<<<<<<<<<
        MOVE NT-V.NOTE-RQST-IDS (#I1, #I2) TO #ID-N
*
        RESET #FOUND-MR
        FIND MR-V WITH ID-NUMBER = #ID-N
          IF NO RECORDS FOUND
            ESCAPE BOTTOM
          END-NOREC
          MOVE TRUE TO #FOUND-MR
        END-FIND
*
        IF #FOUND-MR
          WRITE 'BYPASSED STORING' #ID-N
          ESCAPE TOP
        END-IF
*
        FIND (1) ST-V WITH MEMBER-KEY = #ID-A
          MOVE #ID-N     TO MR-V.ID-NUMBER
          MOVE ST-V.NAME TO MR-V.MEMBER-NAME
          MOVE 'DRW'     TO MR-V.CLERK-ID
          MOVE 1003      TO MR-V.REQUEST-DATE
*
          RESET MR-V.FIR-IND
          RESET MR-V.FIN-IND
          RESET MR-V.MSG-IND
*         IF #ID-N = 68145 OR = 28796 OR = 47150 OR = 17358 OR = 22672
*               OR = 73711 OR = 23289 OR = 49110 OR = 14150 OR = 50921
*           MOVE 1 TO MR-V.FIN-IND
*         ELSE
            MOVE 1 TO MR-V.FIR-IND
*         END-IF
*
          IF   (MESSAGE (1) NE ' ')
           OR  (MESSAGE (2) NE ' ')
            MOVE 1 TO MR-V.MSG-IND
          END-IF
*
*         COMPUTE #NOTE-ID = #ID-N + 600000
*         FIND (1) NT-MSG-V WITH ID-NUMBER = #NOTE-ID
*           IF   (NT-MSG-V.NOTE-TEXT (1) NE ' ')
*            OR  (NT-MSG-V.NOTE-TEXT (2) NE ' ')
*             MOVE 1 TO MR-V.MSG-IND
*           END-IF
*         END-FIND
*
          ADD 1 TO #NUM-EXTR
*         STORE MR-V
*         END TRANSACTION
        END-FIND
        DISPLAY NOTE-RQST-IDS (#I1, #I2) MR-V.MEMBER-NAME MR-V.FIR-IND
                                                          MR-V.FIN-IND
                                                          MR-V.MSG-IND
      END-IF
    END-FOR
  END-FOR
END-FIND
WRITE 'TOTAL EXTRACTED = ' #NUM-EXTR
*
END
