* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ATHP05PS
*
*  sorts AAFMAA ins segments
DEFINE DATA
GLOBAL USING ATHG05P0
LOCAL
*
1 #INTEGER-FIELDS
  2 #IS               (I2)
  2 #IF               (I2)
  2 #IT               (I2)
*
1 #YYYYMMDD    (N8)
1 REDEFINE #YYYYMMDD
 2 #YYYYMM     (N6)
 2 #DD         (N2)
*
1 #UPDATE  (L)
*
END-DEFINE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
WRITE TITLE LEFT 'PROGRAM:' *PROGRAM 5X 'DATE:' *DAT4U 5X 'TIME:' *TIMX
FORMAT  LS=133 PS=66
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*
READ STATUS-VIEW WITH MEMBER-KEY = '097362'
  IF ID-NUMBER GT 97362
    ESCAPE BOTTOM
  END-IF
*
  RESET #UPDATE
  FOR #IS 2 TO 9
    IF ISSUE-DATE (#IS) LT ISSUE-DATE (#IS - 1)
     AND (ISSUE-DATE (#IS) NE 0)
     AND (STATUS (9) = ' ')
      DISPLAY ID-NUMBER #IS ISSUE-DATE (#IS) ISSUE-DATE (#IS - 1)
      MOVE TRUE TO #UPDATE
      MOVE #IS TO #IF        /* index from  (low)
      MOVE 9   TO #IT        /* index to    (9)
      PERFORM #SHIFT-SEGS    /* save low seg
*
      COMPUTE #IF = #IS - 1  /* index from  (high)
      MOVE #IS TO #IT        /* index to
      PERFORM #SHIFT-SEGS    /* move high to 2nd
*
      MOVE 9   TO #IF        /* index from
      COMPUTE #IT = #IS - 1  /* index to
      PERFORM #SHIFT-SEGS    /* move low to 1st
*
      RESET STATUS             (9)
      RESET PLAN               (9)
      RESET ISSUE-AGE          (9)
      RESET PAY-STATUS         (9)
      RESET PRIOR-STATUS       (9)
      RESET ONLINE-ACTION      (9)
      RESET MODE               (9)
      RESET FIRS-LOCATION-CODE (9)
      RESET CONVERSION-FLAG    (9)
      RESET SMOKER-FLAG        (9)
      RESET ISSUE-DATE         (9)
      RESET SPLIT-IND          (9)
      RESET PAID-UP-DATE       (9)
      RESET PAID-TO-DATE       (9)
      RESET BILL-TO-DATE       (9)
      RESET FACE-AMOUNT        (9)
      RESET ANNUAL-PREM        (9)
      RESET EXPIRY-DAY         (9)
      RESET LAST-DURATION      (9)
      RESET CASH-VALUE         (9)
      RESET DEATH-BENEFIT      (9)
      RESET NUM-MBRSHIPS       (9)
      RESET TOT-PREMIUMS-PAID  (9)
      RESET ONLINE-DATE        (9)
      RESET DURATION           (9)
      RESET MONTH-IND          (9)
      RESET MIN-CASH-VALUE     (9)
      RESET NXT-YR-MIN-CASH-VALUE (9)
      RESET NXT-MON-CASH-VALUE (9)
      RESET NXT-MON-DEATH-BENEFIT (9)
      RESET LAST-ANN-CASH-VALUE(9)
      RESET ACC-CASH-VALUE     (9)
      RESET CONV-DURATION      (9)
      RESET MONTH-ALLOC-AMT    (9)
      RESET PREM-DEFICIENCY    (9)
      RESET BEG-CASH-VALUE     (9)
      RESET NET-PR-RATIO       (9)
      RESET OWNERSHIP-FLAG     (9)
      RESET COST-BASIS         (9)
      RESET ORIG-COST-BASIS    (9)
*
      RESET MTD-ACV-PREM-ADJ   (9)
      RESET MTD-ACV-INT-ADJ    (9)
      RESET MTD-ACV-COI-ADJ    (9)
      RESET RID-PLAN           (9)
      RESET RID-EFF-DT         (9)
      RESET RID-PD-TO          (9)
*
      SUBTRACT 1 FROM #IS     /* try again
    END-IF
  END-FOR
*
  IF #UPDATE
    WRITE 'update' ID-NUMBER
    UPDATE (0032)
  END-IF
*
  END TRANSACTION
END-READ
*
* * * * * * * * * * * * * * *
DEFINE SUBROUTINE #SHIFT-SEGS
* * * * * * * * * * * * * * *
*
MOVE STATUS             (#IF) TO STATUS            (#IT)
MOVE PLAN               (#IF) TO PLAN              (#IT)
MOVE ISSUE-AGE          (#IF) TO ISSUE-AGE         (#IT)
MOVE PAY-STATUS         (#IF) TO PAY-STATUS        (#IT)
MOVE PRIOR-STATUS       (#IF) TO PRIOR-STATUS      (#IT)
MOVE ONLINE-ACTION      (#IF) TO ONLINE-ACTION     (#IT)
MOVE MODE               (#IF) TO MODE              (#IT)
MOVE FIRS-LOCATION-CODE (#IF) TO FIRS-LOCATION-CODE(#IT)
MOVE CONVERSION-FLAG    (#IF) TO CONVERSION-FLAG   (#IT)
MOVE SMOKER-FLAG        (#IF) TO SMOKER-FLAG       (#IT)
MOVE ISSUE-DATE         (#IF) TO ISSUE-DATE        (#IT)
MOVE SPLIT-IND          (#IF) TO SPLIT-IND         (#IT)
MOVE PAID-UP-DATE       (#IF) TO PAID-UP-DATE      (#IT)
MOVE PAID-TO-DATE       (#IF) TO PAID-TO-DATE      (#IT)
MOVE BILL-TO-DATE       (#IF) TO BILL-TO-DATE      (#IT)
MOVE FACE-AMOUNT        (#IF) TO FACE-AMOUNT       (#IT)
MOVE ANNUAL-PREM        (#IF) TO ANNUAL-PREM       (#IT)
MOVE EXPIRY-DAY         (#IF) TO EXPIRY-DAY        (#IT)
MOVE LAST-DURATION      (#IF) TO LAST-DURATION     (#IT)
MOVE CASH-VALUE         (#IF) TO CASH-VALUE        (#IT)
MOVE DEATH-BENEFIT      (#IF) TO DEATH-BENEFIT     (#IT)
MOVE NUM-MBRSHIPS       (#IF) TO NUM-MBRSHIPS      (#IT)
MOVE TOT-PREMIUMS-PAID  (#IF) TO TOT-PREMIUMS-PAID (#IT)
MOVE ONLINE-DATE        (#IF) TO ONLINE-DATE       (#IT)
MOVE DURATION           (#IF) TO DURATION          (#IT)
MOVE MONTH-IND          (#IF) TO MONTH-IND         (#IT)
MOVE MIN-CASH-VALUE     (#IF) TO MIN-CASH-VALUE    (#IT)
MOVE NXT-YR-MIN-CASH-VALUE (#IF) TO NXT-YR-MIN-CASH-VALUE    (#IT)
MOVE NXT-MON-CASH-VALUE (#IF) TO NXT-MON-CASH-VALUE(#IT)
MOVE NXT-MON-DEATH-BENEFIT (#IF) TO NXT-MON-DEATH-BENEFIT    (#IT)
MOVE LAST-ANN-CASH-VALUE(#IF) TO LAST-ANN-CASH-VALUE      (#IT)
MOVE ACC-CASH-VALUE     (#IF) TO ACC-CASH-VALUE    (#IT)
MOVE CONV-DURATION      (#IF) TO CONV-DURATION     (#IT)
MOVE MONTH-ALLOC-AMT    (#IF) TO MONTH-ALLOC-AMT   (#IT)
MOVE PREM-DEFICIENCY    (#IF) TO PREM-DEFICIENCY   (#IT)
MOVE BEG-CASH-VALUE     (#IF) TO BEG-CASH-VALUE    (#IT)
MOVE NET-PR-RATIO       (#IF) TO NET-PR-RATIO      (#IT)
MOVE OWNERSHIP-FLAG     (#IF) TO OWNERSHIP-FLAG    (#IT)
MOVE COST-BASIS         (#IF) TO COST-BASIS        (#IT)
MOVE ORIG-COST-BASIS    (#IF) TO ORIG-COST-BASIS   (#IT)
*
MOVE MTD-ACV-PREM-ADJ   (#IF) TO MTD-ACV-PREM-ADJ  (#IT)
MOVE MTD-ACV-INT-ADJ    (#IF) TO MTD-ACV-INT-ADJ   (#IT)
MOVE MTD-ACV-COI-ADJ    (#IF) TO MTD-ACV-COI-ADJ   (#IT)
*
MOVE RID-PLAN           (#IF) TO RID-PLAN          (#IT)
MOVE RID-EFF-DT         (#IF) TO RID-EFF-DT        (#IT)
MOVE RID-PD-TO          (#IF) TO RID-PD-TO         (#IT)
*
END-SUBROUTINE
*
END
