* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
**********************
* ATHPRFRP
* report for outstanding term refunds
* 04/04/2011 vxt initial creation
*************************************************************************
* USER DATE       TAG  MODIFICATION
* JNT  09/23/2013 JT1  Address normalization  
*************************************************************************
DEFINE DATA LOCAL
*
1 ST-v VIEW OF A-STATUS
  2 ID-NUMBER
  2 MEMBER-CONTACT-ID
  2 spouse-contact-id
  2 MEMBER-FLAG
  2 NAME
  2 status (9)
*   2 ADDRESS-1                                       /* JT1
*   2 ADDRESS-2                                       /* JT1
*   2 ADDRESS-3                                       /* JT1
  2 MILITARY-SERVICE
  2 FACE-AMOUNT (P7.2/9)
  2 firs-location-code    (9)
  2 issue-date  (9)
  2 plan        (9)
  2 paid-to-date (9)
  2 PROCESS-IND
*   2 S-ADDRESS-1                                     /* JT1
*   2 S-ADDRESS-2                                     /* JT1
*   2 S-ADDRESS-3                                     /* JT1
*   2 ZIP-CODE                                        /* JT1
  2 intro-flag
  2 name-sp
  2 pad-code
  2 linked-cn(9)
  2 ownership-flag (9)
  2 C*out-term-ref-group
  2 out-term-ref-group
    3 out-term-ref-amount(99)

local
1 #tot-read        (n7)
1 #rec-extracted   (n7)
1 #out-file        (a250)
1 #tab             (a1) init<H'09'>
1 #i               (i2)
1 #totl-refund       (n9.2)
1 #totl-refund-a     (a15)
1 cont view of a-contacts
  2 id-number
  2 contact-id
*
1 #e-mail  (a70)
1 #contact-id (n8)
END-DEFINE
*
compress 'CN # ' #tab
  'NAme'  #tab
  'Amount ' #tab
  'E-mail ' #tab
  into #out-file leaving no
write work 1 #out-file
*
reAD st-v by id-number
  add 1 to #tot-read

  for #i 1 to ST-v.C*out-term-ref-group
    add st-v.out-term-ref-amount  (#i) to #TOTL-refund
  end-for
  #TOTL-refund := #totl-Refund * -1
  move edited #totl-refund (em=szzz,zzz,zz9.99) to #totl-refund-a
*
  if #totl-refund NE 0
    reset #contact-id #e-mail
    find cont with cont.id-number = st-v.id-number
      if no
        escape bottom
      end-norec
      move cont.contact-id to #contact-id
      callnat 'emailn01' #contact-id #e-mail
    end-find
    compress st-v.id-number  #tab
      st-v.name              #tab
      #TOTL-refund-a         #TAB
      #e-mail                #TAb
      into #out-file leaving no
    write work 1 #out-file
*  write id-number name #totl-refund
    reset #totl-refund
    add 1 to #rec-extracted
  end-if
*
  at end of data
    write 'records read ' #tot-read /
      'records extracted ' #rec-extracted
  end-enddata
*
end-read
END


