* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ATHPYET4 - process year-end terminations
*
************************************************************************
*                       MODIFICATION LOG                               *
* USER DATE     TAG  REASON                                            *
* SAG  12012005 RH1  SS - Replaced the HEX constant '05' (Tab position)*
*                    EBCDIC to HEX code '09' ASCII                     *
************************************************************************
DEFINE DATA
LOCAL
* 1 #TAB     (A1) INIT <H'05'>     /* SAG RH1 12012005 SS
1 #TAB       (A1) INIT <H'09'>     /* SAG RH1 12012005 SS
*
1 #YETM-EXTRACT     (A200)
1 REDEFINE #YETM-EXTRACT
  2 #YE-CN       (N6)
  2 #YE-REMAIN   (A194)
1 REDEFINE #YETM-EXTRACT
  2 #YE-X        (A1/200)
*
1 #SSN-A          (A9)
1 REDEFINE #SSN-A
  2 #SSN         (N9)
1 #SSN-11       (A11)
1 REDEFINE #SSN-11
  2 #SSN-X     (A1/11)
1 REDEFINE #SSN-11
  2 #SSN1      (A3)
  2 #SSNFILL1  (A1)
  2 #SSN2      (A2)
  2 #SSNFILL2  (A1)
  2 #SSN3      (A4)
1 #PROCESS-IND  (A1)
1 #INTR-FLG     (A1)
1 #DOB          (A8)
1 #DOD          (A8)
1 #FIRST        (A25)
1 #MI           (A25)
1 #LAST         (A25)
1 #ADDR-1       (A25)
1 #ADDR-2       (A25)
1 #ADDR-3       (A25)
1 #ZIP-CODE     (A9)
1 #TERM-CODE    (A3)
1 #TERM-DATE    (A6)
*
1 #FIELD        (A25)
1 REDEFINE #FIELD
  2 #FIELD-X     (A1/25)
1 REDEFINE #FIELD
  2 #FIELD-9     (N9)
*
1 ST-V VIEW OF A-STATUS
  2 ID-NUMBER            (N6)
  2 PROCESS-IND
  2 INTRO-FLAG
  2 ISSUE-DATE     (1)
*
1 #COUNTERS
  2 #RECS-READ        (P5)
  2 #RECS-WRITTEN     (P5)
  2 #CNT              (P5)
  2 #CNT-2            (P5)
  2 #CNT-3            (P5)
  2 #I1               (I2)
  2 #I2               (I2)
  2 #I3               (I2)
  2 #I4               (I2)
1 #ERR-MSG   (A60)
*
1 #YYYYMMDD        (N8)
1 REDEFINE #YYYYMMDD
  2 #YYYY-A        (A4)
  2 #MM-A          (A2)
  2 #DD-A          (A2)
1 REDEFINE #YYYYMMDD
  2 #YYYYMM        (N6)
  2 REDEFINE #YYYYMM
    3 #YYYY        (N4)
    3 #MM          (N2)
  2 #DD            (N2)
1 REDEFINE #YYYYMMDD
  2 #YYYYMMDD-A    (A8)
*
1 #MMDDYYYY-10   (A10)
1 REDEFINE #MMDDYYYY-10
  2 #MMDDYYYY-X (A1/10)
1 REDEFINE #MMDDYYYY-10
  2 #MM-AX    (A2)
  2 #DT-FILL1 (A1)
  2 #DD-AX    (A2)
  2 #DT-FILL2 (A1)
  2 #YYYY-AX  (A4)
*
1 #MMYYYY-7   (A7)
1 REDEFINE #MMYYYY-7
  2 #MMYYYY-X (A1/7)
1 REDEFINE #MMYYYY-7
  2 #MM-AX7   (A2)
  2 #DT-FILL1 (A1)
  2 #YYYY-AX7 (A4)
*
1 #CN    (N6)
1 REDEFINE #CN
  2 #CN-A    (A6)
*
END-DEFINE
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
*
* * * * * * * REPORT HEADER * * * * * *
*
FORMAT  LS=133 PS=58
WRITE   TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
  'Y/E Terminated Extract Exceptions'
  5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
FORMAT (2) LS=133 PS=58
WRITE  (2) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
  'Y/E Terminated Extract'
  5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
FORMAT (3) LS=133 PS=58
WRITE  (3) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
  'Y/E Terminated Extract - xxxxxxxxx'
  5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
COMPRESS 'CN'
  #TAB 'SSN'
  #TAB 'PROCESS-IND'
  #TAB 'INTR-FLG'
  #TAB 'DOB'
  #TAB 'DOD'
  #TAB 'FIRST-name'
  #TAB 'MI'
  #TAB 'Last'
  #TAB 'addr-1'
  #TAB 'ADDR-2'
  #TAB 'ADDR-3'
  #TAB 'ZIP-CODE'
  #TAB 'TERM-CODE'
  #TAB 'TERM-DATE'
  INTO #YETM-EXTRACT LEAVING NO
* WRITE WORK FILE 2 #YETM-EXTRACT
*
READ WORK 1 RECORD #YETM-EXTRACT
* IF #RECS-READ GT 100
*   ESCAPE BOTTOM
* END-IF
*
  ADD +1 TO #RECS-READ
  IF #RECS-READ = 1
    ESCAPE TOP
  END-IF
*
  RESET #SSN
    #SSN-11
    #PROCESS-IND
    #INTR-FLG
    #DOB
    #DOD
    #FIRST
    #MI
    #LAST
    #ADDR-1
    #ADDR-2
    #ADDR-3
    #ZIP-CODE
    #TERM-CODE
    #TERM-DATE
  MOVE '00-00-0000' TO #MMDDYYYY-10
*
  MOVE 2 TO #I2      /* field #
  FOR #I1 8 TO 200
    DECIDE ON FIRST VALUE #I2
      VALUE 2    /* SSN
        RESET #I4
        MOVE '000-00-0000' TO #SSN-11
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            COMPRESS #SSN1 #SSN2 #SSN3 INTO #SSN-A
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #SSN-X (#I4)
          END-IF
        END-FOR
      VALUE 3    /* Process-ind
        RESET #I4
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            MOVE #YE-X (#I3) TO #PROCESS-IND
          END-IF
        END-FOR
      VALUE 4    /* INTRO-FLAG
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            MOVE #YE-X (#I3) TO #INTR-FLG
          END-IF
        END-FOR
      VALUE 5    /* DOB
        RESET #I4
        MOVE '00-00-0000' TO #MMDDYYYY-10
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            COMPRESS #YYYY-AX #MM-AX #DD-AX INTO #YYYYMMDD-A LEAVING NO
            MOVE #YYYYMMDD TO #DOB
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #MMDDYYYY-X (#I4)
          END-IF
        END-FOR
      VALUE 6    /* DOD
        RESET #I4
        MOVE '00-00-0000' TO #MMDDYYYY-10
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            COMPRESS #YYYY-AX #MM-AX #DD-AX INTO #YYYYMMDD-A LEAVING NO
            MOVE #YYYYMMDD TO #DOD
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #MMDDYYYY-X (#I4)
          END-IF
        END-FOR
      VALUE 7    /* 1st name
        RESET #I4 #FIELD
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            MOVE #FIELD TO #FIRST
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #FIELD-X (#I4)
          END-IF
        END-FOR
      VALUE 8    /* Middle init
        RESET #I4 #FIELD
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            MOVE #FIELD TO #MI
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #FIELD-X (#I4)
          END-IF
        END-FOR
      VALUE 9    /* last name
        RESET #I4 #FIELD
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            MOVE #FIELD TO #LAST
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #FIELD-X (#I4)
          END-IF
        END-FOR
      VALUE 10   /* addrss 1
        RESET #I4 #FIELD
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            MOVE #FIELD TO #ADDR-1
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #FIELD-X (#I4)
          END-IF
        END-FOR
      VALUE 11   /* addrss 2
        RESET #I4 #FIELD
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            MOVE #FIELD TO #ADDR-2
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #FIELD-X (#I4)
          END-IF
        END-FOR
      VALUE 12   /* addrss 3
        RESET #I4 #FIELD
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            MOVE #FIELD TO #ADDR-3
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #FIELD-X (#I4)
          END-IF
        END-FOR
      VALUE 13   /* zip
        RESET #I4 #FIELD
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            MOVE #FIELD-9 TO #ZIP-CODE
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #FIELD-X (#I4)
          END-IF
        END-FOR
      VALUE 14   /* term-cd
        RESET #I4 #FIELD
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB
            MOVE #FIELD-9 TO #TERM-CODE
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #FIELD-X (#I4)
          END-IF
        END-FOR
      VALUE 15   /* term-date
        RESET #I4 #FIELD
        FOR #I3 #I1 TO 200
          IF #YE-X (#I3) = #TAB OR = ' '
            COMPRESS #YYYY-AX7 #MM-AX7 INTO #TERM-DATE LEAVING NO
            MOVE #I3 TO #I1
            ADD    1 TO #I2
            MOVE 200 TO #I3
          ELSE
            ADD 1 TO #I4
            MOVE #YE-X (#I3) TO #MMYYYY-X (#I4)
          END-IF
        END-FOR
      NONE IGNORE
    END-DECIDE
  END-FOR
*
  ADD 1 TO #CNT-2
  DISPLAY (2) #CNT-2
    'SSN'    #SSN-A
    'PR'     #PROCESS-IND
    'IF'     #INTR-FLG
    'DOB'    #DOB
    'DOD'    #DOD
    'First'  #FIRST        (EM=XXXXXXXXXXX)
    'MI'     #MI           (EM=XXX)
    'LAST'   #LAST         (EM=XXXXXXXXXXX)
    'ADDR1'  #ADDR-1       (EM=XXXXXXXXXXX)
    'addr2'  #ADDR-2       (EM=XXXXXXXXXXX)
    'addr3'  #ADDR-3       (EM=XXXXXXXXXXX)
    'ZIP'    #ZIP-CODE
    'TERM/CD' #TERM-CODE
    'TERM/dt' #TERM-DATE
*
* WRITE WORK FILE 2 #YETM-EXTRACT
* ADD 1 TO #RECS-WRITTEN
*
END-WORK
*
WRITE 'Recs-read =' #RECS-READ
WRITE 'num-recs  ='  #RECS-WRITTEN
*
END
