DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 PROCESS-SWITCH (A1)
1 P4 (A1)
1 SUNGARD-INFO-PN
  2 SU-OCC (9)
    3 FIX-ALP-PRN-AMT (N6.2)
    3 FIX-ALP-INT-AMT (N6.2)
    3 VAR-ALP-PRN-AMT (N6.2)
    3 VAR-ALP-INT-AMT (N6.2)
1 SUNGARD-INFO-PA
  2 SUN-OCC (27)
    3 SUN-TRAN (A4)
    3 SUN-CAT1 (A2)
    3 SUN-CAT2 (A2)
    3 SUN-AMT (N6.2)
    3 SUN-SEG (N1.0)
1 EZPAY-LOAN-OVERFLOW (P7.2)
END-DEFINE
