* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: athpncos - list all ncos & count widows             >>>>
************************************************************************
*                       MODIFICATION LOG                               *
* USER DATE     TAG  REASON                                            *
* PAM  03112005 PM1  Reset display fields for GRANKSXX                 *
* RSE  09292009 RE1  Change PROCESS-IND logic for Unification          *
************************************************************************
*
DEFINE DATA
LOCAL
*
* * * *   S T A T U S   F I L E   * * * * * * * * * * * * * * *
1 ST-V VIEW OF A-STATUS
  2 ID-NUMBER      (N6)
  2 REDEFINE ID-NUMBER
    3 ID-NBR       (A6)
  2 WIDOW-FLAG          (A1)
  2 STATUS-CODE-SP
  2 RANK                (A3)
  2 INTRO-FLAG
  2 PROCESS-IND
* 2 BASE-PAY-EF-DATE    (N8)
* 2 ACTIVE-DUTY-BASE-DATE (N8)
  2 MILITARY-SERVICE    (A3)
  2 MILITARY-STATUS     (A1)
* 2 RETIRED-PAY-AMT
* 2 DATE-RETIRED        (N8)
  2 NAME         (A25)
* 2 MIL-SBP-OPT         (A1)
* 2 MIL-SBP-AMT         (P5)
* 2 RETIRED-PAY-AMT     (P5)
* 2 DATE-OF-BIRTH       (N8)
* 2 ZIP-CODE
  2 NUMBER-MEMBERSHIPS
  2 ISSUE-DATE          (N8/1)
* 2 PAY-STATUS          (7)
  2 PLAN                (1)
*
1 FR-V VIEW OF A-FIRS
 2 DEPN-DATE-OF-BIRTH   (14)
 2 DEPN-NAME            (14)
*
1 #COUNTERS
  2 #RECS-READ        (P5)
  2 #CNT              (P5)
  2 #CNT-2            (P5)
  2 #CNT-3            (P5)
  2 #CNT-4            (P5)
  2 #CNT-5            (P5)
  2 #CNT-6            (P5)
  2 #I1               (I2)
  2 #I2               (I2)
  2 #I3               (I2)
*
1 #RANK-OCC    (2)
 2 #RANK-LIST   (A6/40)
 2 #RANK-DISP   (N3/40)
 2 #RANK-CNT    (N5/40)
*
1 #WYYYYMMDD-N     (N8)
1 REDEFINE #WYYYYMMDD-N
 2 #WYYYY    (N4)
 2 #WMM      (N2)
 2 #WDD      (N2)
*
1 #COMMAND    (A2) INIT <'BA'>
1 #INVALID    (L)
1 #RANK-DISPL (P2)
1 #RANK-LIT   (A23)
1 #RANK-DISPLAY (A5)
1 #CNT-WIDOWS (P5)
1 #CNT-18-22  (P5)
1 #MBC-MANNING-ARMY (P5/20)
1 #MBC-MANNING-AIRF (P5/20)
1 #FSO-NCO-ARMY   (P5)
1 #FSO-NCO-AIRF   (P5)
1 #FSO-OFF-ARMY   (P5)
1 #FSO-OFF-AIRF   (P5)
*
1 #ARMY-OFF       (P5)
1 #ARMY-NCO       (P5)
1 #AIRF-OFF       (P5)
1 #AIRF-NCO       (P5)
1 #MARN-OFF       (P5)
1 #MARN-NCO       (P5)
1 #NAVY-OFF       (P5)
1 #NAVY-NCO       (P5)
1 #OTHER-NCO      (P5)
1 #OTHER-OFF      (P5)
*
1 #NCO     (P5/2)
1 #OFF     (P5/2)
1 #AF      (P5/2)
1 #ARMY    (P5/2)
1 #SINGLE  (P5/2)
1 #MARRIED (P5/2)
*
1 #SERV   (A4)
1 #STAT-X   (I2)
1 #SERV-X  (I2)
1 #RANK-X   (I2)
1 #CNT-1X   (3)     /*off/nco/enl
 2 #CNT-2X   (3)    /*act/ret/civ
  3 #CNT-3X   (3)   /*army/airf/other
   4 #CNT-X    (P5)
*
END-DEFINE
*
FORMAT (2) LS=133 PS=76
WRITE  (2) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
     'Current NCO"S who are AIR FORCE'
*    'Current NCO"S'
                      5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
FORMAT (3) LS=133 PS=76
WRITE  (3) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
     'Current NCO"S who are C.A.P."S'
*    'Current NCO"S'
                      5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
FORMAT (4) LS=133 PS=76
WRITE  (4) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
     'TOTALS FOR ACTIVE DUTY MEMBERS'
                      5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
READ ST-V BY MEMBER-KEY FROM '001900'
* READ ST-V BY WIDOW-KEY
* READ ST-V PHYSICAL
* IF ID-NUMBER GT 107532               /* or 107839
*   ESCAPE BOTTOM
* END-IF
*
  IF  (NUMBER-MEMBERSHIPS = 0)
   OR (WIDOW-FLAG = 'Y')
*  OR (MILITARY-STATUS NE 'A')
*  OR (INTRO-FLAG = 'F')      /* FSOS
*  OR (PLAN (1) = 'FSO')      /* FSOS
*  OR (MILITARY-SERVICE   NE MASK ('F'))
*  OR (NOT INTRO-FLAG = 'B' OR = 'C' OR = 'P' OR = 'Q')
   OR (ST-V.INTRO-FLAG = 'S' OR = 'K' OR = 'G')
*  OR (ST-V.ISSUE-DATE (1) LT 20010901)
*  OR (ST-V.ISSUE-DATE (1) GE 20011101)
*   OR (ST-V.ID-NUMBER GE 600000)               RE1
   OR AFFL-ONLY-CLIENT(<ST-V.ID-NUMBER>)     /* RE1 
    ESCAPE TOP
  END-IF
*
  IF MILITARY-SERVICE = MASK ('A')
    MOVE 1 TO #SERV-X
  ELSE
    IF MILITARY-SERVICE = MASK ('F')
      MOVE 2 TO #SERV-X
    ELSE
      MOVE 3 TO #SERV-X
    END-IF
  END-IF
*
  IF MILITARY-STATUS = 'A'
    MOVE 1 TO #STAT-X
  ELSE
    IF MILITARY-STATUS = 'R'
      MOVE 2 TO #STAT-X
    ELSE
      MOVE 3 TO #STAT-X   /* civilian
    END-IF
  END-IF
*
* * * * * * * GET CURRENT RANK DISPLACEMENT INDEX * * *
*
  RESET #RANK-DISPL #RANK-LIT #RANK-DISPLAY                       /* PM1
  CALLNAT 'GRANKSXX' #COMMAND RANK MILITARY-SERVICE
            #INVALID #RANK-DISPL #RANK-LIT #RANK-DISPLAY
*
  IF #INVALID OR (#RANK-DISPL = 99)
    RESET #RANK-DISPL
  END-IF
*
  IF (#RANK-DISPL GE 20) AND (#RANK-DISPL LE 30)   /* NCO
    IF #RANK-DISPL GE 25
      MOVE 3 TO #RANK-X
    ELSE
      MOVE 2 TO #RANK-X
    END-IF
  ELSE
    MOVE 1 TO #RANK-X
  END-IF
*
  ADD 1 TO #CNT-X (#RANK-X, #STAT-X, #SERV-X)
  ESCAPE TOP
*   IF MILITARY-SERVICE = MASK ('A')
*     ADD 1 TO #FSO-NCO-ARMY
*   ELSE
*     ADD 1 TO #FSO-NCO-AIRF
*   END-IF
* ELSE
*   IF MILITARY-SERVICE = MASK ('A')
*     ADD 1 TO #FSO-OFF-ARMY
*   ELSE
*     ADD 1 TO #FSO-OFF-AIRF
*   END-IF
* END-IF
*
* IF (#RANK-DISPL GE 20) AND (#RANK-DISPL LE 30)
*   DECIDE FOR FIRST CONDITION
*     WHEN MILITARY-SERVICE = 'A'
*       ADD 1 TO #ARMY-NCO
*     WHEN MILITARY-SERVICE = 'F'
*       ADD 1 TO #AIRF-NCO
*     WHEN MILITARY-SERVICE = 'M'
*       ADD 1 TO #MARN-NCO
*     WHEN MILITARY-SERVICE = 'N'
*       ADD 1 TO #NAVY-NCO
*     WHEN NONE
*       ADD +1 TO #OTHER-NCO
*   END-DECIDE
* ELSE
*   DECIDE FOR FIRST CONDITION
*     WHEN MILITARY-SERVICE = 'A'
*       ADD 1 TO #ARMY-OFF
*     WHEN MILITARY-SERVICE = 'F'
*       ADD 1 TO #AIRF-OFF
*     WHEN MILITARY-SERVICE = 'M'
*       ADD 1 TO #MARN-OFF
*     WHEN MILITARY-SERVICE = 'N'
*       ADD 1 TO #NAVY-OFF
*     WHEN NONE
*       ADD +1 TO #OTHER-OFF
*   END-DECIDE
* END-IF
  ESCAPE TOP
*
  IF (#RANK-DISPL GE 20) AND (#RANK-DISPL LE 30)
   AND (NUMBER-MEMBERSHIPS NE 0)
   AND (WIDOW-FLAG NE 'Y')
*
*    ADD 1 TO #CNT-2
*
*   DISPLAY (3) #CNT-2 ID-NUMBER RANK #RANK-DISPL NAME MILITARY-SERVICE
    DISPLAY (2) #CNT-2 ID-NUMBER RANK #RANK-DISPL NAME MILITARY-SERVICE
    IF MILITARY-SERVICE = MASK ('A')
      MOVE 1 TO #I1
    ELSE
      MOVE 2 TO #I1
    END-IF
*
    FOR #I2 1 TO 40
      IF  (#RANK-LIST (#I1, #I2) = ' ')
       OR (#RANK-DISP (#I1, #I2) = #RANK-DISPL)
        MOVE RANK TO #RANK-LIST (#I1, #I2)
        MOVE #RANK-DISPL TO #RANK-DISP (#I1, #I2)
        ADD 1 TO #RANK-CNT (#I1, #I2)
        ESCAPE BOTTOM
      END-IF
    END-FOR
  END-IF
*
  ESCAPE TOP
*
  IF ST-V.MILITARY-STATUS = 'A'     /* ACTIVE DUTY
    IF ST-V.MILITARY-SERVICE = MASK ('A')   /* ARMY
      DECIDE ON FIRST VALUE OF ST-V.RANK
        VALUE 'GA'   ADD 1 TO #MBC-MANNING-ARMY (1)
        VALUE 'GEN'  ADD 1 TO #MBC-MANNING-ARMY (2)
        VALUE 'LTG'  ADD 1 TO #MBC-MANNING-ARMY (3)
        VALUE 'MG'   ADD 1 TO #MBC-MANNING-ARMY (4)
        VALUE 'BG'   ADD 1 TO #MBC-MANNING-ARMY (5)
        VALUE 'COL'  ADD 1 TO #MBC-MANNING-ARMY (6)
        VALUE 'LTC'  ADD 1 TO #MBC-MANNING-ARMY (7)
        VALUE 'MAJ'  ADD 1 TO #MBC-MANNING-ARMY (8)
        VALUE 'CPT'  ADD 1 TO #MBC-MANNING-ARMY (9)
        VALUE 'LT'   ADD 1 TO #MBC-MANNING-ARMY (10)
        VALUE '1LT'  ADD 1 TO #MBC-MANNING-ARMY (10)
        VALUE '2LT'  ADD 1 TO #MBC-MANNING-ARMY (10)
        VALUE 'CW4'  ADD 1 TO #MBC-MANNING-ARMY (11)
        VALUE 'WO4'  ADD 1 TO #MBC-MANNING-ARMY (11)
        VALUE 'CW3'  ADD 1 TO #MBC-MANNING-ARMY (11)
        VALUE 'CWO'  ADD 1 TO #MBC-MANNING-ARMY (11)
        VALUE 'WO3'  ADD 1 TO #MBC-MANNING-ARMY (11)
        VALUE 'CW2'  ADD 1 TO #MBC-MANNING-ARMY (11)
        VALUE 'WO2'  ADD 1 TO #MBC-MANNING-ARMY (11)
        VALUE 'CW1'  ADD 1 TO #MBC-MANNING-ARMY (11)
        VALUE 'WO1'  ADD 1 TO #MBC-MANNING-ARMY (11)
        VALUE 'WO'   ADD 1 TO #MBC-MANNING-ARMY (11)
        VALUE 'CSM'  ADD 1 TO #MBC-MANNING-ARMY (12) /* e9
        VALUE 'SGM'  ADD 1 TO #MBC-MANNING-ARMY (12) /* e9
        VALUE '1SG'  ADD 1 TO #MBC-MANNING-ARMY (13) /* e8
        VALUE 'MSG'  ADD 1 TO #MBC-MANNING-ARMY (13) /* e8
        VALUE 'PSG'  ADD 1 TO #MBC-MANNING-ARMY (14) /* e7
        VALUE 'SFC'  ADD 1 TO #MBC-MANNING-ARMY (14) /* e7
        VALUE 'SSG'  ADD 1 TO #MBC-MANNING-ARMY (15) /* e6
        VALUE 'SGT'  ADD 1 TO #MBC-MANNING-ARMY (16) /* e5
        VALUE 'CPL'  ADD 1 TO #MBC-MANNING-ARMY (17) /* e4
        VALUE 'SPC'  ADD 1 TO #MBC-MANNING-ARMY (17) /* e4
        NONE         IGNORE
      END-DECIDE
    END-IF /* (0265)
*
    IF ST-V.MILITARY-SERVICE = MASK ('F')   /* AIR-FORCE
      DECIDE ON FIRST VALUE OF ST-V.RANK
        VALUE 'GA'   ADD 1 TO #MBC-MANNING-AIRF (1)
        VALUE 'GEN'  ADD 1 TO #MBC-MANNING-AIRF (2)
        VALUE 'LTG'  ADD 1 TO #MBC-MANNING-AIRF (3)
        VALUE 'MG'   ADD 1 TO #MBC-MANNING-AIRF (4)
        VALUE 'BG'   ADD 1 TO #MBC-MANNING-AIRF (5)
        VALUE 'COL'  ADD 1 TO #MBC-MANNING-AIRF (6)
        VALUE 'LTC'  ADD 1 TO #MBC-MANNING-AIRF (7)
        VALUE 'MAJ'  ADD 1 TO #MBC-MANNING-AIRF (8)
        VALUE 'CPT'  ADD 1 TO #MBC-MANNING-AIRF (9)
        VALUE 'LT'   ADD 1 TO #MBC-MANNING-AIRF (10)
        VALUE '1LT'  ADD 1 TO #MBC-MANNING-AIRF (10)
        VALUE '2LT'  ADD 1 TO #MBC-MANNING-AIRF (10)
        VALUE 'CW4'  ADD 1 TO #MBC-MANNING-AIRF (11)
        VALUE 'WO4'  ADD 1 TO #MBC-MANNING-AIRF (11)
        VALUE 'CW3'  ADD 1 TO #MBC-MANNING-AIRF (11)
        VALUE 'CWO'  ADD 1 TO #MBC-MANNING-AIRF (11)
        VALUE 'WO3'  ADD 1 TO #MBC-MANNING-AIRF (11)
        VALUE 'CW2'  ADD 1 TO #MBC-MANNING-AIRF (11)
        VALUE 'WO2'  ADD 1 TO #MBC-MANNING-AIRF (11)
        VALUE 'CW1'  ADD 1 TO #MBC-MANNING-AIRF (11)
        VALUE 'WO1'  ADD 1 TO #MBC-MANNING-AIRF (11)
        VALUE 'WO'   ADD 1 TO #MBC-MANNING-AIRF (11)
        VALUE 'CMS'  ADD 1 TO #MBC-MANNING-AIRF (12) /* e9
        VALUE 'SMS'  ADD 1 TO #MBC-MANNING-AIRF (13) /* e8
        VALUE 'MSG'  ADD 1 TO #MBC-MANNING-AIRF (14) /* e7
        VALUE 'TSG'  ADD 1 TO #MBC-MANNING-AIRF (15) /* e6
        VALUE 'SSG'  ADD 1 TO #MBC-MANNING-AIRF (16) /* e5
        NONE         IGNORE
      END-DECIDE
    END-IF /* (0303)
  END-IF /* (0264)
*
* IF (WIDOW-FLAG = 'Y') AND (STATUS-CODE-SP NE 'D')
*   ADD 1 TO #CNT-WIDOWS
* END-IF
*
END-READ
*
WRITE
 '      *****OFFICER*******   ******NCOS********   ***ENLISTED******'
WRITE
 '        act    ret    civ    act    ret    civ    act    ret    civ'
FOR #SERV-X 1 TO 3
  IF #SERV-X = 1
    MOVE 'ARMY' TO #SERV
  ELSE
    IF #SERV-X = 2
      MOVE 'AIRF' TO #SERV
    ELSE
      MOVE 'OTH' TO #SERV
    END-IF
  END-IF
 WRITE #SERV #CNT-X(1,1,#SERV-X) #CNT-X(1,2,#SERV-X) #CNT-X(1,3,#SERV-X)
        #CNT-X(2,1,#SERV-X) #CNT-X(2,2,#SERV-X) #CNT-X(2,3,#SERV-X)
        #CNT-X(3,1,#SERV-X) #CNT-X(3,2,#SERV-X) #CNT-X(3,3,#SERV-X)
END-FOR
*
WRITE 'CAP MEMBER from 9/2001 & 10/2001'
WRITE 'NCO     =' #NCO    (1:2)
WRITE 'OFFICER =' #OFF    (1:2)
WRITE 'AF      =' #AF     (1:2)
WRITE 'ARMY    =' #ARMY   (1:2)
WRITE 'SINGLE  =' #SINGLE  (1:2)
WRITE 'MARRIED =' #MARRIED (1:2)
* WRITE (2) '   ARMY                          AIR FORCE'
* DISPLAY (4)  'RANK' #RANK-LIST (1, *)
*              'DISP' #RANK-DISP (1, *)
*              'CNT'  #RANK-CNT  (1, *)
*              'RANK' #RANK-LIST (2, *)
*              'DISP' #RANK-DISP (2, *)
*              'CNT'  #RANK-CNT  (2, *)
* WRITE 'FSO NCO ARMY = ' #FSO-NCO-ARMY
* WRITE 'FSO NCO AIRF = ' #FSO-NCO-AIRF
* WRITE 'FSO OFF ARMY = ' #FSO-OFF-ARMY
* WRITE 'FSO OFF AIRF = ' #FSO-OFF-AIRF
*
WRITE (4) 'TOTAL ARMY OFFICERS     =' #ARMY-OFF (EM=ZZZ,ZZ9)
WRITE (4) 'TOTAL ARMY NCO"S        =' #ARMY-NCO (EM=ZZZ,ZZ9)
WRITE (4) 'TOTAL AIRFORCE OFFICERS =' #AIRF-OFF (EM=ZZZ,ZZ9)
WRITE (4) 'TOTAL AIRFORCE NCO"S    =' #AIRF-NCO (EM=ZZZ,ZZ9)
WRITE (4) 'TOTAL NAVY OFFICERS     =' #NAVY-OFF (EM=ZZZ,ZZ9)
WRITE (4) 'TOTAL NAVY NCO"S        =' #NAVY-NCO (EM=ZZZ,ZZ9)
WRITE (4) 'TOTAL MARINE OFFICERS   =' #MARN-OFF (EM=ZZZ,ZZ9)
WRITE (4) 'TOTAL MARINE NCO"S      =' #MARN-NCO (EM=ZZZ,ZZ9)
END
