* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* 
* PROGRAM-ID: ATHPextr - extract info for alon marketing processing
*
*************************************************************************
* USER DATE       TAG  MODIFICATION
* JNT  09/17/2013 JT1  Address normalization
*                      should #CITY be part of #NAME-EXTR? 
*************************************************************************
*
DEFINE DATA
LOCAL USING ADDA0001                            /* JT1 
LOCAL
1 ST-V VIEW OF A-STATUS
 2 WIDOW-FLAG            (A1)
 2 MEMBER-FLAG           (A1)
 2 ID-NUMBER             (N6)
 2 NAME                  (A25)
 2 RANK                  (A3)
*  2 ADDRESS-1             (A25)                /* JT1 start
*  2 ADDRESS-2             (A25)
*  2 ADDRESS-3             (A25)
*  2 ZIP-CODE              (N9)
*  2 REDEFINE ZIP-CODE
*   3 ZIP-CODE-5           (A5)                      
 2 MEMBER-CONTACT-ID                            /* JT1 end
 2 NUMBER-MEMBERSHIPS    (P1)
*
1 #NAME-EXTR
 2 #FIRST-NAME           (A15)
 2 #MIDDLE-INIT          (A1)
 2 #LAST-NAME            (A15)
 2 #RANK                 (A3)
 2 #STATE                (A2)
 2 #ZIP-5                (A5)
1 #CITY                 (A18)                   /* JT1 is #CITY intentionally a level 1??                   
*
1 #LAST                  (A25)
1 #FIRST-MID             (A25)
1 #EXTRA1                (A25)
1 #EXTRA2                (A25)
1 #FIRST                 (A25)
1 #MIDDLE                (A25)
1 #DELIVERY-ADDR         (A25)
1 #CITY-STATE            (A25)
1 #STATE-FULL            (A25)
1 REDEFINE #STATE-FULL
 2 #STATE-XX             (A2)
 2 #STATE-REMAINING      (A23)
1 #CITY-1                (A25)
1 #CITY-2                (A25)
1 #CITY-3                (A25)
1 #CITY-4                (A25)
1 #CITY-5                (A25)
1 #CITY-6                (A25)
1 #CITY-7                (A25)
1 #CITY-8                (A25)
1 #CITY-9                (A25)
1 #COUNTERS
  2 #RECS-READ        (P7)
  2 #RECS-WRITTEN     (P7)
  2 #RECS-SELECTED    (P7)
  2 #CNT              (P7)
  2 #I1               (I2)
  2 #I2               (I2)
*
END-DEFINE
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
*
* * * * * * * REPORT HEADER * * * * * *
FORMAT  LS=133 PS=76
WRITE  TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
               'name extract'
               5X 'DATE: '*DAT4U 5X 'TIME: ' *TIMX  //
*
READ ST-V BY MEMBER-KEY FROM '000200'
  ADD +1 TO #RECS-READ
*
  IF NUMBER-MEMBERSHIPS = 0
    ESCAPE TOP
  END-IF
  ADD +1 TO #RECS-SELECTED
*
  PERFORM BUILD-EXTRACT
END-READ
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE BUILD-EXTRACT
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*
MOVE ST-V.RANK TO #RANK
SEPARATE ST-V.NAME LEFT INTO #LAST #FIRST-MID #EXTRA1 #EXTRA2
                             WITH DELIMITER ','
SEPARATE #FIRST-MID LEFT INTO #FIRST #MIDDLE #EXTRA1 #EXTRA2
                              WITH DELIMITER ' '
MOVE #LAST TO #LAST-NAME
MOVE #FIRST TO #FIRST-NAME
MOVE #MIDDLE TO #MIDDLE-INIT
*
  RESET #PDA-ADDRESS                                          /* JT1
  #ADD-TYPE        := 'P'                                     /* JT1
  #ADD-CONTACT-ID := ST-V.MEMBER-CONTACT-ID                   /* JT1
  CALLNAT 'ADDN0001' #PDA-ADDRESS                             /* JT1
  MOVE #ADD-CITY  TO #CITY
  MOVE #ADD-STATE TO #STATE
  MOVE #ADD-ZIP5  TO #ZIP-5                                                  
*
WRITE WORK 2 #NAME-EXTR
ADD 1 TO #RECS-WRITTEN
*
END-SUBROUTINE
*
WRITE 'TOTAL RECS READ    =' #RECS-READ
WRITE 'TOTAL RECS selected=' #RECS-SELECTED
WRITE 'TOTAL RECS written  ' #RECS-WRITTEN
*
END
