* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
******** CONVERTED TO NATURAL BY SOFTWARE AG ON 07/09/05 ********
*
* COMPOPT:RENT,RES,OPT,LIB
* LINKOPT:RENT,AMODE=31,RMODE=ANY
*  PROGRAM-ID. ATHP10P2.
* AUTHOR. PAUL C MCDONALD.
* INSTALLATION. AAFMAA
* DATE-COMPILED.  TODAY.
* REMARKS.   WAS AM10A0P2                            VERSION 10.3.
*               10.1  $ RECORD
*               10.2  CHECK FULL PAGE EVERY LINE
*               10.3  CHANGED REPORT HEADING FOR NEW NAME 0487CVA
*        SUB-PROGRAM TO FORMAT THE FILE MAINT REG.
*
*            THIS SUBPROGRAM IS CALLED INTO THE COMPUTER
*            BY M10A0, THE MAIN LINE PROGRAM.  ALL FORMATTING
*            OF PRINT LINES AND ACCUMULATING OF TOTALS IS
*            DONE BY THIS SUBPROGRAM.  ALL I/O INSTRUCTIONS ARE
*            LOCATED IN THE MAIN PROGRAM.
*            AN ACTION CODE IS PASSED BETWEEN THE MAIN PROGRAM
*            AND THIS SUBPROGRAM FOR COMMUNICATING BACK AND
*            FORTH.  ALSO, THE PRINT TAPE RECORD AND THE FORMATTED
*            PRINTER LINE ARE PASSED.
*********************************************************************
* Converted to Natural by SAGUK ( UKALI ) on 07/09/05
********************** MODIFICATIONS ********************************
** Tag    Date      Who     Description
** RHC  02/06/2006 SAG-AB Replaced PDA with GDA and Callnats with Fetches to
**                 programs that were formerly Cobol calls.
* bz  06/09/2013  Rebranding (Search for AAFMAA)
*********************************************************************
DEFINE DATA
**                        RHC  02/06/2006 SAG-AB START incorporated into Global
GLOBAL USING ATHG10P0
**01 MICRO-RESPONSE                   (A3)
**01 TIN1
**  02 TIN1-SEQ                       (A19)
**  02 REDEFINE TIN1-SEQ
**    03 TIN1-SECT                    (A1)
**    03 TIN1-ID                      (A9)
**    03 TIN1-DATE                    (A6)
**    03 TIN1-TRANCD                  (A3)
**  02 FILLER-20
**    03 TIN1-TYPE                    (A1)
**    03 TIN1-PRIORDT                 (A6)
**    03 TIN1-DATA                    (A125)
**    03 TIN1-NAME                    (A25)
**    03 TIN1-CERTNO                  (A6)
**    03 REDEFINE TIN1-CERTNO
**      04 TIN1-CERT                  (N6)
**    03 TIN1-SERVNO                  (A10)
**    03 FILLER-21                    (A8)
**    03 TIN1-CLERK                   (A4)
**    03 TIN1-TERMINAL                (A4)
**    03 TIN1-TRDATE                  (A6)
**    03 TIN1-TRTIME                  (A6)
**
**01 POUT1                            (A133)
**01 REDEFINE POUT1
**  02 POUT1-CC                       (A1)
**  02 POUT1-DATA                     (A132)
**01 COMMUN1
**  02 ACT-CODE                       (A1)
**  02 RUN-DATE                       (A8)
**  02 REDEFINE RUN-DATE
**    03 RD-MM                        (N2)
**    03 RD-DD                        (N2)
**    03 RD-YYYY                      (N4)
**  02 RUN-ORDER                      (A1)
**01 LINK-WORD
**  02 FRAME-COUNT                    (P4)
**  02 FICHE-COUNT                    (P4)
**  02 MAX-FICHE                      (P4)
**  02 MAX-LINES                      (P4)
**  02 LINE-COUNT                     (P4)
**  02 FRAME-KEY                      (A25)
**  02 TITLE-OPTION                   (A1)
**  02 MF-TITLE                       (A32)
**  02 TITLE-UP                       (N1)
**  02 ADVANCE-CODE                   (A2)
**  02 PRINT-LINE
**    03 PL-CC                        (A1)
**    03 PL-DATA                      (A132)
**  02 FZ-ACTION-SW                   (N1)
**
**01 GO-CODE                          (P2)
**                         RHC  02/06/2006 SAG-AB END  incorporated into Global
LOCAL
01 PAN-VALET                        (A24) INIT <'002ATHP10P2  03/24/89'>
**01 HD-TINSEQ                        (A19)
**01 LINE-CT                          (P3) INIT <66>
**01 PAGE-CT                          (P5)
**01 MAX-LINE                         (P2) INIT <57>
**01 AC1                              (P7)
01 DATE-CODE                        (A1)
01 DATE1                            (A6)
01 DATE2                            (A8)
**01 PRT-X                            (P1)
01 HDG1
  02 FILLER-1                       (A38) INIT <'1'>
  02 FILLER-2                       (A86) INIT <'AAFMAA'>
  02 FILLER-3                       (A4) INIT <'PAGE'>
**02 HDG1-PGNO                      (N5)                /* EDS 08/23/2006
  02 HDG1-PGNO                      (A5)                /* EDS 08/23/2006
01 REDEFINE HDG1
  02 HDG1/ALPHA                     (A133)
**01 HDG2                                               SAG-AB 20060822 REMOVED TO GLOBAL
**  02 FILLER-4                       (A37)
**  02 FILLER-5                       (A56) INIT <'FILE MAINTENANCE REGISTER - ID ORDER AS OF'>
**  02 HDG2-DATE                      (A10)
**  02 REDEFINE HDG2-DATE
**    03 HD-MM                        (N2)
**    03 HD-X1                        (A1)
**    03 HD-DD                        (N2)
**    03 HD-X2                        (A1)
**    03 HD-YYYY                      (N4)
**01 REDEFINE HDG2
**  02 HDG2/ALPHA                     (A103)
01 HDG3                             (A118) INIT <'0   ID                                                 LAST    CURRENT            CLERK   TERMINAL   TRANS'>
01 HDG4                             (A118) INIT <'  NUMBER            NAME                               DATE      DATE            NUMBER    NUMBER    DATE     TIME'>
01 LINE1                            (A116)
01 REDEFINE LINE1
  02 FILLER-8                       (A1)
  02 LN1-ID                         (A9)
  02 FILLER-9                       (A2)
  02 LN1-NAME                       (A25)
  02 FILLER-10                      (A1)
  02 LN1-SERVNO                     (A10)
  02 FILLER-11                      (A5)
  02 LN1-LDT                        (A8)
  02 FILLER-12                      (A2)
  02 LN1-DATE                       (A8)
  02 FILLER-13                      (A2)
  02 LN1-POL                        (A6)
  02 REDEFINE LN1-POL
    03 LN1-CERT                     (N6) (EM=Z99999)
  02 FILLER-14                      (A3)
  02 LN1-CLERK                      (A4)
  02 FILLER-15                      (A6)
  02 LN1-TERMINAL                   (A4)
  02 FILLER-16                      (A3)
  02 LN1-TRDATE                     (A8)
  02 FILLER-17                      (A3)
  02 LN1-TRTIME                     (A6)
01 LINE2                            (A133)
01 REDEFINE LINE2
  02 FILLER-18                      (A4)
  02 LN2-NAME                       (A4)
  02 LN2-DATA                       (A125)
01 LINE3
  02 FILLER-19                      (A28) INIT <'1M10A0 FILE MAINT REG TOTALS'>
  02 LN3-TOT                        (A12)                    /* EDS - PM 20060920
* 02 LN3-TOT                        (N7) (EM=Z,ZZZ,ZZ9)     /* EDS - PM 20060920
01 REDEFINE LINE3
  02 LINE3/ALPHA                    (A40)                   /* SAG-AB 20061011 was A35
01 TIN1-CERTNO--Q000
  02 TIN1-CERTNO--R000              (N6)
*
01 DISP-DATE                        (A8)
01 REDEFINE DISP-DATE
  02 DD-MM                          (N2)
  02 DD-X1                          (A1)
  02 DD-DD                          (N2)
  02 DD-X2                          (A1)
  02 DD-YY                          (N2)
01 WORK-DATE                        (A6)
01 REDEFINE WORK-DATE
  02 WD-MM                          (N2)
  02 WD-DD                          (N2)
  02 WD-YY                          (N2)
*
01 BYPASS-GO-CODE-CHECK             (L)
*
END-DEFINE
*
DECIDE ON EVERY VALUE OF ACT-CODE
  VALUE 'D'
**  ESCAPE BOTTOM             /* SAG-AB 20060821
    IGNORE                    /* SAG-AB 20060821
  VALUE 'C'
*   MOVE AC1 TO LN3-TOT                        /* EDS - PM 20060920
    MOVE EDITED AC1 (EM=Z,ZZZ,ZZ9) TO LN3-TOT  /* EDS - PM 20060920
    MOVE LINE3/ALPHA TO POUT1/ALPHA
    MOVE 3 TO GO-CODE
    MOVE 'L' TO ACT-CODE
    ESCAPE MODULE
  VALUE 'B'
    IF MICRO-RESPONSE = 'YES'
      MOVE 60 TO P10P2.MAX-LINE
    END-IF
    MOVE RD-MM TO P10P2-HD-MM
    MOVE '/' TO P10P2-HD-X1
    MOVE RD-DD TO P10P2-HD-DD
    MOVE '/' TO P10P2-HD-X2
    MOVE RD-YYYY TO P10P2-HD-YYYY
    MOVE 'K' TO ACT-CODE
    ESCAPE MODULE
  NONE VALUES
    MOVE TRUE TO BYPASS-GO-CODE-CHECK
END-DECIDE
*
IF BYPASS-GO-CODE-CHECK
  MOVE FALSE TO BYPASS-GO-CODE-CHECK
ELSE
**DECIDE ON EVERY VALUE OF GO-CODE  /* SAG-AB 20060821
  DECIDE ON FIRST VALUE OF GO-CODE  /* SAG-AB 20060821
    VALUE 1
      ADD 1 TO P10P2.LINE-CT
      ADD 1 TO AC1
      IF P10P2.LINE-CT > P10P2.MAX-LINE
        MOVE 2 TO P10P2.PRT-X
        PERFORM HDGA
        MOVE 'L' TO ACT-CODE
      ELSE
        MOVE 'J' TO ACT-CODE
      END-IF
    VALUE 2
      ADD 1 TO P10P2.LINE-CT
      IF TIN1-TYPE-P2 = '1'
        MOVE 'OLD ' TO LN2-NAME
      ELSE
        MOVE 'NEW ' TO LN2-NAME
      END-IF
      MOVE TIN1-DATA-P2 TO LN2-DATA
      MOVE LINE2 TO POUT1/ALPHA
      MOVE 1 TO GO-CODE
      MOVE 'L' TO ACT-CODE
    VALUE 3
      MOVE 'M' TO ACT-CODE
      MOVE 'FILE MAINT TOTALS' TO FRAME-KEY
    VALUE 4
      ADD 1 TO P10P2.PAGE-CT
**    MOVE P10P2.PAGE-CT TO HDG1-PGNO                       /* EDS 08/23/2006
      MOVE EDITED P10P2.PAGE-CT (EM=ZZZZ9) TO HDG1-PGNO    /* EDS 08/23/2006
      MOVE HDG1/ALPHA TO POUT1/ALPHA
      MOVE 5 TO GO-CODE
      MOVE 'L' TO ACT-CODE
    VALUE 5
      MOVE P10P2-HDG2/ALPHA TO POUT1/ALPHA
      MOVE 6 TO GO-CODE
      MOVE 'L' TO ACT-CODE
    VALUE 6
      MOVE HDG3 TO POUT1/ALPHA
      MOVE 7 TO GO-CODE
      MOVE 'L' TO ACT-CODE
    VALUE 7
      MOVE HDG4 TO POUT1/ALPHA
      MOVE 8 TO GO-CODE
      MOVE 'L' TO ACT-CODE
    VALUE 8
      MOVE 6 TO P10P2.LINE-CT
      MOVE TIN1-ID-P2 TO FRAME-KEY
      IF P10P2.PRT-X = 1
        PERFORM LINE1A
        MOVE 'L' TO ACT-CODE
      ELSE
        MOVE 'J' TO ACT-CODE
      END-IF
**    ANY VALUES                  /* SAG-AB 20060821
**      ESCAPE MODULE             /* SAG-AB 20060821
    NONE VALUES
      WRITE 'INVALID GO-CODE ' GO-CODE
  END-DECIDE
  ESCAPE MODULE                   /* SAG-AB 20060821
END-IF
*
IF TIN1-SEQ-P2 = HD-TINSEQ
  IF TIN1-TYPE-P2 = '1'
    MOVE 'OLD ' TO LN2-NAME
  ELSE
    MOVE 'NEW ' TO LN2-NAME
  END-IF
  MOVE TIN1-DATA-P2 TO LN2-DATA
  MOVE LINE2 TO POUT1/ALPHA
  MOVE 1 TO GO-CODE
ELSE
  MOVE TIN1-SEQ-P2 TO HD-TINSEQ
  IF P10P2.LINE-CT > P10P2.MAX-LINE
    MOVE 1 TO P10P2.PRT-X
    PERFORM HDGA
  ELSE
    PERFORM LINE1A
  END-IF
END-IF
MOVE 'L' TO ACT-CODE
ESCAPE MODULE
*
**********************************************************************
*
DEFINE SUBROUTINE LINE1A
*
MOVE TIN1-ID-P2 TO LN1-ID
MOVE TIN1-NAME-P2 TO LN1-NAME
MOVE TIN1-CLERK-P2 TO LN1-CLERK
IF TIN1-TERMINAL-P2 EQ '<not'             /* SAG-AB 20061012
  MOVE 'PS10' TO LN1-TERMINAL             /* SAG-AB 20061012
ELSE                                      /* SAG-AB 20061012
  MOVE TIN1-TERMINAL-P2 TO LN1-TERMINAL
END-IF                                    /* SAG-AB 20061012
MOVE TIN1-PRIORDT-P2 TO WORK-DATE
MOVE WD-MM TO DD-MM
MOVE '/' TO DD-X1
MOVE WD-DD TO DD-DD
MOVE '/' TO DD-X2
MOVE WD-YY TO DD-YY
MOVE DISP-DATE TO LN1-LDT
MOVE TIN1-DATE-P2 TO WORK-DATE
MOVE WD-MM TO DD-MM
MOVE '/' TO DD-X1
MOVE WD-DD TO DD-DD
MOVE '/' TO DD-X2
MOVE WD-YY TO DD-YY
MOVE DISP-DATE TO LN1-DATE
MOVE TIN1-TRDATE-P2 TO WORK-DATE
MOVE WD-MM TO DD-MM
MOVE '/' TO DD-X1
MOVE WD-DD TO DD-DD
MOVE '/' TO DD-X2
MOVE WD-YY TO DD-YY
MOVE DISP-DATE TO LN1-TRDATE
MOVE TIN1-TRTIME-P2 TO LN1-TRTIME
MOVE LINE1 TO POUT1/ALPHA
MOVE 2 TO GO-CODE
*
END-SUBROUTINE
*
**********************************************************************
*
DEFINE SUBROUTINE HDGA
*
IF MICRO-RESPONSE NE 'Y' AND P10P2.PAGE-CT = 0
  MOVE '$-A001' TO POUT1/ALPHA
  MOVE 4 TO GO-CODE
ELSE
  ADD 1 TO P10P2.PAGE-CT
**MOVE P10P2.PAGE-CT TO HDG1-PGNO                     /* EDS 08/26/2006
  MOVE EDITED P10P2.PAGE-CT (EM=ZZZZ9) TO HDG1-PGNO   /* EDS 08/26/2006
  MOVE HDG1/ALPHA TO POUT1/ALPHA
  MOVE 5 TO GO-CODE
END-IF
*
END-SUBROUTINE
*
END
