* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ATHPYET3 - exclude duplicates
************************************************************************
*                       MODIFICATION LOG                               *
* USER DATE     TAG  REASON                                            *
* SAG  12012005 RH1  SS - Replaced the HEX constant '05' (Tab position)*
*                    EBCDIC to HEX code '09' ASCII                     *
************************************************************************
DEFINE DATA
LOCAL
* 1 #TAB     (A1) INIT <H'05'>     /* SAG RH1 12012005 SS
1 #TAB       (A1) INIT <H'09'>     /* SAG RH1 12012005 SS
*
1 #YETM-EXTRACT     (A200)
1 REDEFINE #YETM-EXTRACT
 2 #YE-CN       (N6)
 2 #YE-REMAIN   (A194)
*
1 ST-V VIEW OF A-STATUS
 2 ID-NUMBER            (N6)
 2 PROCESS-IND
 2 INTRO-FLAG
 2 ISSUE-DATE     (1)
*
1 #COUNTERS
  2 #RECS-READ        (P5)
  2 #RECS-WRITTEN     (P5)
  2 #CNT              (P5)
  2 #CNT-2            (P5)
  2 #CNT-3            (P5)
  2 #I1               (I2)
  2 #I2               (I2)
1 #ERR-MSG   (A60)
*
1 #YYYYMMDD        (N8)
1 REDEFINE #YYYYMMDD
  2 #YYYY-A        (A4)
  2 #MM-A          (A2)
  2 #DD-A          (A2)
1 REDEFINE #YYYYMMDD
  2 #YYYYMM        (N6)
  2 REDEFINE #YYYYMM
    3 #YYYY          (N4)
    3 #MM            (N2)
  2 #DD            (N2)
*
1 #LAST-ID           (N6)
1 #STAT-NOT-FND       (L)
1 #NUM-ST-EXISTS      (P7)
1 #YE-CN-LAST  (N6)
1 #CN    (N6)
1 REDEFINE #CN
 2 #CN-A    (A6)
*
END-DEFINE
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
*
* * * * * * * REPORT HEADER * * * * * *
*
FORMAT  LS=133 PS=58
WRITE   TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
     'Y/E Terminated Extract Exceptions'
                        5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
FORMAT (2) LS=133 PS=58
WRITE  (2) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
     'Y/E Terminated Extract'
                        5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
FORMAT (3) LS=133 PS=58
WRITE  (3) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
     'Y/E Terminated Extract - ST exists'
                        5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
COMPRESS 'CN'
    #TAB 'SSN'
    #TAB 'PROCESS-IND'
    #TAB 'INTR-FLG'
    #TAB 'DOB'
    #TAB 'DOD'
    #TAB 'FIRST-name'
    #TAB 'MI'
    #TAB 'Last'
    #TAB 'addr-1'
    #TAB 'ADDR-2'
    #TAB 'ADDR-3'
    #TAB 'ZIP-CODE'
    #TAB 'TERM-CODE'
    #TAB 'TERM-DATE'
        INTO #YETM-EXTRACT LEAVING NO
  WRITE WORK FILE 2 #YETM-EXTRACT
*
*
READ WORK 1 RECORD #YETM-EXTRACT
* IF #RECS-READ GT 1900
*   ESCAPE BOTTOM
* END-IF
*
  ADD +1 TO #RECS-READ
  IF #YE-CN = #YE-CN-LAST
    ESCAPE TOP
  END-IF
*
  MOVE #YE-CN TO #YE-CN-LAST
*
  WRITE WORK FILE 2 #YETM-EXTRACT
  ADD 1 TO #RECS-WRITTEN
  ADD 1 TO #CNT-2
  DISPLAY (2) #CNT-2
    'CN' #YE-CN
    'REMAINING' #YE-REMAIN
     (EM=XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX)
*
END-WORK
*
WRITE 'Recs-read =' #RECS-READ
WRITE 'num-recs  ='  #RECS-WRITTEN
*
END
