* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ATHP07P8    - build CERTIFIED Notice file
************************************************************************
*                       MODIFICATION LOG
* USER DATE     TAG  REASON
* SAG  11292005 RH1  SS - Modified the custom coded ON ERROR stmt &    *
*                    replaced it with copycode GABNDCX3                *
* SAG  12012005 RH1  SS - Replaced the HEX constant '05' (Tab position)*
*                    EBCDIC to HEX code '09' ASCII                     *
* SAG-AB 20060820  workaround for zip code truncation of leading zeros in suffix
* DRW  08302006 DW2  Build Non-Certified Notice detail file
* DRW  08302006 DW3  bypass AFSC Notices
* RSE  10012009 RE1  Change 600K logic for Unification
* bz   11/19/2009 bz1  effected but not modified - no Status Record
************************************************************************
DEFINE DATA
PARAMETER
1 #AAFM-NOTC          (P5)
1 #CN                 (N6)
1 #MODE               (A1)
1 #RUN-DT-MM-DD-YYYY  (A10)
1 #TOT-AMT-DUE        (A11)
1 #PRM-DUE-MM-DD-YYYY (A11)
1 #AAFM-BAR-CODE-1    (A32)
1 #AAFM-BAR-CODE-2    (A32)
1 #SCR-BAR-CD-SUPPRESSED (A48)
1 #SPS-GEN-NAME      (A29)
1 REDEFINE #SPS-GEN-NAME
 2 #FOR              (A4)  /* 'For '     /* DW3
 2 #INSURED-NAME     (A25)               /* DW3
1 #SPS-GEN-CN        (A14)
1 REDEFINE #SPS-GEN-CN
 2 #WITH             (A8)  /* 'With CN ' /* DW3
 2 #INSURED-CN       (A6)                /* DW3
1 #RID-DISP          (A12)
*
1 #SCR-TEXT          (A73/22)
1 #SCR-TYPE-IND      (A14)
1 REDEFINE #SCR-TYPE-IND
 2 #SCR-TYPE-IND-3   (A3)
*
1 #SCR-MBR-NAME-FULL  (A35)
1 #DEAR-NAME          (A50)
1 #CERT-ADDR-1        (A25)
1 #CERT-ADDR-2        (A25)
1 #CERT-ADDR-3        (A25)
1 #CERT-ZIP-5         (A5)
1 #CERT-ZIP-4         (A4)
1 #LAST-SEG           (I2)
1 #LST-POL-NUM        (A16)
1 #MULT-NOTC          (A4)
*
LOCAL  USING GONERLXX                       /* SAG RH1 11292005 SS
LOCAL
* 1 #TAB     (A1) INIT <H'05'>     /* SAG RH1 12012005 SS
1 #TAB       (A1) INIT <H'09'>     /* SAG RH1 12012005 SS
1 #NOTC-OUT    (A250)  /* DW2
1 #ZIP         (A10)
*
1 #I1              (I2)
1 #I2              (I2)
1 #P-X1            (I2)
1 #P-X2            (I2)
*
1 #DUE-LINES   (A78/16)
1 #TEXT-LINES  (A78/8)
*
1 #FREQ       (A11)
1 #ABEND-CODE  (I4)
1 #SPLIT    (A1)
1 #STREET   (A25)
1 #STREET-2 (A25)
1 #CITY     (A22)
1 #STATE    (A2)
1 #ERR-MSG  (A60)
*
1 #FULL-RECORD
 2 #FULL-REC  (A125/10)
 2 REDEFINE #FULL-REC
  3 #FULL-REC-75 (A75/16) /* to write temp
*
1 #REC-250    (A250)
1 REDEFINE #REC-250
 2 #REC-125-A (A125)
 2 REDEFINE #REC-125-A
  3 #REC-62-A (A62) /* to write temp
  3 #REC-63-A (A63) /* to write temp
 2 #REC-125-B (A125)
 2 REDEFINE #REC-125-B
  3 #REC-62-B (A62) /* to write temp
  3 #REC-63-B (A63) /* to write temp
1 REDEFINE #REC-250
 2 #REC-250-X   (A1/250)
*
END-DEFINE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*
ON ERROR
*    WRITE   / '*E R R O R - N R    ' *ERROR-NR      /* SAG RH1 11292005 SS - BEGIN
*             / '*E R R O R - L I N E' *ERROR-LINE
*     WRITE   / ' FILLER'
*     WRITE   / ' FILLER'
*     WRITE   / ' FILLER'
*     MOVE +4095 TO #ABEND-CODE
*     CALL 'ABEND' USING #ABEND-CODE  /* USER 4095
  INCLUDE GABNDCX3
  STOP                                                 /* SAG RH1 11292005 SS - END
END-ERROR
*
IF #CERT-ZIP-4 NE ' '                              /* SAG-AB 20060820
  MOVE RIGHT JUSTIFIED #CERT-ZIP-4 TO #CERT-ZIP-4  /* SAG-AB 20060820
  EXAMINE #CERT-ZIP-4 FOR ' ' REPLACE WITH '0'     /* SAG-AB 20060820
END-IF
*
IF #AAFM-NOTC = 1
  RESET #FULL-REC (*) #P-X2
  COMPRESS
         'TYPE'
    #TAB 'CN'
    #TAB 'FREQ'
    #TAB 'RUN-DATE'
    #TAB 'DUE-DATE'
    #TAB 'TOT-DUE'
    #TAB 'NAME'
    #TAB 'DEAR-NAME'
    #TAB 'STREET'
    #TAB 'STREET-2'
    #TAB 'CITY'
    #TAB 'ST'
    #TAB 'ZIP'
    #TAB 'SPS/GEN NAME'
    #TAB 'SPS/GEN CN'
    #TAB 'BAR-CODE-1'
    #TAB 'BAR-CODE-2'
    #TAB 'BC-SUPPRESSED-MSG'
    #TAB 'RID-DISP'
    #TAB 'LN-1'
    #TAB 'LN-2'
    #TAB 'LN-3'
    #TAB 'LN-4'
    #TAB 'LN-5'
    #TAB 'LN-6'
    #TAB 'LN-7'
    #TAB 'LN-8'
    #TAB 'LN-9'
    #TAB 'LN-10'
    #TAB 'LN-11'
    #TAB 'LN-12'
    #TAB 'LN-13'
      INTO #REC-250 LEAVING NO    /* # 2
*
  PERFORM COMBINE-125
*
  COMPRESS #REC-250
    #TAB 'LN-14'
    #TAB 'LN-15'
    #TAB 'LN-16'
    #TAB 'VARIABLE TEXT'
      INTO #REC-250 LEAVING NO
*
  PERFORM COMBINE-125
*
  IF #REC-125-A NE ' '
    ADD 1 TO #P-X2
    MOVE #REC-125-A TO #FULL-REC (#P-X2)
  END-IF
*
  WRITE WORK FILE 4 #FULL-RECORD
*
  COMPRESS 'Insured-CN'    /* DW2
   #TAB 'TYPE'
   #TAB 'TOT-BILL'
   #TAB 'Insured-Name'
   #TAB 'Owner-CN'
   #TAB 'Owner-Name'
   #TAB 'ADDR1'
   #TAB 'ADDR2'
   #TAB 'ADDR3'
   #TAB 'ZIP'
    INTO #NOTC-OUT   LEAVING NO
  WRITE WORK FILE 7 #NOTC-OUT  /* Detail File of CERTS for AAFM to use
END-IF
*
* IF #CN GE 600000  /* DW3      RE1
IF AFFL-ONLY-CLIENT(<#CN>)   /* RE1
  ESCAPE ROUTINE
END-IF
*
MOVE 'S' TO #SPLIT
RESET #STREET #STREET-2 #CITY #STATE
CALLNAT 'GCTSTSXX'  /* split city/state
 #SPLIT
 #CERT-ADDR-1
 #CERT-ADDR-2
 #CERT-ADDR-3
 #STREET
 #STREET-2
 #CITY
 #STATE
 #ERR-MSG
*
RESET #I2 #DUE-LINES (*) #TEXT-LINES (*)
FOR #I1 6 TO 22
  ADD 1 TO #I2
  MOVE #SCR-TEXT (#I1) TO #DUE-LINES (#I2)
* DISPLAY #I1 #SCR-TEXT (#I1) (EM=XXXXXXXXXXXXXXXXXXXXXX)
*  #I2 #DUE-LINES (#I2) (EM=XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX)
  IF  (#SCR-TEXT (#I1) = MASK ('AMOUNT PAYABLE')) /* Normal Prem Bill
   OR (#I2 GE 16)     /* All other types
    RESET #I2
    ADD 1 TO #I1
    FOR #I1 #I1 TO 22
      ADD 1 TO #I2
      IF #I2 GT 8
        ESCAPE BOTTOM
      END-IF
*
      MOVE #SCR-TEXT (#I1) TO #TEXT-LINES (#I2)
* DISPLAY #I1 #SCR-TEXT (#I1) (EM=XXXXXXXXXXXXXXXXXXXXXX)
*  #I2 #DUE-LINES (#I2) (EM=XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX)
    END-FOR
  END-IF
END-FOR
*
IF #MODE = 'A'
  MOVE 'Annual' TO #FREQ
ELSE
  IF #MODE = 'S'
    MOVE 'Semi-annual' TO #FREQ
  ELSE
    IF #MODE = 'Q'
      MOVE 'Quarterly' TO #FREQ
    ELSE
      MOVE 'Monthly' TO #FREQ
    END-IF
  END-IF
END-IF
*
*
RESET #FULL-REC (*) #P-X2
COMPRESS
  #SCR-TYPE-IND-3
  #TAB #CN
  #TAB #FREQ
  #TAB #RUN-DT-MM-DD-YYYY
  #TAB #PRM-DUE-MM-DD-YYYY
  #TAB #TOT-AMT-DUE
  #TAB #SCR-MBR-NAME-FULL   /* 35
  #TAB #DEAR-NAME           /* 50
  #TAB #STREET              /* 25
  #TAB #STREET-2            /* 25
  #TAB #CITY                /* 25
  #TAB #STATE               /* 2
  #TAB #CERT-ZIP-5 #CERT-ZIP-4   /* 9
    INTO #REC-250 LEAVING NO
*
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #SPS-GEN-NAME
  #TAB #SPS-GEN-CN
  #TAB #AAFM-BAR-CODE-1
  #TAB #AAFM-BAR-CODE-2
  #TAB #SCR-BAR-CD-SUPPRESSED
  #TAB #RID-DISP
  #TAB #DUE-LINES (1)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (2)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (3)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (4)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (5)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (6)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (7)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (8)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (9)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (10)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (11)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (12)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (13)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (14)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (15)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #DUE-LINES (16)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
  #TAB #TEXT-LINES (1)
    INTO #REC-250 LEAVING NO
PERFORM COMBINE-125
*
COMPRESS #REC-250
      #TEXT-LINES (2)
    INTO #REC-250
PERFORM COMBINE-125
*
COMPRESS #REC-250
      #TEXT-LINES (3)
    INTO #REC-250
PERFORM COMBINE-125
*
COMPRESS #REC-250
      #TEXT-LINES (4)
    INTO #REC-250
PERFORM COMBINE-125
*
COMPRESS #REC-250
      #TEXT-LINES (5)
    INTO #REC-250
PERFORM COMBINE-125
*
COMPRESS #REC-250
      #TEXT-LINES (6)
    INTO #REC-250
PERFORM COMBINE-125
*
COMPRESS #REC-250
      #TEXT-LINES (7)
    INTO #REC-250
PERFORM COMBINE-125
*
COMPRESS #REC-250
      #TEXT-LINES (8)
    INTO #REC-250
PERFORM COMBINE-125
*
IF #REC-125-A NE ' '
  ADD 1 TO #P-X2
  MOVE #REC-125-A TO #FULL-REC (#P-X2)
END-IF
*
WRITE WORK FILE 4 #FULL-RECORD
*
MOVE LEFT #TOT-AMT-DUE TO #TOT-AMT-DUE       /* DW3
COMPRESS #CERT-ZIP-5 #CERT-ZIP-4 INTO #ZIP WITH '-'
IF #INSURED-CN = ' '
  MOVE #CN TO #INSURED-CN
END-IF
*
IF #INSURED-NAME = ' '
  MOVE #SCR-MBR-NAME-FULL TO #INSURED-NAME
END-IF
*
COMPRESS #INSURED-CN       /* DW2
   #TAB #SCR-TYPE-IND-3
   #TAB #TOT-AMT-DUE
   #TAB #INSURED-NAME
   #TAB #CN
   #TAB #SCR-MBR-NAME-FULL
   #TAB #CERT-ADDR-1
   #TAB #CERT-ADDR-2
   #TAB #CERT-ADDR-3
   #TAB #ZIP
  INTO #NOTC-OUT   LEAVING NO
 WRITE WORK FILE 7 #NOTC-OUT /* Detail File of Certifieds for AAFM
*
* * * * * * * * * * * * * * *
DEFINE SUBROUTINE COMBINE-125
* * * * * * * * * * * * * * *
*
IF #REC-125-B NE ' '
  ADD 1 TO #P-X2
  MOVE #REC-125-A TO #FULL-REC (#P-X2)
  MOVE #REC-125-B TO #REC-125-A
  RESET #REC-125-B
END-IF
*
END-SUBROUTINE
*
END
