DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
* New Parameter Data Area AUCAER01.
*
* :author nguentchev
* TODO: Enter your data definitions here
1 #AUCerror
  2 ErrorCode (I4)
  2 ErrorDescription (A) DYNAMIC
  2 ErrorTag (A) DYNAMIC
END-DEFINE
