* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
/** New Subprogram AUCNCOG1.
/**
/** :author nguentchev
/* TODO: Enter your code here
DEFINE DATA
PARAMETER
1 #CONTACT-ID          (N8)
1 #XML-OUTPUT          (A) DYNAMIC
LOCAL USING AUCAHI01
LOCAL USING AUCAPI01
LOCAL USING AUCAMI01
LOCAL USING AUCAMS01
LOCAL USING AUCARL01
LOCAL
1 #XML-TEMP            (A) DYNAMIC
1 CNT-V VIEW OF A-CONTACTS
1 #GET         (I4) CONST <0>
END-DEFINE
*
COMPRESS        '<?xml version="1.0" encoding="' *CODEPAGE '"?>'
  INTO #XML-OUTPUT LEAVING NO
COMPRESS FULL #XML-OUTPUT  '<Contact'
  '>' INTO #XML-OUTPUT LEAVING NO
COMPRESS  #XML-OUTPUT
  '<ContactID'
  '>' INTO #XML-OUTPUT LEAVING NO
COMPRESS NUMERIC #XML-OUTPUT
  #CONTACT-ID
  '</ContactID>' INTO #XML-OUTPUT LEAVING NO
*
RESET HeaderInfo
HeaderInfo.ContactID := #CONTACT-ID
HeaderInfo.ActionType := #GET
CALLNAT 'AUCNHIM1' HeaderInfo
RESET #XML-TEMP
CALLNAT 'AUCNHIS1' #XML-TEMP HeaderInfo
COMPRESS #XML-OUTPUT #XML-TEMP INTO #XML-OUTPUT
*
RESET PersonalInfo
PersonalInfo.ContactID := #CONTACT-ID
PersonalInfo.ActionType := #GET
CALLNAT 'AUCNPIM1' PersonalInfo
RESET #XML-TEMP
CALLNAT 'AUCNPIS1' #XML-TEMP PersonalInfo
COMPRESS #XML-OUTPUT #XML-TEMP INTO #XML-OUTPUT
*
CALLNAT 'AUCNADG1' #CONTACT-ID #XML-TEMP
COMPRESS #XML-OUTPUT #XML-TEMP INTO #XML-OUTPUT
*
CALLNAT 'AUCNPHG1' #CONTACT-ID #XML-TEMP
COMPRESS #XML-OUTPUT #XML-TEMP INTO #XML-OUTPUT
*
CALLNAT 'AUCNEMG1' #CONTACT-ID #XML-TEMP
COMPRESS #XML-OUTPUT #XML-TEMP INTO #XML-OUTPUT
*
CALLNAT 'AUCNCRG1' #CONTACT-ID #XML-TEMP
COMPRESS #XML-OUTPUT #XML-TEMP INTO #XML-OUTPUT
*
RESET MilitaryInfo
MilitaryInfo.ContactID := #CONTACT-ID
MilitaryInfo.ActionType := #GET
CALLNAT 'AUCNMIM1' MilitaryInfo
RESET #XML-TEMP
CALLNAT 'AUCNMIS1' #XML-TEMP MilitaryInfo
COMPRESS #XML-OUTPUT #XML-TEMP INTO #XML-OUTPUT
*
RESET MembershipInfo
MembershipInfo.ContactID := #CONTACT-ID
MembershipInfo.ActionType := #GET
CALLNAT 'AUCNMSM1' MembershipInfo
RESET #XML-TEMP
CALLNAT 'AUCNMSS1' #XML-TEMP MembershipInfo
COMPRESS #XML-OUTPUT #XML-TEMP INTO #XML-OUTPUT
*
COMPRESS FULL #XML-OUTPUT  '</Contact'
  '>' INTO #XML-OUTPUT LEAVING NO
END
