DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*  BWAGWABA PARAMETER DATA AREA TO
*  MATCH WAGE HISTORY TABLE IN
*  BCOMMGXX
1 #CGA-WAGE-HIST (60)
  2 #CGA-WAGE-YR (N4)
  2 #CGA-WAGE-FLAG (A1)
  2 #CGA-WAGE-AMT (P7)
  2 #CGA-WAGE-MAX (P7) /*FICA WAGE MAXES
  2 #CGA-WAGE-AMT-FW (P7/2) /*AFTER APPLYING FREE WAGES
END-DEFINE
