* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: C1002NAT
************************************************************************
*                       MODIFICATION LOG                               *
* USER     DATE      TAG     REASON                                    *
*                                                                      *
* NGG    03/09/2011  None    Program written                           *
* NGG    03/22/2011  NG1     Synch Contact rank-id
************************************************************************
*
DEFINE DATA
PARAMETER
1 AT-ISN                (P8)  /* populated
1 #RANK-DATA                  /* populated
  2 #BRANCH             (A3)
  2 #RANK-ID            (N6)
  2 #RANK-IN-SAS        (A3)
LOCAL
*
1 AT-V VIEW A-APPL-TRACKING
  2 RANK
  2 RANK-ID
  2 MIL-SERVICE
  2 MIL-STATUS
  2 MEMBER-CN    (A6) 2 REDEFINE MEMBER-CN
    3 MEMBER-CN-N (N6)
1 MEMBER VIEW OF A-STATUS          /* NG1
  2 MEMBER-CONTACT-ID
1 CONTACT VIEW OF A-CONTACTS       /* NG1
  2 RANK-ID
END-DEFINE
*
IF AT-ISN = 0
  ESCAPE ROUTINE
END-IF
GET AT-V AT-ISN
IF *ISN = 0
  ESCAPE ROUTINE
END-IF
AT-V.MIL-SERVICE := #BRANCH
AT-V.RANK-ID     := #RANK-ID
AT-V.RANK        := #RANK-IN-SAS
UPDATE
IF MEMBER-CN-N > 0                             /* NG1
  FIND (1) MEMBER WITH ID-NUMBER = MEMBER-CN-N
    FIND (1) CONTACT WITH CONTACT-ID = MEMBER-CONTACT-ID
      CONTACT.RANK-ID := #RANK-ID
      UPDATE
    END-FIND
  END-FIND
END-IF
*
END
