DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PH
  2 #HOME
    3 #H_PH1 (N3)
    3 #H_PH2 (N3)
    3 #H_PH3 (N4)
    3 #H_PH4 (N6)
    3 #H-PH-ID (N8)
  2 #WORK
    3 #W_PH1 (N3)
    3 #W_PH2 (N3)
    3 #W_PH3 (N4)
    3 #W_PH4 (N6)
    3 #W-PH-ID (N8)
  2 #CELL
    3 #C_PH1 (N3)
    3 #C_PH2 (N3)
    3 #C_PH3 (N4)
    3 #C-PH-ID (N8)
  2 #PREFF (A1)
END-DEFINE
