DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 APPL-TRACK-V VIEW OF A-APPL-TRACKING
  2 CONTACT-ID (N8)
  2 NAME (A25)
  2 DATE-OF-BIRTH (N8.0)
  2 ACTION-FLAG (A1)
  2 INTRO-FLAG (A1)
  2 CAP-IND (A1)
  2 APPL-SOURCE (A7)
  2 RANK (A3)
  2 ID-NUMBER (N6.0) /*
  2 MIL-STATUS (A1) /*
  2 MIL-SERVICE (A3)
  2 REFERING-ID-NUMBER (N6.0/1:2) /*OCCURS 2 TIMES
END-DEFINE
