DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*         Determine possible auto issue amount based on member type
1 #PDA-C1103LAI
  2 #C1103LAI-ID-NUMBER (N6.0)
  2 REDEFINE #C1103LAI-ID-NUMBER /* BEGIN REDEFINE: #C1103LAI-I
    3 #C1103LAI-ID-NUMBER-A (A6)
  2 #C1103LAI-MILITARY-STATUS (A1)
  2 #C1103LAI-MILITARY-SERVICE (A3)
END-DEFINE
