DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*        Determine possible auto issue amount based on member type
1 #PDA-AUTO-ISSUE-AMOUNT
  2 #AUTO-ISSUE-INTRO-FLAG (A1)
  2 #AUTO-ISSUE-AGE (N3.0)
  2 #AUTO-ISSUE-STATUS (A1)
  2 #AUTO-ISSUE-SERVICE (A3)
  2 #AUTO-ISSUE-KEY-FOUND (L)
END-DEFINE
