* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*** <@ NATURAL META INFORMATION BEGIN
***
*** @Mode Structured
***
*** NATURAL META INFORMATION END @>
* PGM-ID: C1620SCO - Conservation Options - process signature scr 2
************************************************************************
*                       MODIFICATION LOG                               *
* USER DATE      TAG  REASON                                           *
*                                                                      *
* DRW  12272004  DW1  Increase variable loan to handle 999,999.99.     *
* DRW  06262006  DW2  Add DUES PMT TO letter                           *
* YAK  04192007  YK1  Change letter text for Retiree                   *
* YAK  11282007  YK2  Use all letter changes for Retirees paying by    *
*                     DFAS in letters for active duty members as well  *
* DRW 06/06/2008 DW3  Add ALOT-CHG-AUTH "A" checking                   *
* PAM 03/17/2009 PM4  Replaced Rick Browett with Clifton Brown         *
* DRW 09/17/2009 DW5  Process-ind Changes                              *
* PAM 10/21/2010 PM6  Adjusted extensions for department moves         *
* VXT 11/02/2011 vt1  Add #SALUTATION to the parm bloc                 *
* bz1 27/07/2012      Add Text (OI-1171)
* bz  06/09/2013  Rebranding (Search for AAFMAA)
* vxt 04/30/2018 vt2  /Ticket HD-8765/                                 *
************************************************************************
DEFINE DATA
*
PARAMETER
*
1 #CGA-ISN          (P8)
1 #CGA-SCR-COMMAND  (A2)
1 #CGA-SCR-ID       (N9)
1 #CGA-SCR-SUFFIX   (A3)
1 #CGA-CLERK        (A3)
1 #TODAY-YYYYMMDD   (N8)
1 REDEFINE #TODAY-YYYYMMDD
  2 #TODAY-YYYY       (N4)
  2 #TODAY-MM         (N2)
  2 #TODAY-DD         (N2)
1 #RANK-LITERAL  (A23)
1 #LAST-NAME     (A25)
1 #FORMATED-NAME (A35)
1 #FIRST-LAST    (A25)
1 #COMP-1035     (A50)
1 #SCR-MAX-LINES (P3)
1 #SCR-POLS      (A76)
1 #CERT-INFO
  2 #CERT      (A12)
  2 #CERT-COM  (A13)
  2 #CERT-COL  (A13)
1 #P-X        (I2)
1 #T-X        (I2)
1 #CT-LOAN-AMT  (P6.2)  /* DW1
1 #CT-ACC-INT   (P5.2)
*
1 #CONV-TBL-POLS   (9)        /* 9 possible certs
  2 #CT-POL-NUM        (A14)
  2 #CT-ISS-DT         (N8)
  2 #CT-CONV-DUR       (N3)
  2 #CT-ISSUE-DATE     (A10)
  2 #CT-CURR-PLAN      (A6)
  2 #CT-FREQ           (A11)
  2 #CT-CURR-FACE      (N7.2)
  2 #CT-CURR-CSV       (N7.2)
  2 #CT-CURR-DB        (N9.2)
  2 #CT-PRORAT-LN-INT  (N6.2)   /* DW1
*
  2 #CONV-TBL-TYPES (16)   /* 16 possible conversion types
    3 #CT-SELECT            (A1)
    3 #CT-TO-PLAN           (A6)
    3 #CT-TERM-FACE         (N7.2)
    3 #CT-NU-PREM           (N5.2)
    3 #CT-NU-DB             (N9.2)
    3 #CT-AMT-LUMP-SUM      (N9.2)
    3 #CT-PREMS-PAID        (N9.2)
    3 #CT-TAXABLE-INC       (N9.2)
    3 #CT-TAMRA-IND         (A1)
    3 #CT-RPU-LOAN-IND      (A1)
    3 #CT-BYPASS            (L)
    3 #CT-INS-REQ           (L)
    3 #CT-DUES-PAID         (N3.2)   /* Dw2
*
1 #INTRO-FLAG             (A1)
1 #PROCESS-IND            (A1)
1 #INSURED-NAME           (A35)
1 #SCR-ZIP-BAR-CODE  (A14)
1 #FIRST-ADDRESS     (A70)
1 #SECOND-ADDRESS    (A70)
1 #THIRD-ADDRESS     (A70)
1 #DEBIT-CREDIT-AMT  (P7.2)
1 #NUM-OWNERS        (N3)
1 #MULT-OWNERS       (N6/8)
1 REDEFINE #MULT-OWNERS
  2 #MULT-OWNERS-A    (A6/8)
1 #MIL-STATUS        (A1)          /* YK1
1 #ALOT-CHG-AUTH     (A1)          /* YK1
1 #MODE              (A1)          /* YK2
1 #salutation        (a) DYNAMIC                /* vt1
1 #MEC               (A1)
*
LOCAL
*
1 #CO-LINES   (A78/60) /* 21 * 2 = 42 for 2 screens
1 REDEFINE #CO-LINES
  2 #CO-OCC      (60)
    3 #FIL1       (A3)
    3 #CO-ISS-DT  (A10)
    3 #FLL2       (A3)
    3 #CO-FM-TYPE (A6)
    3 #FIL3       (A3)
    3 #CO-TO-TYPE (A6)
    3 #FIL4       (A2)
    3 #CO-DB      (A10)
    3 #FLL5       (A2)
    3 #CO-PREM    (A6)
    3 #FIL6       (A2)
    3 #CO-COST    (A11)
    3 #FIL7       (A4)
    3 #CO-TAX-INC (A10)
1 REDEFINE #CO-LINES
  2 #CO-OCC-2    (60)
    3 #FIL8       (A12)
    3 #CO-NAME    (A25)
    3 #FIL9       (A41)
*
1 #I1   (I2)
1 #I2   (I2)
1 #I3   (I2)
1 #OWN-NAME      (A25)
1 #LAST          (A25)
1 #FIRST-MID     (A25)
1 #EXT1          (A25)
1 #EXT2          (A25)
1 #EXT3          (A25)
*
1 ST-V VIEW OF A-STATUS
  2 NAME
*
1 #SCR-CSV-HEADER  (A34)
1 #FACE-DISP     (A7)
1 #CGA-SCR-ID2   (N9)
*
1 #MONTHS (A36)  INIT
  <'JanFebMarAprMayJunJulAugSepOctNovDec'>
1 REDEFINE #MONTHS
  2 #MON       (A3/12)
*
END-DEFINE
* * * * * * * * * * * * * * * * *
*
* WRITE 'top c1620sco num-owners=' #NUM-OWNERS
MOVE #CGA-SCR-ID TO #CGA-SCR-ID2
*
IF #CT-TO-PLAN (#P-X, #T-X) = 'RSGN'       /* full RSGN
  IF (#PROCESS-IND = 'G' OR = 'S')                            /* DW5
      AND (NOT #INTRO-FLAG = 'S' OR = 'K' OR = 'G')
    RESET #CO-LINES (*) #I1
*
    PERFORM SERVICE-WARNING
    PERFORM SIGNATURE-LINE
*
    IF *DEVICE = 'BATCH'
      WRITE (8) NOTITLE USING FORM 'C1620FCO'
*
      WRITE (8) NOTITLE USING FORM 'C1613FCO'
    ELSE
      INPUT USING MAP 'C1620MCO'
      INPUT USING MAP 'C1613MCO'
*
      IF #CGA-SCR-COMMAND NE '*'
        FETCH 'G1000PXX'
      END-IF
    END-IF
  END-IF
*
  ESCAPE ROUTINE
END-IF
*
IF #CT-TO-PLAN (#P-X, #T-X) = 'CSV'       /* full CSV
  RESET #CO-LINES (*) #I1
  MOVE 'Full Cash Surrender of Certificate' TO #SCR-CSV-HEADER
  ADD 2 TO #I1
  COMPRESS 'For' #CERT-COL #SCR-POLS INTO #CO-LINES (#I1)
  ADD 2 TO #I1
* COMPRESS 'Member"s Name:' #INSURED-NAME INTO #CO-LINES (#I1)
  COMPRESS 'Owner"s Name:' #FORMATED-NAME INTO #CO-LINES (#I1)
*
  IF #NUM-OWNERS GT 1
    FOR #I2 1 TO 8
      IF #MULT-OWNERS (#I2) NE 0
        FIND ST-V WITH MEMBER-KEY = #MULT-OWNERS-A (#I2)
          SEPARATE ST-V.NAME LEFT INTO #LAST #FIRST-MID #EXT1 #EXT2 #EXT3
            WITH DELIMITER ','
          COMPRESS #FIRST-MID #LAST #EXT1 #EXT2 #EXT3 INTO #OWN-NAME
          ADD 1 TO #I1
          COMPRESS 'Owner"s Name:' #CO-LINES (#I1) #OWN-NAME
            INTO #CO-LINES (#I1)
        END-FIND
      END-IF
    END-FOR
  END-IF
*
  IF #CT-SELECT (#P-X, #T-X) = '2'   /* 1035-EXCHANGE
    ADD 2 TO #I1
    COMPRESS 'For a 1035 Exchange with' #COMP-1035 INTO #CO-LINES (#I1)
    ADD 2 TO #I1
    COMPRESS 'We have received paper work signed and dated by you'
      'assigning the above'   INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'Certificates to the above named Insurance Company'
      'indicating your intention' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'to exchange the above Certificates as part of a 1035'
      'Exchange under IRS' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    MOVE 'Section Code 1035.' TO #CO-LINES (#I1)
    ADD 2 TO #I1
    COMPRESS 'With respect to the above Certificates I certify that'
      'other than the above' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'mentioned owner (if different from the insured), no'
      'person, firm, or' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'corporation other than myself and the insurer that issued'
      'the above'      INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'Certificates, has an interest in said Certificates. I'
      'certify no proceedings'  INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'in insolvency or bankruptcy have been instituted by or'
      'against me. I'  INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'understand this 1035 Exchange will terminate my'
      'Membership and Services'   INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'with AAFMAA and that this action'  INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'releases AAFMAA from all liabilities associated with'
      'Membership and'  INTO #CO-LINES (#I1)
    ADD 1 TO #I1
*   IF #MIL-STATUS = 'R' AND #MODE = 'G'                        /* YK2
    IF #MODE = 'G'                                              /* YK3
      COMPRESS 'the above Certificates. My allotment will be adjusted'
        'by AAFMAA.' TO #CO-LINES (#I1)                         /* YK1
    ELSE                                                        /* YK1
      MOVE 'the above Certificates.' TO #CO-LINES (#I1)
    END-IF                                                      /* YK1
  ELSE
    ADD 2 TO #I1
    COMPRESS 'I hereby surrender the above certificate(s) for all'
      'cash surrender'   INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'value, I understand that full surrender will'
      'cancel and terminate (i) the' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'Certificate(s) and (ii) all rights, privileges'
      'and insurance which the ' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'Certificate(s) provides. I further understand that as'
      'a result of such' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'surrender, except for payment to me of the Certificate"s'
      'cash surrender' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'value, the entire liability of AAFMAA is completely terminated'
      INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    MOVE 'and discharged.'
      TO #CO-LINES (#I1)
    ADD 2 TO #I1
    MOVE 'I represent and warrant to the Association that:'
      TO #CO-LINES (#I1)
    ADD 2 TO #I1
    COMPRESS '   1. The Certificate(s) has/have not been assigned'
      'by me, in whole'  INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    MOVE     '      or in part: and' TO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS '   2. I have not named an irrevocable beneficiary;'
      'and'  INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS '   3. The Certificate(s) is/are not subject to any'
      'lien, security'  INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    MOVE     '      interest, encumbrance or legal claim; and'
      TO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS '   4. I am not a party to any pending, nor do I'
      'presently intend' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS '      to be a party to any future, bankruptcy'
      'proceedings; and' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS '   5. I have received, read and understand the'
      'attached form that' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS '      discusses the tax consequences of surrendering'
      'my Certificate(s).' INTO #CO-LINES (#I1)
*                                                                  /*       bz1
    IF #MEC = 'Y'
      ADD 1 TO #I1
      COMPRESS
        '   6. Since this is a MEC policy, AAFMAA is required to withhold 10% of the'
        INTO #CO-LINES (#I1)
      ADD 1 TO #I1
      COMPRESS
        '      total distribution IAW IRS code 3405 and applicable US Treasury'
        INTO #CO-LINES (#I1)
      ADD 1 TO #I1
      COMPRESS
        '      Regulation unless you elect not to do so.'
        INTO #CO-LINES (#I1)
      ADD 1 TO #I1
      COMPRESS
        '      I understand I can revoke this election at any time, the election'
        INTO #CO-LINES (#I1)
      ADD 1 TO #I1
      COMPRESS
        '      remains effective until revoked, and I am liable for payment of'
        INTO #CO-LINES (#I1)
      ADD 1 TO #I1
      COMPRESS
        '      Federal income tax on the taxable portion of the distribution and'
        INTO #CO-LINES (#I1)
      ADD 1 TO #I1
      COMPRESS
        '      any penalties that may be incurred.'
        INTO #CO-LINES (#I1)
      ADD 2 TO #I1
      COMPRESS
        '      You must initial one of the following options.'
        INTO #CO-LINES (#I1)

      ADD 2 TO #I1
      COMPRESS
        '     (___)I do not want any Federal income tax withheld from this distribution.'
        INTO #CO-LINES (#I1)
      ADD 2 TO #I1
      COMPRESS
        '     (___)I do want Federal income tax withheld from this distribution.'
        INTO #CO-LINES (#I1)
    END-IF
*                                                                           /*   bz1  end
  END-IF
*
  PERFORM SERVICE-WARNING
  ADD 2 TO #I1
  COMPRESS '____________________________________________'
    '       (Date) ____________' INTO #CO-LINES (#I1)
*
  IF #NUM-OWNERS GT 1
    COMPUTE #I3 = #NUM-OWNERS - 1
    FOR #I2 1 TO #I3
      IF #I1 LT 45
        ADD 2 TO #I1
        COMPRESS '____________________________________________'
          '       (Date) ____________' INTO #CO-LINES (#I1)
      END-IF
    END-FOR
*
    ADD 1 TO #I1
    MOVE '(Signature of Owners)' TO #CO-LINES (#I1)
  ELSE
    ADD 1 TO #I1
    COMPRESS '(Signature) ' #FORMATED-NAME
      INTO #CO-LINES (#I1)
  END-IF
*
  ADD 1 TO #I1
  COMPRESS #SCR-POLS INTO #CO-LINES (#I1)
  MOVE #CGA-CLERK TO #CO-TAX-INC (#I1)
*
  IF *DEVICE = 'BATCH'
    WRITE (8) NOTITLE USING FORM 'C1620FCO'
*
    IF (#PROCESS-IND= 'G' OR = 'S')                      /* DW5
        AND (NOT #INTRO-FLAG = 'S' OR = 'K' OR = 'G')
      WRITE (8) NOTITLE USING FORM 'C1613FCO'
    END-IF
  ELSE
    INPUT USING MAP 'C1620MCO'
*
*   IF #CGA-SCR-COMMAND NE '*'
*     FETCH 'G1000PXX'
*   END-IF
*
    INPUT USING MAP 'C1621MCO'
*
*   IF #CGA-SCR-COMMAND NE '*'
*     FETCH 'G1000PXX'
*   END-IF
*
*    PRINT *LINE 'Lines:' #i1
    FOR #I1 43 TO 60
      IF #CO-LINES (#I1) NE ' '
        INPUT USING MAP 'C1612MCO'
        ESCAPE BOTTOM
      END-IF
    END-FOR
*
*   IF #CGA-SCR-COMMAND NE '*'
*     FETCH 'G1000PXX'
*   END-IF
*
    IF (#PROCESS-IND= 'G' OR = 'S')                      /* DW5
        AND (NOT #INTRO-FLAG = 'S' OR = 'K' OR = 'G')
      INPUT USING MAP 'C1613MCO'
*
*     IF #CGA-SCR-COMMAND NE '*'
*       FETCH 'G1000PXX'
*     END-IF
    END-IF
  END-IF
*
  ESCAPE ROUTINE
END-IF
*
IF  (#CT-TO-PLAN (#P-X, #T-X) = 'CSV')       /* full CSV
    OR (#CT-TO-PLAN (#P-X, #T-X) = MASK ('$'))  /* csv split
  RESET #CO-LINES (*) #I1
  IF #CT-TO-PLAN (#P-X, #T-X) = 'CSV'       /* full CSV
    MOVE 'CASH SURRENDER VALUE FORM' TO #SCR-CSV-HEADER
    ADD 2 TO #I1
    COMPRESS 'For' #CERT-COL #SCR-POLS INTO #CO-LINES (#I1)
  ELSE
    MOVE 'PARTIAL CASH SURRENDER VALUE FORM' TO #SCR-CSV-HEADER
    ADD 2 TO #I1
    MOVE EDITED #CT-TERM-FACE (#P-X, #T-X) (EM=ZZZ,ZZ9) TO #FACE-DISP
    COMPRESS '$' #FACE-DISP ' Face value of insurance from'
      #CERT #SCR-POLS INTO #CO-LINES (#I1)
  END-IF
*
  IF #CT-SELECT (#P-X, #T-X) = '2'   /* 1035-EXCHANGE
    ADD 2 TO #I1
    COMPRESS 'For a 1035 Exchange with' #COMP-1035 INTO #CO-LINES (#I1)
  END-IF
*
  ADD 2 TO #I1
  MOVE     'TO SECRETARY, AAFMAA:'
    TO #CO-LINES (#I1)
  IF #CT-TO-PLAN (#P-X, #T-X) = 'CSV'       /* full CSV
    IF #CT-SELECT (#P-X, #T-X) NE '2'   /* 1035-EXCHANGE
      ADD 2 TO #I1
      COMPRESS '  I, a member of AAFMAA'
        ', holding'     INTO #CO-LINES (#I1)
      ADD 1 TO #I1
      COMPRESS 'above numbered' #CERT-COM 'hereby direct that any'
        'benefit which would' INTO #CO-LINES (#I1)
      ADD 1 TO #I1
      COMPRESS 'become payable by said Association in the event of'
        'my death by reason of'    INTO #CO-LINES (#I1)
      ADD 1 TO #I1
      COMPRESS 'the above' #CERT 'shall be paid to my estate.'
        INTO #CO-LINES (#I1)
    END-IF
  END-IF
*
  IF #CT-TO-PLAN (#P-X, #T-X) = 'CSV'       /* full CSV
    ADD 2 TO #I1
    COMPRESS '  I hereby surrender the above' #CERT 'of membership'
      'in AAFMAA'      INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'and request payment'
      'of the cash value of the'INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'insurance proceeds accrued under the above' #CERT
      'as provided in' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'Section 10, Article V of the Constitution of the Army'
      'and Air Force Mutual'         INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    MOVE 'Aid Association.' TO #CO-LINES (#I1)
  ELSE
    ADD 2 TO #I1
    COMPRESS '  I hereby surrender $' #FACE-DISP 'face value of'
      'insurance in AAFMAA'  INTO #CO-LINES (#I1)
*
    ADD 1 TO #I1
    COMPRESS 'and request payment'
      'of the cash value of the'INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'insurance proceeds accrued under that portion of my'
      'insurance as provided in' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'Section 10, Article V of the Constitution of AAFMAA.'
      INTO #CO-LINES (#I1)
  END-IF
*
  ADD 2 TO #I1
  COMPRESS '  In accepting this payment I surrender all rights'
    'and privileges for'           INTO #CO-LINES (#I1)
  ADD 1 TO #I1
  COMPRESS 'myself and all other persons by reason of my ever'
    'having been a member'         INTO #CO-LINES (#I1)
*
  IF #CT-TO-PLAN (#P-X, #T-X) = 'CSV'       /* full CSV
    ADD 1 TO #I1
    COMPRESS 'of said AAFMAA'
      'under the above numbered'     INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'surrendered' #CERT 'and I certify that no person,'
      'firm, or corporation'       INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'nor any governmental authority has any claim or right'
      'to assert claim against'      INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'said Association for the insurance proceeds for which'
      'I seek payment.'            INTO #CO-LINES (#I1)
  ELSE
    ADD 1 TO #I1
    COMPRESS 'of said AAFMAA'
      'under $' #FACE-DISP 'face' INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'value of insurance and I certify that no person,'
      'firm, or corporation'       INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'nor any governmental authority has any claim or right'
      'to assert claim against'      INTO #CO-LINES (#I1)
    ADD 1 TO #I1
    COMPRESS 'said Association for the insurance proceeds for which'
      'I seek payment.'            INTO #CO-LINES (#I1)
  END-IF
*
  ADD 2 TO #I1
  COMPRESS '  I further certify that I am under no legal'
    'obligation to continue present'    INTO #CO-LINES (#I1)
  ADD 1 TO #I1
  COMPRESS 'designation of beneficiary to receive AAFMAA'
    INTO #CO-LINES (#I1)
  ADD 1 TO #I1
  COMPRESS 'insurance benefits in case of'
    'my death under the aforesaid'      INTO #CO-LINES (#I1)
  ADD 1 TO #I1
  COMPRESS 'surrendered' #CERT 'of membership and that'
    'contract or obligation by'     INTO #CO-LINES (#I1)
  ADD 1 TO #I1
  COMPRESS 'no Court decree, am I ordered, required, enjoined'
    'or obligated to maintain'       INTO #CO-LINES (#I1)
  ADD 1 TO #I1
  MOVE     'the present beneficiary designation.'
    TO #CO-LINES (#I1)
  ADD 1 TO #I1
  COMPRESS '  I further certify that I am not at present, and that I do'
    'not contemplate'   INTO #CO-LINES (#I1)
  ADD 1 TO #I1
  COMPRESS 'or anticipate that I will voluntarily or involuntarily'
    'be the subject'          INTO #CO-LINES (#I1)
  ADD 1 TO #I1
  COMPRESS 'of any bankruptcy proceedings or wage earners plan'
    'under bankruptcy laws.'           INTO #CO-LINES (#I1)
  ADD 1 TO #I1
  COMPRESS '  I further certify that I have received the attached'
    'form dealing with'           INTO #CO-LINES (#I1)
  ADD 1 TO #I1
  COMPRESS 'possible income tax implications related to this'
    'transaction.'           INTO #CO-LINES (#I1)
*
* Add text for retirees allotment                    /* YK1
* IF #MIL-STATUS = 'R' AND #MODE = 'G'               /* YK2
  IF #MODE = 'G'                                     /* YK3
    IF (NOT #ALOT-CHG-AUTH = 'Y' OR = 'S' OR = 'A')     /* DW7
      ADD 1 TO #I1
      COMPRESS 'I hereby authorize AAFMAA to contact DFAS on my '
        'behalf to adjust' INTO #CO-LINES (#I1)
      ADD 1 TO #I1
      COMPRESS 'my allotment accordingly.' INTO #CO-LINES (#I1)
    END-IF
  END-IF                                             /* YK1

  IF   (#CT-TO-PLAN (#P-X, #T-X) = 'CSV')       /* full CSV
      AND (#PROCESS-IND= 'G' OR = 'S')                  /* DW5
      AND (NOT #INTRO-FLAG = 'S' OR = 'K' OR = 'G')
    PERFORM SERVICE-WARNING
  END-IF
*
  IF #CT-TAMRA-IND (#P-X, #T-X) = 'Y'
    ADD 2 TO #I1
    MOVE     '___ I have read and understand the TAMRA restrictions.'
      TO #CO-LINES (#I1)
  END-IF
*
* IF #CT-TO-PLAN (#P-X, #T-X) NE 'CSV'
  PERFORM SIGNATURE-LINE
* END-IF
*
  IF *DEVICE = 'BATCH'
    WRITE (8) NOTITLE USING FORM 'C1620FCO'
*
    IF (#PROCESS-IND= 'G' OR = 'S')                   /* DW5
        AND (NOT #INTRO-FLAG = 'S' OR = 'K' OR = 'G')
      WRITE (8) NOTITLE USING FORM 'C1613FCO'
    END-IF
  ELSE
    INPUT USING MAP 'C1620MCO'
*
*   IF #CGA-SCR-COMMAND NE '*'
*     FETCH 'G1000PXX'
*   END-IF
*
    INPUT USING MAP 'C1621MCO'
*
*   IF #CGA-SCR-COMMAND NE '*'
*     FETCH 'G1000PXX'
*   END-IF
*
    FOR #I1 43 TO 48
      IF #CO-LINES (#I1) NE ' '
        INPUT USING MAP 'C1612MCO'
        ESCAPE BOTTOM
      END-IF
    END-FOR
*
*   IF #CGA-SCR-COMMAND NE '*'
*     FETCH 'G1000PXX'
*   END-IF
*
    IF (#PROCESS-IND = 'G' OR = 'S')                  /* DW5
        AND (NOT #INTRO-FLAG= 'S' OR = 'K' OR = 'G')
      INPUT USING MAP 'C1613MCO'
*
      IF #CGA-SCR-COMMAND NE '*'
        FETCH 'G1000PXX'
      END-IF
    END-IF
  END-IF
END-IF
*
* * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE SERVICE-WARNING
* * * * * * * * * * * * * * * * *
*
IF (NOT #PROCESS-IND = 'G' OR = 'S')            /* DW5
    OR (#INTRO-FLAG = 'S' OR = 'K' OR = 'G')
  ESCAPE ROUTINE
END-IF
*
ADD 2 TO #I1
COMPRESS 'IMPORTANT: In order to maintain status and services as'
  'a grandfathered member,' INTO #CO-LINES (#I1)
ADD 1 TO #I1
COMPRESS 'grandfathered members must continuously satisfy two'
  'requirements: (1) Continue'  INTO #CO-LINES (#I1)
ADD 1 TO #I1
COMPRESS 'in good standing as an AAFMAA member from and after'
  '30 June 2000; and'   INTO #CO-LINES (#I1)
ADD 1 TO #I1
COMPRESS '(2) Continue in good standing at least one life insurance'
  'policy which was'   INTO #CO-LINES (#I1)
ADD 1 TO #I1
COMPRESS 'issued on or before 30 June 2000, which includes a'
  'charge for services, either'   INTO #CO-LINES (#I1)
ADD 1 TO #I1
COMPRESS 'imbedded or additional. Any grandfathered member who'
  'terminates all life' INTO #CO-LINES (#I1)
ADD 1 TO #I1
COMPRESS 'insurance policies issued prior to 1 July 2000 forfeits'
  'his or her grand-' INTO #CO-LINES (#I1)
ADD 1 TO #I1
COMPRESS 'fathered status and living services. Every member"s in-force'
  'policy still' INTO #CO-LINES (#I1)
ADD 1 TO #I1
COMPRESS 'includes Survivor Assistance Services to the member"s family'
  '(see services'  INTO #CO-LINES (#I1)
ADD 1 TO #I1
COMPRESS 'retained on attached graph). Please review services'
  'lost for the grandfathered'        INTO #CO-LINES (#I1)
ADD 1 TO #I1
COMPRESS 'living services you may lose. If you have any doubt'
  'this transaction' INTO #CO-LINES (#I1)
ADD 1 TO #I1
COMPRESS 'will cause you to lose your grandfathered status, call'
******  'AAFMAA at' INTO #CO-LINES (#I1)                                           /* vt2
  'AAFMAA Policy Services' INTO #CO-LINES (#I1)                                    /* vt2
ADD 1 TO #I1
* COMPRESS '1-800-522-5221 and ask for Rick Browett ext 202 or Kathie'  /* PM4
* COMPRESS '1-800-522-5221 and ask for Clifton Brown ext 202 or Kathie' /* PM4 PM6
*   'Ballard ext 302.' INTO #CO-LINES (#I1)                             /* PM6
* COMPRESS '1-800-522-5221 and ask for Clifton Brown ext 4530 or Kathie'  /* PM6   /* vt2
*   'Ballard ext 4521.' INTO #CO-LINES (#I1)                              /* PM6   /* vt2
COMPRESS 'at 800-336-4538.' INTO #CO-LINES (#I1)                                   /* vt2
*
IF #CT-TO-PLAN (#P-X, #T-X) = 'RSGN'
  ADD 2 TO #I1
  COMPRESS  'To process your request both this form and the'
    'resignation request form'  TO #CO-LINES (#I1)
  ADD 1 TO #I1
  COMPRESS  'must be signed and returned.'
    TO #CO-LINES (#I1)
END-IF
*
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE SIGNATURE-LINE
* * * * * * * * * * * * * * * * * * *
ADD 1 TO #I1
COMPRESS '____________________________________________'
  '       (Date) ____________' INTO #CO-LINES (#I1)
*
IF #NUM-OWNERS GT 1
  COMPUTE #I3 = #NUM-OWNERS - 1
  FOR #I2 1 TO #I3
    ADD 2 TO #I1
    COMPRESS '____________________________________________'
      '       (Date) ____________' INTO #CO-LINES (#I1)
  END-FOR
*
  ADD 1 TO #I1
  MOVE '(Signatures)' TO #CO-LINES (#I1)
ELSE
  ADD 1 TO #I1
  COMPRESS '(Signature) ' #FORMATED-NAME INTO #CO-LINES (#I1)
END-IF
*
ADD 1 TO #I1
MOVE #SCR-POLS TO #CO-LINES (#I1)
MOVE #CGA-CLERK TO #CO-TAX-INC (#I1)
*
END-SUBROUTINE
*
END
