DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 SINGLE-35-PREM (N4.2/1:85) INIT
  (1) <0>
  (2) <0>
  (3) <265.84>
  (4) <269.52>
  (5) <273.34>
  (6) <277.29>
  (7) <281.39>
  (8) <285.63>
  (9) <290.01>
  (10) <294.55>
  (11) <299.24>
  (12) <304.11>
  (13) <309.14>
  (14) <314.33>
  (15) <319.72>
  (16) <325.28>
  (17) <331.03>
  (18) <336.97>
  (19) <343.11>
  (20) <349.45>
  (21) <355.99>
  (22) <362.75>
  (23) <369.74>
  (24) <376.97>
  (25) <384.45>
  (26) <392.21>
  (27) <400.25>
  (28) <408.48>
  (29) <416.92>
  (30) <425.59>
  (31) <434.48>
  (32) <443.61>
  (33) <452.95>
  (34) <462.51>
  (35) <472.29>
  (36) <482.30>
  (37) <492.59>
  (38) <503.04>
  (39) <513.67>
  (40) <524.50>
  (41) <535.57>
  (42) <546.89>
  (43) <558.28>
  (44) <569.77>
  (45) <581.39>
  (46) <593.17>
  (47) <605.14>
  (48) <617.08>
  (49) <629.03>
  (50) <641.02>
  (51) <653.10>
  (52) <665.31>
  (53) <677.20>
  (54) <688.83>
  (55) <700.24>
  (56) <711.49>
  (57) <722.61>
  (58) <733.44>
  (59) <744.03>
  (60) <754.43>
  (61) <764.73>
  (62) <775.00>
  (63) <784.80>
  (64) <794.21>
  (65) <803.31>
  (66) <812.19>
  (67) <820.92>
  (68) <829.28>
  (69) <837.29>
  (70) <844.99>
  (71) <852.43>
  (72) <859.65>
  (73) <866.70>
  (74) <873.64>
  (75) <880.54>
  (76) <887.44>
  (77) <894.41>
  (78) <901.51>
  (79) <908.82>
  (80) <916.46>
  (81) <924.69>
  (82) <933.81>
  (83) <944.11>
  (84) <955.34>
  (85) <966.03>
END-DEFINE
