* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PGM-ID: C2152SPO - load Initial labels for PO
*
DEFINE DATA
PARAMETER USING C2150APO
*
LOCAL
*
1 #WL-DSC-1 (A78) INIT <'VALUE-ADDED gives you the protection of'
   -' Permanent Life insurance PLUS the'>
1 #WL-DSC-2 (A78) INIT <'investment growth found in Interest Sensitive'
   -' Life insurance. Your insurance'>
1 #WL-DSC-3 (A78) INIT <'grows in 2 ways: cash value accumulation'
   -' and an increased death benefit.'>
1 #WL-DSC-4 (A78) INIT <'There are several payment plans. One time'
   -' payment is subject to provisions'>
1 #WL-DSC-5 (A78) INIT <'of TAMRA. Call our Membership Department for'
   -' details.'>
*
1 #RT-DSC-1 (A78) INIT <'5 YEAR RENEWABLE TERM INSURANCE is designed'
   -' to cover insurance needs that'>
1 #RT-DSC-2 (A78) INIT <'will change over time. Based on your age at'
   -' issue , and written for five year'>
1 #RT-DSC-3 (A78) INIT <'intervals, it provides automatic renewable'
   -' after five years at a higher rate'>
1 #RT-DSC-4 (A78) INIT <'schedule. This insurance is not renewable'
   -' after age 70.'>
*
1 #LT-DSC-1 (A78) INIT <'LEVEL TERM INSURANCE to age 50 has a fixed'
   -' price and a level benefit for non'>
1 #LT-DSC-2 (A78) INIT <'smokers until age 50. At age 50 (age 40 for'
   -' smokers) the plan converts to a'>
1 #LT-DSC-3 (A78) INIT <'Decreasing Term plan and terminates at age'
   -' 60 (age 50 for smokers). It log-'>
1 #LT-DSC-4 (A78) INIT <'ically would be converted to the 5 Year Ren'
   -'ewable Term at age 50 (age 40 for'>
1 #LT-DSC-5 (A78) INIT <'smokers). PRIOR TO AGE 48 (AGE 38 FOR SMOKER'
   -'S) THIS POLICY CAN BE CONVERTED'>
1 #LT-DSC-6 (A78) INIT <'TO A 5 YEAR RENEWABLE TERM PLAN WITHOUT A'
   -' PHYSICAL EXAM.'>
1 #REFUND-1-ONLINE (A78)
*
1 #I1          (I2)
*
END-DEFINE
* * * * * * * * *
*
IF *DEVICE = 'BATCH'
  MOVE '__ Pay 7 Years ' TO #PAY-7-LBL
  MOVE '__ Pay 20 Years' TO #PAY-20-LBL
  MOVE '__ Pay 30 Years' TO #PAY-30-LBL
  MOVE '__ Pay til 100 ' TO #PAY-100-LBL
  MOVE '__ One Time Pmt' TO #PAY-1-LBL
ELSE
  MOVE 'Pay 7 Years    ' TO #PAY-7-LBL
  MOVE 'Pay 20 Years   ' TO #PAY-20-LBL
  MOVE 'Pay 30 Years   ' TO #PAY-30-LBL
  MOVE 'Pay til Age 100' TO #PAY-100-LBL
  MOVE 'One Time Payment' TO #PAY-1-LBL
END-IF
*
MOVE ' Whole Life Insurance Desired $_________________'
 TO #WL-INS-DESIRED
MOVE ' Term Insurance Desired $_________________' TO #TM-INS-DESIRED
*
IF #INTRO-FLAG = 'K' OR = 'G'
  COMPRESS 'The parents or legal guardian of the insured, or the'
    'insured if over 18, must' INTO #EXAM-LINES (1)
  COMPRESS 'complete the medical questionaire and sign in the space'
    'indicated. Additional'    INTO #EXAM-LINES (2)
  COMPRESS 'proof of insurability is required as follows: For insureds'
    'age 6 months to 6' INTO #EXAM-LINES (3)
  COMPRESS 'years: Family physician"s current well baby statement.'
    'For insureds age 6'   INTO #EXAM-LINES (4)
  COMPRESS 'through 23 years: Provide most recent medical examination'
    'report from family'   INTO #EXAM-LINES (5)
  COMPRESS 'or school physician. If additional information is required,'
    'AAFMAA will' INTO #EXAM-LINES (6)
  COMPRESS 'arrange and pay for any necessary physician or paramedic'
    'examination.' INTO #EXAM-LINES (7)
ELSE
  IF #MILITARY-STATUS = 'A'
   AND (#INTRO-FLAG NE 'S')
    COMPRESS 'If you are on active duty and are age 39 or below, you'
      'need only complete the'   INTO #EXAM-LINES (1)
    COMPRESS 'Medical Questionnaire.  If you are age 40 or above, in'
      'addition to the Medical'  INTO #EXAM-LINES (2)
    COMPRESS 'Questionnaire, attach a copy of your most recent Report'
      'of Medical Examination'   INTO #EXAM-LINES (3)
    COMPRESS '(SF-88) and Report of Medical History (SF-93) and include'
      'all ancillary tests'      INTO #EXAM-LINES (4)
    COMPRESS 'that may have been done (i.e.blood chemistry, cholestrol,'
      'etc.). If services'   INTO #EXAM-LINES (5)
    COMPRESS 'of a military treatment facility are not available, call'
      'us for additional'        INTO #EXAM-LINES (6)
    COMPRESS 'information. (If overseas, please call us collect'
      'for instructions.)'    INTO #EXAM-LINES (7)
  ELSE
    COMPRESS 'If you are retired or a non-active duty spouse, please'
      'complete the medical'      INTO #EXAM-LINES (1)
    COMPRESS 'questionnaire and attach copies of your last physical'
      'examination if you have'      INTO #EXAM-LINES (2)
    COMPRESS 'had one in the last 12 months. Include results of all'
      'ancillary tests. If'     INTO #EXAM-LINES (3)
    COMPRESS 'you have not had a physical within the past 12 months'
      'or the services of a' INTO #EXAM-LINES (4)
    COMPRESS 'military treatment facility are not available, AAFMAA'
      'will arrange for a'       INTO #EXAM-LINES (5)
    COMPRESS 'paramedical or physical examination at our expense.'
      'If you are overseas' INTO #EXAM-LINES (6)
    COMPRESS 'we cannot arrange for a paramedical or physical but'
      'we will reimburse' INTO #EXAM-LINES (7)
    COMPRESS 'expenses up to $100 U.S. Dollars. (If overseas and'
      'you have questions call'     INTO #EXAM-LINES (8)
    COMPRESS 'collect for instructions.)'
                                 INTO #EXAM-LINES (9)
  END-IF
END-IF
*
MOVE '   MEMBER'  TO #MBR-SPS-GEN
*
IF (#INTRO-FLAG = 'S')
  MOVE '  SPOUSE' TO #MBR-SPS-GEN
ELSE
  IF (#INTRO-FLAG = 'K')
    MOVE '   CHILD    ' TO #MBR-SPS-GEN
  ELSE
    IF #INTRO-FLAG = 'G'
      MOVE ' GRANDCHILD ' TO #MBR-SPS-GEN
    END-IF
  END-IF
END-IF
*
MOVE '5-YR RENEWABLE TERM'   TO #5-YR-REN-LBL
MOVE 'Renewable Thru Age 70' TO #5-YR-REN-LBL2
*
MOVE '__'           TO  #RT-__
MOVE 'LEVEL TERM TO AGE 50'   TO #LVL-TRM-LBL
MOVE '__'           TO #LT-__
MOVE 'First   Each' TO #FIR-EAC-LBL-WL #FIR-EAC-LBL
MOVE 'Adl$10k'      TO #ADDL-10K #ADDL-10K-WL
MOVE 'TERM INSUR'   TO #TI-LBL
MOVE #WL-DSC-1      TO #WL-DESC-1
MOVE #WL-DSC-2      TO #WL-DESC-2
MOVE #WL-DSC-3      TO #WL-DESC-3
MOVE #WL-DSC-4      TO #WL-DESC-4
MOVE #WL-DSC-5      TO #WL-DESC-5
MOVE #RT-DSC-1      TO #RT-DESC-1
MOVE #RT-DSC-2      TO #RT-DESC-2
MOVE #RT-DSC-3      TO #RT-DESC-3
MOVE #RT-DSC-4      TO #RT-DESC-4
MOVE #LT-DSC-1      TO #LT-DESC-1
MOVE #LT-DSC-2      TO #LT-DESC-2
MOVE #LT-DSC-3      TO #LT-DESC-3
MOVE #LT-DSC-4      TO #LT-DESC-4
MOVE #LT-DSC-5      TO #LT-DESC-5
MOVE #LT-DSC-6      TO #LT-DESC-6
MOVE 'below or TERM on next page.' TO #OR-TERM-MSG
MOVE ALL '_' TO #SOLID-LINE-WL
MOVE ALL '_' TO #SOLID-LINE-LT
MOVE ALL '_' TO #SOLID-LINE-RT
MOVE ALL '-' TO #DASH-LINE-WL
MOVE ALL '-' TO #DASH-LINE-RT
MOVE 'WHOLE LIFE'  TO #WL-LBL /* was VALUE ADDED
MOVE 'Added Coverage' TO #WL-ADDED-LBL
*
END
