* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 5
* <Natural Source Header
* PGM-ID: C2200PCG
*
************************************************************************
* MODIFICATION LOG
*
* USER   DATE    TAG  REASON
* DRW 02162004   DW1  For Syncing Create NX 503 if NX 403 is created
* DRW 02202007   DW2  Remove NX's to AFSC
* DRW 04202007   DW3  Show 'Share Data' Info on all records
* DRW 09142007   DW4  Add '-See CB Screen' to MIL-STATUS edit
* PAM 04012008   PM5  Remove Credit Card Checks
* DRW 06/10/2008 DW6  Chg ALOT-CHG-AUTH to "A" after OPT/OUT DE-FG Change
* PAM 07/24/2008 PM7  Added MAL to over-rides
* DRW 10/29/2008 DW8  Make ALOT-SW "A" on a Share Data Change
* YAK 03/04/2009 YK1  Commented out the logic for PAD-CODE verification.
*                     (AAFMAA does not use PAD-CODE on CG screen)
* PAM 03/11/2009 PM9  Added Bridger file processing
* DRW 09/21/2009 DW10 AFFL Unification Process-ind Changes
* YAK 11/20/2009 YK2  Add logic to call Web Service to verify address
* RSE 02/23/2010 RE1  Display date of death when user is Migration Team
* NGG 04/17/2010 NG1  CR222 CHANGES
* RSE 04/23/2010 RE1  Renamed GUPNEW to GUPCGSXX
* RSE 05/09/2010 RE2  Remove rule in map and in program to validate sex
* NGG 02/24/2010 NG2  Synchronize member data with CRM
* NGG 07/09/2010 NG3  M-SPLAN project
* RSE 09/28/2010 RE3  Flip CG and CG ADD
* RSE 10/19/2010 RE4  Commented out name validation
* RSE 11/12/2010 RE5  Update Contact Record when Rank is modified
*                     (Code removed)
* NGG 11/16/2010 NG4  Display only of Rank data
* RSE 11/23/2010 RE6  Don't display name change reason when Name is not changed
* RSE 11/24/2010 RE7  Don't display Salutation when Rank Protect = 'Y';
*                     Comment out write trans log for rank, mil-id, and mil service
* RSE 12/02/2010 RE8  Don't reset #CGA-SCR-ID
* RSE 12/07/2010 RE9  Display RANK-ID, RANK only for select users
* bz2 02/04/2011 bz2  Reset p_Name before CALLNAT 'GPRS0CNT'
* RSE 02/09/2011 RE10 Use function to check authorized users
* RSE 02/23/2011 RE11 Comment out validations
* RSE 03/11/2011 RE12 Fix RANK-ID problem.
* RSE 03/15/2011 RE13 Display message for 3SR message
* RSE 04/07/2011 RE14 Change CLERK-ID to *INIT-USER
* RSE 04/25/2011 RE15 Replace #SEARCH with #CGA-CLERK
* NGG 05/24/2011 NG5  Remove CRM synch call - the logic to synch is on item level
* RSE 05/31/2011 RE16 Remove display of Name Change Reason; create TR rec instead
* RSE 06/01/2011 RE17 Add helproutines, processing for organization, change map headers
* RSE 06/20/2011 RE18 Standardize call to TR
* RSE 06/24/2011 RE19 Fix msg truncation
* RSE 07/18/2011 RE20 Fix TR for widow with CN
* RSE 07/28/2011 RE21 Update DOB in Status record for member
************************************************************************
*
DEFINE DATA
GLOBAL USING BCOMMGXX WITH MASTER-BLOCK
LOCAL  USING GONERLXX
LOCAL  USING A-IFAFFL   /* PDA used with FUNCTION F-if-AFFL     /* DW10
LOCAL  USING GPRA0004   /* PDA used with new TR call  /* RE18
LOCAL
1 #MSG              (A72)              /* NG1
1 #MODE             (A1)  INIT <'U'>   /* NG1
1 #OLD-NAME         (A25)              /* NG1
1 #OLD-NAME-SP      (A25)              /* NG1
1 #OLD-SSN          (N9)               /* NG1
1 #OLD-SSN-SP       (N9)               /* RE18
1 REDEFINE #OLD-SSN-SP                 /* RE18
  2 #OLD-SSN-SP-A   (A9)               /* RE18
1 #OLD-SSN-PROTECT  (A1)               /* RE18
1 #OLD-GENDER       (A1)               /* NG1
1 #OLD-SEX          (A1)               /* RE18
1 #OLD-DOB          (N8)               /* RE18
1 #OLD-DOD          (N8)               /* RE18
1 #OLD-DIV          (N8)               /* RE18
1 #OLD-BCC          (A1)               /* RE18
1 #OLD-DCC          (A1)               /* RE18
1 #OLD-MCC          (A1)               /* RE18
1 #CG-RANK                             /* NG4
  2 #RANK-PROTECTION     (A1)
  2 #RANK-PROT-DATE      (A10)
  2 #RANK-PROT-TEXT      (A5)
  2 #RANK-DESCRIPTION    (A32)
  2 #BRANCH-DESCRIPTION  (A28)
  2 #PAY-GRADE           (A3)
  2 #PROCESS-IND         (A1)
  2 #PROCESS-IND-EDESC   (A40)
  2 #INTRO-FLAG          (A1)
  2 #INTRO-FLAG-EDESC    (A40)
  2 #MILITARY-STAT-DESC  (A28)
  2 #INS-MAIL-CODE-DESC (A40)  /* RE17
  2 #NEWSLETTER-DESC    (A40) /* RE17
  2 #ANNUAL-MEETING-DESC(A40) /* RE17
  2 #ANN-RPT-DESC        (A40) /* RE17
  2 #BRIDGER-DESC       (A40) /* RE17
  2 #UNDERWRITING-DESC  (A40) /* RE17
  2 #PROXY-BALLOT-DESC  (A40) /* RE17
  2 #PREFIX-TITLE        (A25)        /* RE17
  2 #PREFIX-TITLE-DESC   (A40)        /* RE17
1 #INTRO-FLAG-DESC      (A20)
1 #PROCESS-IND-DESC     (A20)
1 #MIL-SERVICE-DESC     (A50)
1 #MIL-STATUS-DESC      (A64)
1 #PROTECT              (A1)          /* NG4

1 #FORCE-A     (L)    /* DW6
1 #SFX   (I2)
1 #NX-403 (L)
1 #NX-406 (L)
1 #NX-407 (L)
1 #NX-408 (L)
*
1 #SUBTYPE    (A1)
**1 #ANN-RPT-DESC (A7)   /* RE17
1 #TEXT-40           (A40)
1 REDEFINE #TEXT-40             /* RE19
  2 FILLER           (A37)      /* RE19
  2 #TEXT-40-LAST-3  (A3)       /* RE19
1 #OWNER-POLS-EXIST     (L)
1 #NON-OWNER-POLS-EXIST (L)
1 #D-POLS-EXIST         (L)
1 #CHK-DIGIT   (P1)
1 #DIGIT-SUM   (N3)
1 REDEFINE #DIGIT-SUM
  2 #DIG-SUM-2 (N2)
  2 #DIG-SUM-1 (N1)

1 #SCN-TRADE-UP-DT (A8)
1 REDEFINE #SCN-TRADE-UP-DT
  2 #SCN-TRADE-UP-MM (N2)
  2 #SCN-TRADE-UP-DD (N2)
  2 #SCN-TRADE-UP-YYYY (N4)
1 REDEFINE #SCN-TRADE-UP-DT
  2 #SCN-TRADE-UP-DT-N (N8)
1 #SCN-TRADE-UP-TEXT (A21)
*
1 #PC-1-LBL (A6) INIT <'Packet'>
1 #PC-2-LBL (A6) INIT <'45-day'>
1 #PC-3-LBL (A6) INIT <'6-mon '>
1 #PC-4-LBL (A6) INIT <'1-year'>
1 #PC-5-LBL (A6) INIT <'2-year'>
1 #PC-6-LBL (A6) INIT <'Other'>
*
1 #SCR-NM-CHG-REASON (A50)
1 #DOMAIN-TYPE  (A4)
1 #I1 (I2)
1 #I2 (I2)
1 #I3 (I2)
1 #ADD1(I2)
1 #LNK-CNT (I2)
1 #LNK-MAX (I2)
1 #E1 (I2)
1 #E2 (I2)
1 #E3 (I2)
1 #SSN-FOUND (L)
1 #MEM-NOT-FOUND (L)
1 #HAS-PER (L)
1 #FOUND-BLANK (L)
1 #INT (I2)
1 #NOTE-TEXT (A60/10)
1 #NOTE-NUM (N6)
1 #USER-TO-RECEIVE (A3)
1 #TO-INIT (A3)
1 #HOLD-SUFFIX (A3)
1 #DT-MBR-CARD-MAILED (N8)
*
1 NT-V VIEW OF A-NOTES
  2 ID-NUMBER
  2 NOTE-DATE (N8/3)
  2 DTS-DATN (P9)
  2 DTS-TIMN (P7)
  2 NOTE-CLERK-ID (A3/3)
  2 NOTE-LINE-NUM (P1/3)
  2 NOTE-TEXT (A60/3)
  2 REDEFINE NOTE-TEXT
    3 ANN-MTG-CNT (N5)
*
1 #APO-FPO (L)
1 #INVALID (L)
1 #RANK-LOWERED (L)
1 #ASSUM-DOP (L)
1 #OLD-DISPL (P2)
1 #TEXT (A78)
1 #SCR-NOT-MSG (A76)
1 #ERR-MSG (A60)
1 #RANK-DISPL (P2)
1 #RANK-LIT (A23)
1 #RANK-DISPLAY (A5)
1 #NT-NOT-FND (L)
1 #P-SEX (A1)    /* RE7
*
1 #WID-CV (C)
1 #WID-LBL       (A8) INIT <'Widow:'>
1 #NAME-LBL      (A8) INIT <'Member:'>
*
1 #HOLD-MONTH (N8)
1 REDEFINE #HOLD-MONTH
  2 #HOLD-MONTH-KEY    (N6)
1 #FIELD-CHANGED (L) INIT<FALSE>
1 #UPDATE-DATE   (L) INIT<FALSE>
1 #EDIT-FLAG (A1)
*
1 #DATE-DISP (A10)
1 #YYYYMMDD  (N8)
1 REDEFINE #YYYYMMDD
  2 #YYYY (N4)
  2 #MM (N2)
  2 #DD (N2)
1 REDEFINE #YYYYMMDD
  2 #YYYY-A (A4)
  2 #MM-A (A2)
  2 #DD-A (A2)
*
1 #WYYYYMMDD
  2 #WYYYY (N4)
  2 #WMM (N2)
  2 #WDD (N2)
1 REDEFINE #WYYYYMMDD
  2 #WYYYYMMDD-N (N8)
*
1 #WMMDDYYYY
  2 #WMM (N2)
  2 #WDD (N2)
  2 #WYYYY (N4)
1 REDEFINE #WMMDDYYYY
  2 #WMMDDYYYY-N (N8)
*
1 #CG-FF-1  (A47)
1 #CG-FF-2  (A78)
1 #HOLD-OLD-ADDRESS-CHG-CODE (A1)
1 #SCR-LAST-UPDATE(A10)
1 #HOLD-SUSPEND-CODE (A1)
1 #HOLD-SEC-ADD-CODE (A1)
1 #HOLD-RANK   (A3)
1 #HOLD-MIL-ST (A1)
1 #HOLD-MIL-ID (A1)
1 #HOLD-SOURCE (A7)
1 #HOLD-NAME   (A25)
1 #HOLD-ID-NUMBER (N6)
1 #HOLD-NAME-SP   (A25)
1 #HOLD-DATE-BOOK (A1)
1 #MAIN-NAME-HOLD (A25)
1 #MAIN-NAME      (A25)
1 #HOLD-DT-MBR-CARD-SINCE (N8)
1 #HOLD-TRADE-UP-SENT-DT  (N8)
1 REDEFINE #HOLD-TRADE-UP-SENT-DT
  2 #HOLD-TRADE-UP-MM (N2)
  2 #HOLD-TRADE-UP-DD  (N2)
  2 #HOLD-TRADE-UP-YYYY (N4)
*
1 LN-ST VIEW OF A-STATUS
  2 ID-NUMBER
  2 SSN
  2 INTRO-FLAG
  2 PROCESS-IND
*
1 LN-AT VIEW OF A-APPL-TRACKING
  2 ID-NUMBER
  2 INTRO-FLAG
*
1 STATUS VIEW OF A-STATUS
  2 ID-NUMBER
  2 MEMBER-CONTACT-ID  (N8)
  2 SPOUSE-CONTACT-ID  (N8)
1 CG-S01 VIEW OF A-STATUS
  2 ID-NUMBER
  2 MEMBER-CONTACT-ID  (N8)
  2 SPOUSE-CONTACT-ID  (N8)
  2 MEMBER-FLAG
  2 PROCESS-IND
  2 TRAD-UP-SENT-DT
  2 REDEFINE TRAD-UP-SENT-DT
    3 TRADE-UP-DATE-YYYY (N4)
    3 TRADE-UP-DATE-MM  (N2)
    3 TRADE-UP-DATE-DD  (N2)
  2 OTHER-COMPANY-ID
  2 LINKED-CN   (30)
  2 REDEFINE LINKED-CN
    3 LINKED-CN-A  (A6/30)
  2 SSN-SP
  2 DUES-BALANCE
  2 ALOT-SW
  2 DUES-FPF
  2 INS-MAIL-CODE
  2 WIDOW-FLAG
  2 NAME-SP
  2 SEX-SP
  2 CC-NUM
  2 CC-EXP-DT
  2 TITLE-SP
  2 REDEFINE TITLE-SP
    3 TITLE-SP-3      (A3)
    3 TITLE-SP-LAST-1 (A1)
  2 RANK
  2 CHIEF-OF-STAFF-IND
  2 MILITARY-SERVICE
  2 DATE-RETIRED
  2 DATE-BOOK
  2 NEWSLETTER-CODE
  2 SUSPEND-CODE
  2 MILITARY-STATUS
  2 NAME
  2 MEMBERSHIP-DRIVE
  2 REDEFINE MEMBERSHIP-DRIVE
    3 PC-1 (A1)
    3 PC-2 (A1)
    3 PC-3 (A1)
    3 PC-4 (A1)
    3 PC-5 (A1)
    3 PC-6 (A1)
  2 LAST-MBRSHIP-PHONE-DT
  2 REDEFINE LAST-MBRSHIP-PHONE-DT
    3 LMPD-CENT (A2)
    3 LMPD-YY (A2)
    3 LMPD-MM (A2)
    3 LMPD-DD (A2)
  2 PROXY
  2 INTRO-FLAG
  2 ANNUAL-RPT-FLAG
  2 SEX
  2 DTS-DATN
  2 DTS-TIMN
  2 DATE-OF-BIRTH
  2 DATE-OF-BIRTH-SP
  2 SSN
  2 REDEFINE SSN 3 SSN-X (A9)
  2 DATE-OTHER-UPDATE
  2 REDEFINE DATE-OTHER-UPDATE
    3 DOU-YYYY (A4)
    3 DOU-MM   (A2)
    3 DOU-DD   (A2)
  2 LAST-FM-DATE
  2 DATE-OF-DEATH
  2 REDEFINE DATE-OF-DEATH
    3 DOD-CENT (N2)
    3 DOD-YY   (N2)
    3 DOD-MM   (N2)
    3 DOD-DD   (N2)
  2 DATE-OF-DIVORCE
  2 DATE-OF-MARRIAGE          /* RE18
  2 MARRIAGE-CERT-CODE        /* RE18
  2 DATE-OF-RANK
  2 PRIOR-DATE-OF-RANK
  2 RESTRICT-MBR-SW
  2 ACCESS-AUTH-CODE
  2 APPL-SOURCE  (A7)
  2 NOTE-REC-IND
  2 NUMBER-MEMBERSHIPS  (P1)
  2 ONLINE-ACTION-GN
  2 ONLINE-ACTION (9)
  2 FACE-AMOUNT  (9)
  2 ISSUE-DATE   (1)
  2 PAY-STATUS   (9)
  2 PAID-TO-DATE (9)
  2 STATUS   (9)
  2 PLAN     (1)
  2 OWNERSHIP-FLAG (9)
  2 MODE          (9)
  2 DT-MBR-CARD-SINCE
  2 BRIDGER-IND                                    /* PM9
  2 STATUS-CODE-SP           /* RE18

*
1 OLD-V VIEW OF A-STATUS
  2 WIDOW-FLAG
  2 PROCESS-IND
  2 TRAD-UP-SENT-DT
  2 NAME-SP
  2 SEX-SP
  2 TITLE-SP
  2 INTRO-FLAG
  2 INS-MAIL-CODE
  2 DATA-SHARED-IND
  2 CC-NUM
  2 CC-EXP-DT
  2 RANK
  2 MILITARY-SERVICE
  2 DATE-BOOK
  2 NEWSLETTER-CODE
  2 SUSPEND-CODE
  2 MILITARY-STATUS
  2 NAME
  2 MEMBERSHIP-DRIVE
  2 PROXY
  2 ANNUAL-RPT-FLAG
  2 SEX
  2 SSN
  2 REDEFINE SSN    3 SSN-X (A9)
  2 DATE-OTHER-UPDATE
  2 APPL-SOURCE    (A7)
  2 DT-MBR-CARD-SINCE
  2 BRIDGER-IND                                    /* PM9
  2 SPOUSE-CONTACT-ID        /* RE18
  2 DATE-OF-MARRIAGE         /* RE18
  2 MARRIAGE-CERT-CODE       /* RE18
  2 DATE-OF-DIVORCE          /* RE18
  2 DATE-OF-BIRTH            /* RE21
*
1 OLD-SP-V VIEW OF A-STATUS  /* RE20
  2 DATE-OF-MARRIAGE         /* RE20
  2 DATE-OF-DIVORCE          /* RE20
  2 MARRIAGE-CERT-CODE       /* RE20
*
1 TRLOG VIEW OF A-TRANSACTION-REGISTER
  2 ID-NUMBER
  2 NAME
  2 DATE-LAST-UPDATE
  2 TERMINAL-ID
  2 PROCESS-IND
  2 CLERK-ID
  2 TRANSACTION-DATN (P9)
  2 TRANSACTION-TIMN (P7)
  2 OLD-DATA  (A125/32)
  2 NEW-DATA  (A125/32)
  2 REDEFINE NEW-DATA
    3 NEW-DATA-OCC (32)
      4 NEW-DATA-CG (A3)
      4 NEW-DATA-REST (A122)
  2 SYNC-FLD-NUM      (60)
  2 SYNC-FLD-OLD-DATA (60)
  2 SYNC-FLD-NEW-DATA (60)
*
1 CNT-V VIEW OF A-CONTACTS          /* RE5 Start
  2 ID-NUMBER             /* RE20
  2 RANK-ID
  2 CONTACT-TYPE
  2 PREFIX-TITLE          /* RE17
  2 FIRST-NAME            /* RE17
  2 MIDDLE-NAME           /* RE17
  2 LAST-NAME             /* RE17
  2 SUFFIX                /* RE17
  2 SSN                   /* RE18
  2 REDEFINE SSN          /* RE18
    3 SSN-A  (A9)         /* RE18
  2 SSN-PROTECT           /* RE18
  2 GENDER-CD             /* RE18
  2 DATE-OF-BIRTH         
  2 REDEFINE DATE-OF-BIRTH /* RE17 START 
    3 #DOB-YY (A4)       
    3 #DOB-MM (A2) 
    3 #DOB-DD (A2)          
  2 DATE-OF-DEATH         
  2 REDEFINE DATE-OF-DEATH  
    3 #DOD-YY (A4)       
    3 #DOD-MM (A2) 
    3 #DOD-DD (A2)         /* RE17 END
  2 BIRTH-CERT-CODE       /* RE18
  2 DEATH-CERT-CODE       /* RE18
*
1 RANK-V VIEW OF A-RANK-REFERENCE
  2 RANK-ID
  2 MILITARY-ID
  2 RANK-IN-SAS                       /* RE5 End
*
1 #TRX  (I2)
1 #W-OLD-NEW-DATA  (A125)
1 REDEFINE #W-OLD-NEW-DATA
  2 #W-DESCRIPTION (A10)
  2 #W-DATA        (A115)
*
1 #XML                      (A) DYNAMIC           /* NG2
1 #LINE                     (A) DYNAMIC           /* NG2
1 #RESPONSE                 (A) DYNAMIC           /* NG2
1 #CRM-REQUEST              (I4)                  /* NG2
1 #RESPONSE-DSPL            (A16)                 /* NG2
**1 #SEARCH                   (L)                 /* RE3  RE15
1 #WID-DOB-LBL              (A3)   INIT <'DOB'>

1 V_LINE_M
  2 V_LBL_M    (A8) INIT <'Member'>
  2 V_NAME_M   (A35)
  2 V_SEX_M    (A1)
  2 V_SSN_M    (N9)
  2 V_DOB_M    (A10)
  2 V_DOD_M    (A10)
1 V_LINE_W
  2 V_LBL_W    (A6)
  2 V_NAME_W   (A35)
  2 V_SEX_W    (A1)
  2 V_SSN_W    (N9)
  2 V_DOB_W    (A10)
  2 V_DOD_W    (A10)
*
1 P_CID    (N8)
1 P_NAME   (A)    DYNAMIC

1 #SCR-NM-CHG-REASON_LBL (A19)  INIT <'Name Change Reason:'>
1 #SCR-NM-CHG-REASON_CV  (C)    INIT <(AD=NP)>
1 #SCR-NM-CHG-REASON-LBL_CV (C) INIT <(AD=NP)>
1 V_PID_DSCR    (A20)
1 V_I-FLAG_DSCR (A20)
1 #VALID        (L)         /* RE5
1 #RANK-ID-OLD-RANK (A50)   /* RE9
1 #NAME-CHG-RSN-MEMBER(A20) /* RE16
1 #NAME-CHG-RSN-SPOUSE(A20) /* RE16
1 #SECURED            (A1)  /* RE17 START
1 #TABLE-NUM          (A3)   
1 #PREFIX-TITLE-DESC-MSG(A58)  
1 #HEADER1            (A78)  
1 #HEADER2            (A78)  
1 REDEFINE #HEADER2
  2 #H-NAME           (A42) 
  2 #H-DETAILS        (A36)
1 #SAVE-HEADER        (A42)
1 #INDIVIDUAL         (L)  
1 #DATE-OF-BIRTH      (A8)
1 #DATE-OF-DEATH      (A8)
1 #OLD-PREFIX-TITLE  (A10)/* RE17
1 #CNT-ISN            (P8) /* RE17
1 #I                  (I2) /* RE18 START
1 #MEMBER             (L)   
1 #MEMBER-ONLY        (L)  /* RE20  
1 #DATE-N             (N8)
1 REDEFINE #DATE-N  
  2 #DATE-YY          (A4)
  2 #DATE-MM          (A2)
  2 #DATE-DD          (A2) /* RE18 END
1 #SAVE-MCC           (A1) /* RE20 
1 #OLD-SP-DOM         (N8) /* RE20
1 #OLD-SP-MCC         (A1) /* RE20
1 #NEW-SP-DOM         (N8) /* RE20
1 #NEW-SP-MCC         (A1) /* RE20
1 #OLD-SP-DIV         (N8) /* RE20
1 #NEW-SP-DIV         (N8) /* RE20
END-DEFINE
*
SET KEY PF1 = HELP
SET KEY PF4
INCLUDE GONERCXX
*
GET CG-S01 #CGA-ISN
*
IF #CGA-SCR-SUFFIX = 'ADD'                           /* NG4
  #PROTECT := 'Y'                                    /* NG4
  CALLNAT 'C2200SCG' #CGA-ISN #CG-RANK               /* NG4
ELSE                                                 /* RE3
  RESET #CGA-SCR-SUFFIX                              /* RE3
  FETCH RETURN 'ADRP0001' #CGA-SCR-ID #CGA-ORIG-ID MEMBER-CONTACT-ID #CGA-CLERK /* RE15 #SEARCH
*  ASSIGN #CRM-REQUEST = 2                           /* NG5
*  CALLNAT 'MBRDATA'
*    #CGA-ISN
*    #XML
*    #LINE
*    #RESPONSE
*    #CRM-REQUEST
*  RESET #CGA-SCR-ID #CGA-SCR-SUFFIX     /* RE8
  RESET #CGA-SCR-SUFFIX                  /* RE8
  #CGA-SCR-COMMAND := 'GM'
  FETCH 'G1000PXX'
END-IF
*
CALLNAT 'PLAN-AFA' CG-S01.ID-NUMBER F-IF-AFFL-DATA /* NG3
*
IF #SAS-SUSPENDED
  MOVE 'Suspended due to Lack of Payment' TO #SCR-NOT-MSG
END-IF
*
IF APPL-SOURCE = 'AER' OR ='CER'
    OR ((#CGA-ID GE 501) AND (#CGA-ID LE 999))
  MOVE CG-S01.NAME-SP TO #MAIN-NAME-HOLD
  MOVE 'Deceased'  TO V_LBL_M
  COMPRESS #SCR-NOT-MSG '- Widow Client' INTO #SCR-NOT-MSG
ELSE
  MOVE CG-S01.NAME    TO #MAIN-NAME-HOLD
END-IF
*
MOVE SUSPEND-CODE     TO #HOLD-SUSPEND-CODE
MOVE RANK             TO #HOLD-RANK
MOVE MILITARY-STATUS  TO #HOLD-MIL-ST
MOVE MILITARY-SERVICE TO #HOLD-MIL-ID
MOVE NAME             TO #HOLD-NAME
MOVE APPL-SOURCE      TO #HOLD-SOURCE
MOVE CG-S01.ID-NUMBER TO #HOLD-ID-NUMBER
MOVE NAME-SP          TO #HOLD-NAME-SP
MOVE DATE-BOOK   TO #HOLD-DATE-BOOK
MOVE DT-MBR-CARD-SINCE TO #HOLD-DT-MBR-CARD-SINCE
MOVE TRADE-UP-DATE-YYYY TO #HOLD-TRADE-UP-YYYY
MOVE TRADE-UP-DATE-MM TO #HOLD-TRADE-UP-MM
MOVE TRADE-UP-DATE-DD TO #HOLD-TRADE-UP-DD
*
IF CG-S01.WIDOW-FLAG = 'Y' OR CG-S01.DATE-OF-DEATH <> 0
  V_LBL_W := "WIDOW"
  IF CG-S01.SPOUSE-CONTACT-ID = 0                                 /* bz1
    #SCR-NOT-MSG := "CONTACT EDS: SP CI IS 0"   /* bz1
    RESET V_LINE_M                                                /* bz1
  ELSE                                                            /* bz1
    P_CID := CG-S01.SPOUSE-CONTACT-ID                             /* bz1
    MOVE 'X' TO #P-SEX
    P_NAME := ' '                                                 /* bz2
    CALLNAT 'GPRS0CNT' P_CID P_NAME 1X V_DOB_W 1X V_DOD_W #P-SEX V_SSN_W   /* RE7
*    CALLNAT 'GPRS0CNT' p_CID p_Name 1x v_DOB_w 1x v_DOD_w v_SEX_w v_SSN_w /* RE7
    V_SEX_W := #P-SEX                                                      /* RE7
*    v_Name_w := p_Name                      /* RE17
     V_NAME_W := FUNCTION-NAME-LFMS(<P_CID>) /* RE17
  END-IF
END-IF
*
IF INTRO-FLAG = 'F'
  MOVE '20-day' TO #PC-2-LBL
  MOVE '50-day' TO #PC-3-LBL
  MOVE '4-mon'  TO #PC-4-LBL
  MOVE '10-mon' TO #PC-5-LBL
  MOVE '14-mon' TO #PC-6-LBL
END-IF
*
IF INTRO-FLAG = 'C' OR = 'B' OR = 'P' OR = 'Q'
  MOVE 'CAP-Op' TO #PC-5-LBL
END-IF
*
PERFORM PREPARE-SCREEN
MOVE #PREFIX-TITLE TO #OLD-PREFIX-TITLE
*
MOVE PLAN (1) TO #TEXT-40
CALLNAT 'GGRANSXX' USING CG-S01.ID-NUMBER CG-S01.PROCESS-IND
  CG-S01.INTRO-FLAG CG-S01.MILITARY-SERVICE CG-S01.DATE-OF-DEATH
  CG-S01.NUMBER-MEMBERSHIPS CG-S01.PLAN (1) #TEXT-40
COMPRESS #SCR-NOT-MSG #TEXT-40 INTO #SCR-NOT-MSG
IF #TEXT-40-LAST-3 = '(Pe'                                                  /* RE19
  COMPRESS #SCR-NOT-MSG 'nding Confirmation)' INTO #SCR-NOT-MSG LEAVING NO  /* RE19
END-IF                                                                      /* RE19
IF FUNCTION-SERVICE-PLAN(<CG-S01.ID-NUMBER>) = '3SR'                             /* RE3
  COMPRESS #SCR-NOT-MSG ' + Services Member' INTO #SCR-NOT-MSG LEAVING NO        /* RE3
END-IF                                                                           /* RE3
*
**IF ANNUAL-RPT-FLAG = 'F' MOVE 'Full' TO #ANN-RPT-DESC ELSE         /* RE17
**  IF ANNUAL-RPT-FLAG = 'S' MOVE 'Summary' TO #ANN-RPT-DESC ELSE    /* RE17
**    MOVE 'NONE' TO #ANN-RPT-DESC END-IF END-IF                     /* RE17
*
IF DT-MBR-CARD-SINCE > 0
  MOVE DT-MBR-CARD-SINCE TO #WYYYYMMDD-N
  MOVE BY NAME #WYYYYMMDD TO #WMMDDYYYY
  MOVE #WMMDDYYYY-N TO #DT-MBR-CARD-MAILED
END-IF
*
PERFORM RESET-YES-NO
*

MOVE '*' TO #CGA-SCR-COMMAND
IF #CGA-SCR-SUFFIX = 'AM'
  MOVE 'Y' TO DATE-BOOK
  IF #INDIVIDUAL                     /* RE17
    INPUT TEXT #SCR-NOT-MSG MARK *CG-S01.DATE-BOOK USING MAP 'C2200MCG'
  ELSE
    INPUT TEXT #SCR-NOT-MSG MARK *CG-S01.DATE-BOOK USING MAP 'C2201MCG'  /* RE17
  END-IF  
ELSE
  IF #CGA-SCR-SUFFIX = 'CRD'
    IF DT-MBR-CARD-SINCE = 0
      MOVE *DATN   TO #WYYYYMMDD-N
    ELSE
      MOVE DT-MBR-CARD-SINCE TO #WYYYYMMDD-N
    END-IF
    MOVE BY NAME #WYYYYMMDD TO #WMMDDYYYY
    MOVE #WMMDDYYYY-N TO #DT-MBR-CARD-MAILED
    IF #INDIVIDUAL                     /* RE17
      INPUT TEXT #SCR-NOT-MSG MARK *#DT-MBR-CARD-MAILED USING MAP 'C2200MCG'
    ELSE
      INPUT TEXT #SCR-NOT-MSG MARK *#DT-MBR-CARD-MAILED USING MAP 'C2201MCG'
    END-IF
  ELSE
    RESET #CGA-SCR-SUFFIX
    IF #INDIVIDUAL                                 /* RE17 
      INPUT TEXT #SCR-NOT-MSG USING MAP 'C2200MCG'       
    ELSE
      INPUT TEXT #SCR-NOT-MSG USING MAP 'C2201MCG' /* RE17 
    END-IF                                          
  END-IF
END-IF
*
IF #CGA-SCR-COMMAND NE '*'
  END TRANSACTION
  FETCH 'G1000PXX'
END-IF
*
IF *PF-KEY = 'PF4'                           /* NG1
  IF NOT (*CURS-LINE = 3 OR *CURS-LINE = 4)
    IF #INDIVIDUAL
      REINPUT 'Move cursor to Member/Widow line and press F4'
    ELSE
      REINPUT 'Move cursor to Organization line and press F4'
    END-IF
  END-IF
  PERFORM POP-UP-CONTACT
  PERFORM ASSEMBLE-HEADERS                  /* RE17
* =============================================== get header
  IF #MODE <> "N"                                            /* RE16 START
*    IF #MSG = 'NAME CHANGE'                                                 /* RE6
*      INPUT TEXT #SCR-NOT-MSG MARK *#SCR-NM-CHG-REASON USING MAP 'C2200MCG'
*    ELSE
    #SCR-NM-CHG-REASON-LBL_CV := (AD=N)                                   /* RE6
    #SCR-NM-CHG-REASON_CV     := (AD=N)                                   /* RE6
    IF #INDIVIDUAL                                  /* RE17 
      INPUT TEXT #SCR-NOT-MSG USING MAP 'C2200MCG'    
    ELSE
      INPUT TEXT #SCR-NOT-MSG USING MAP 'C2201MCG' /* RE17 
    END-IF                                          
*    END-IF
**write '='#MSG
    RESET #MSG                                                              /* RE6
  END-IF                                                     /* RE16 END
ELSE
  RESET #OLD-NAME #OLD-GENDER #OLD-SSN #OLD-NAME-SP
END-IF
*
IF (#CGA-SCR-ID GE 501) AND (#CGA-SCR-ID LE 999)
  CALLNAT 'C2201SCG' NAME SSN #ERR-MSG
  IF #ERR-MSG NE ' '
    REINPUT #ERR-MSG
      MARK *NAME
  END-IF
END-IF
*
IF APPL-SOURCE = 'AER' OR ='CER'
  MOVE NAME-SP TO #MAIN-NAME
ELSE
  MOVE NAME    TO #MAIN-NAME
END-IF
*
PERFORM SPECIAL-EDITS
PERFORM PREPARE-RECORD
PERFORM PROCESS-TRLOG
*
IF #CGA-SCR-SUFFIX = MASK ('SC')
  IF #CGA-SCR-SUFFIX = MASK ('SCH') /* mbr-srv does mr not ad (KRM)
    MOVE 'MR' TO #CGA-SCR-COMMAND
  ELSE
    MOVE 'AD' TO #CGA-SCR-COMMAND
  END-IF
  COMPRESS 'Trans cmpltd- press ENTER to process ADDR-CHG LTR' TO #TEXT
ELSE
  IF #ASSUM-DOP
    MOVE 'DM' TO #CGA-SCR-COMMAND
    MOVE 'DOP' TO #CGA-SCR-SUFFIX
    COMPRESS 'TRANS CMPLTD-PRESS ENTER TO UPD DOP' #TEXT INTO #TEXT
  ELSE
    MOVE 'CG' TO #CGA-SCR-COMMAND
    MOVE 'ADD' TO #CGA-SCR-SUFFIX                /* RE3
*
    IF #RANK-LOWERED
      COMPRESS 'TRANS CMPLTD-RANK LOWERED' #TEXT INTO #TEXT
    ELSE
      COMPRESS 'TRANS CMPLTD' #TEXT INTO #TEXT
    END-IF
  END-IF
END-IF
*
IF CG-S01.WIDOW-FLAG = 'Y'
  MOVE 'DM' TO #CGA-SCR-COMMAND
END-IF
*
IF CG-S01.WIDOW-FLAG = 'Y'
  MOVE (AD=P) TO #WID-CV
ELSE
  MOVE (AD=NP) TO #WID-CV
END-IF
*
**IF ANNUAL-RPT-FLAG = 'F' MOVE 'FULL' TO #ANN-RPT-DESC ELSE           /* RE17
**  IF ANNUAL-RPT-FLAG = 'S' MOVE 'SUMMARY' TO #ANN-RPT-DESC ELSE      /* RE17
**    MOVE 'NONE' TO #ANN-RPT-DESC END-IF END-IF                       /* RE17
*
IF CG-S01.ID-NUMBER NE #HOLD-ID-NUMBER /* DRW HAS CHD ID-NUMBER
  MOVE  'MODIFY C2200PCG TO CHANGE ID NUMBER' TO #TEXT
  IF #INDIVIDUAL                          /* RE17  
    INPUT TEXT #TEXT USING MAP 'C2200MCG'    
  ELSE
    INPUT TEXT #TEXT USING MAP 'C2201MCG' /* RE17  
  END-IF                                          
ELSE
  IF #FIELD-CHANGED
    RESET #NOTE-TEXT (*)
    IF   (#MAIN-NAME NE #MAIN-NAME-HOLD)
        AND (CG-S01.ID-NUMBER GT 1900)
      COMPRESS 'Formerly:' #MAIN-NAME-HOLD '  Reason:' #NAME-CHG-RSN-MEMBER INTO #NOTE-TEXT (1)
      MOVE 1 TO #INT
      CALLNAT 'E4205SDM' CG-S01.ID-NUMBER #INT #CGA-CLERK
        #NOTE-TEXT (1:10)
*
      RESET #NOTE-TEXT (*)
      COMPRESS 'Name changed from:' #MAIN-NAME-HOLD INTO #NOTE-TEXT (1)
      COMPRESS '    CN' #CGA-ID ' to:' #MAIN-NAME   INTO #NOTE-TEXT (2)
      COMPRESS 'Reason:' #SCR-NM-CHG-REASON         INTO #NOTE-TEXT (3)
      MOVE #CGA-SCR-SUFFIX TO #HOLD-SUFFIX
      MOVE '*NX' TO #CGA-SCR-SUFFIX
*
      IF CG-S01.PROCESS-IND NE 'C'
        MOVE TRUE TO #NX-407
      END-IF
*
      IF NOT CG-S01.PROCESS-IND = 'S' OR = 'C'
        MOVE 'LCE'      TO #TO-INIT
        FETCH RETURN 'G4090PNX' #CGA-CLERK #TO-INIT #NOTE-TEXT (1:5)
      END-IF
*
      MOVE #HOLD-SUFFIX TO #CGA-SCR-SUFFIX
    END-IF
*
    IF CG-S01.MILITARY-STATUS NE OLD-V.MILITARY-STATUS   /* DW2
        AND CG-S01.PROCESS-IND = 'S' OR = 'G'
      MOVE TRUE TO #NX-408
    END-IF
*
    PERFORM WRITE-TRANS-REG               /* RE18
    IF NOT #MEMBER                            /* RE20 START
      PERFORM PROCESS-TRLOG-FOR-WIDOW-WITH-CN
      PERFORM WRITE-TRANS-REG
    END-IF                                    /* RE20 END
*    PERFORM WRITE-TRLOG                  /* RE18
*
    UPDATE RECORD (0532)
    CALLNAT 'C2202SCG' #CGA-ISN
*
    PERFORM RESET-YES-NO
*
    IF  ((DATE-BOOK = 'Y')  AND (#HOLD-DATE-BOOK NE 'Y'))
        OR ((DATE-BOOK NE 'Y') AND (#HOLD-DATE-BOOK = 'Y'))
      FIND (1) NT-V WITH ID-NUMBER = 800107
        IF NO RECORD FOUND
          MOVE 800107 TO NT-V.ID-NUMBER
          MOVE *DATN TO NOTE-DATE (1)
          RESET NOTE-TEXT (*)
          RESET ANN-MTG-CNT
          MOVE TRUE TO #NT-NOT-FND
        END-NOREC
*
        IF  (DATE-BOOK = 'Y')  AND (#HOLD-DATE-BOOK NE 'Y')
          ADD 1 TO ANN-MTG-CNT
        ELSE
          SUBTRACT 1 FROM ANN-MTG-CNT
        END-IF
        COMPRESS #TEXT ' * Ann Mtg cnt is now' ANN-MTG-CNT INTO #TEXT
*
        IF #NT-NOT-FND
          STORE NT-V
        ELSE
          UPDATE
        END-IF
      END-FIND
    END-IF
    END TRANSACTION
*
    IF OLD-V.PROCESS-IND NE CG-S01.PROCESS-IND    /* DW6
      RESET #FORCE-A
      CALLNAT 'GAUTHSXX' CG-S01.ID-NUMBER      /*Set ALOT-CHG-AUTH to A
        #CGA-CLERK #FORCE-A               /* If FA indicates
    END-IF
*
    IF #FIELD-CHANGED           /* NG2 CRM SYNC PROCESS     \/\/\/\/
      ASSIGN #CRM-REQUEST = 2
      CALLNAT 'MBRDATA'
        #CGA-ISN
        #XML
        #LINE
        #RESPONSE
        #CRM-REQUEST
    END-IF                      /* NG2 CRM SYNC PROCESS     /\/\/\/\

    IF #INDIVIDUAL                             /* RE17
      INPUT TEXT #TEXT USING MAP 'C2200MCG'
    ELSE
      INPUT TEXT #TEXT USING MAP 'C2201MCG'    /* RE17
    END-IF
  ELSE
    END TRANSACTION
    IF CG-S01.WIDOW-FLAG NE 'Y'
      PERFORM RESET-YES-NO
      COMPRESS 'NO UPDATES' #TEXT INTO #TEXT
      IF #INDIVIDUAL                             /* RE17
        INPUT TEXT #TEXT USING MAP 'C2200MCG'
      ELSE
        INPUT TEXT #TEXT USING MAP 'C2201MCG'    /* RE17
      END-IF
    END-IF
  END-IF
END-IF
*
FETCH 'G1000PXX'
*
* * * * * *
DEFINE SUBROUTINE PREPARE-SCREEN
* * * * * *
PERFORM ASSEMBLE-HEADERS
COMPRESS DOU-MM DOU-DD DOU-YYYY INTO #SCR-LAST-UPDATE WITH '/'
*
MOVE 'TRADE-UP LETTER DATE' TO #SCN-TRADE-UP-TEXT
IF CG-S01.TRAD-UP-SENT-DT NE 0
  MOVE TRADE-UP-DATE-YYYY TO #SCN-TRADE-UP-YYYY
  MOVE TRADE-UP-DATE-MM   TO #SCN-TRADE-UP-MM
  MOVE TRADE-UP-DATE-DD   TO #SCN-TRADE-UP-DD
END-IF
*
IF CG-S01.BRIDGER-IND = ' '                                        /* PM9    
  CG-S01.BRIDGER-IND := 'N'                                         /* PM9    
END-IF                                                             /* PM9    
*
IF CG-S01.MEMBER-CONTACT-ID = 0                                          /* bz1
  #SCR-NOT-MSG := "CONTACT EDS: MBR CI IS 0"                             /* bz1
  RESET V_LINE_M                                                         /* bz1
ELSE                                                                     /* bz1
  P_CID := CG-S01.MEMBER-CONTACT-ID                                      /* bz1
  MOVE 'X' TO #P-SEX                                                     /* RE7
  P_NAME := ' '                                                          /* bz2
  CALLNAT 'GPRS0CNT'  P_CID P_NAME 1X V_DOB_M 1X V_DOD_M #P-SEX V_SSN_M  /* RE7
*  CALLNAT 'GPRS0CNT' p_CID p_Name 1x v_DOB_m 1x v_DOD_m v_SEX_m v_SSN_m  /* bz1 RE7
  V_SEX_M := #P-SEX                                                      /* RE7
  V_NAME_M := P_NAME                                                     /* bz1
END-IF                                                                   /* bz1
*
**IF *INIT-USER = 'guentch' OR= 'rasekhi' OR= 'XZBSL7' OR= 'RESTABI' OR= 'SVERMA'  /* RE9 START RE10 START
*  FIND CNT-V WITH CONTACT-ID = CG-S01.MEMBER-CONTACT-ID
*  END-FIND
**IF FUNCTION-AUTHORIZED(<#CGA-CLERK>)                            /* RE14
IF FUNCTION-AUTHORIZED(<*INIT-USER>)                              /* RE14         
  FIND CNT-V WITH CONTACT-ID = CG-S01.MEMBER-CONTACT-ID           /* RE12
    COMPRESS '{Rank ID:' RANK-ID '    Old SAS Rank:' CG-S01.RANK INTO #RANK-ID-OLD-RANK
    COMPRESS #RANK-ID-OLD-RANK '}'  INTO #RANK-ID-OLD-RANK LEAVING NO
  END-FIND                                                        /* RE12
END-IF                                                                           /* RE9 END RE10 END
*
END-SUBROUTINE /* (0880)
*
* * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE ASSEMBLE-HEADERS   /* RE17 
* * * * * * * * * * * * * * * * * *
CALLNAT 'ADRN0004' CG-S01.MEMBER-CONTACT-ID #HEADER1 #HEADER2   
FIND CNT-V WITH CONTACT-ID = CG-S01.MEMBER-CONTACT-ID            
  IF CONTACT-TYPE = 'I' OR = ' '
    COMPRESS '<Member>' #H-NAME INTO #SAVE-HEADER LEAVING NO
    MOVE #SAVE-HEADER TO #H-NAME  
    MOVE TRUE TO #INDIVIDUAL
  ELSE
    IF DATE-OF-BIRTH > 0
      COMPRESS #DOB-MM #DOB-DD #DOB-YY INTO #DATE-OF-BIRTH LEAVING NO
    END-IF
    IF DATE-OF-DEATH > 0
      COMPRESS #DOD-MM #DOD-DD #DOD-YY INTO #DATE-OF-DEATH LEAVING NO
    END-IF
  END-IF
  MOVE PREFIX-TITLE TO #CG-RANK.#PREFIX-TITLE 
  #PREFIX-TITLE-DESC-MSG := FUNCTION-PREFIX-DESC(<PREFIX-TITLE>)
  MOVE *ISN TO #CNT-ISN
END-FIND  
*
IF #RANK-PROTECTION = 'Y'
  COMPRESS #PREFIX-TITLE-DESC '(Prefix used when Rank is protected)' INTO #PREFIX-TITLE-DESC-MSG
ELSE
  MOVE #PREFIX-TITLE-DESC TO #PREFIX-TITLE-DESC-MSG
END-IF
*
END-SUBROUTINE                                                       
* * * * *
DEFINE SUBROUTINE SPECIAL-EDITS
* * * * *
*
IF  ((APPL-SOURCE =  'AER') AND (#HOLD-SOURCE NE 'AER'))
    OR ((APPL-SOURCE NE 'AER') AND (#HOLD-SOURCE =  'AER'))
    OR ((APPL-SOURCE =  'NMCRS') AND (#HOLD-SOURCE NE 'NMCRS'))
    OR ((APPL-SOURCE NE 'NMCRS') AND (#HOLD-SOURCE =  'NMCRS'))
    OR ((APPL-SOURCE =  'AFAS')  AND (#HOLD-SOURCE NE 'AFAS'))
    OR ((APPL-SOURCE NE 'AFAS')  AND (#HOLD-SOURCE =  'AFAS'))
    OR ((APPL-SOURCE =  'CGMA')  AND (#HOLD-SOURCE NE 'CGMA'))
    OR ((APPL-SOURCE NE 'CGMA')  AND (#HOLD-SOURCE =  'CGMA'))
    OR ((APPL-SOURCE =  'UWSF')  AND (#HOLD-SOURCE NE 'UWSF'))
    OR ((APPL-SOURCE NE 'UWSF')  AND (#HOLD-SOURCE =  'UWSF'))
  IF #CGA-SCR-ID GT 1900
    REINPUT '"AER/NMCRS/AFAS/CGMA/UWSF" cannot be modified'
      MARK *APPL-SOURCE
  END-IF
END-IF
*
**IF NOT CG-S01.INS-MAIL-CODE = 'B' OR = 'E' OR = 'A' OR = 'S' OR = ' ' /* RE17 START
*    OR = 'F' OR = 'T'
*  REINPUT USING HELP
*    MARK *INS-MAIL-CODE
**END-IF
#MSG := FUNCTION-CV-CHECK (<'042',CG-S01.INS-MAIL-CODE>)
IF #MSG > ' '
  REINPUT #MSG
    MARK *INS-MAIL-CODE
END-IF                                                                  /* RE17 END
*
RESET #NON-OWNER-POLS-EXIST
RESET #OWNER-POLS-EXIST
RESET #D-POLS-EXIST
FOR #I1 1 TO 9
  IF CG-S01.STATUS (#I1) = 'D'
*
    IF CG-S01.OWNERSHIP-FLAG (#I1) = 'D'
      MOVE TRUE TO #D-POLS-EXIST
    END-IF
*
    IF CG-S01.OWNERSHIP-FLAG (#I1) = ' ' OR = 'N'
      MOVE TRUE TO #OWNER-POLS-EXIST
    END-IF
  END-IF
END-FOR
*
**IF CG-S01.WIDOW-FLAG = 'Y'                  /* RE16 START
*  IF CG-S01.TITLE-SP NE 'MISS'
*    RESET #RANK-DISPL
*    CALLNAT 'GRANKSXX' #CGA-ORIG-COMMAND CG-S01.TITLE-SP-3
*      CG-S01.MILITARY-SERVICE
*      #INVALID #RANK-DISPL #RANK-LIT #RANK-DISPLAY
*    IF #INVALID
*        OR (CG-S01.TITLE-SP-LAST-1 NE ' ')
*      REINPUT USING HELP
*        MARK *CG-S01.TITLE-SP
*    END-IF
*  END-IF
**ELSE                                        /* RE16 END
*  IF   (NOT CG-S01.PROXY = 'Y' OR = 'N')                   /* RE17 START
*      AND (CG-S01.ID-NUMBER GT 1900)
*    REINPUT 'PROXY MUST BE "Y" OR "N"'
*      MARK *CG-S01.PROXY
*  END-IF
#MSG := FUNCTION-CV-CHECK (<'047',CG-S01.PROXY>)
IF #MSG > ' '
  REINPUT #MSG
    MARK *PROXY
END-IF                                                      /* RE17 END
**
**END-IF 
*
IF  (NOT CG-S01.PC-1 = ' ' OR = 'Y' OR = 'N' OR = 'X')
    OR (NOT CG-S01.PC-2 = ' ' OR = 'Y' OR = 'N' OR = 'X' OR = 'A' OR = 'E')
    OR (NOT CG-S01.PC-3 = ' ' OR = 'Y' OR = 'N' OR = 'X' OR = 'C')
    OR (NOT CG-S01.PC-4 = ' ' OR = 'Y' OR = 'N' OR = 'X' OR = 'C')
    OR (NOT CG-S01.PC-5 = ' ' OR = 'Y' OR = 'N' OR = 'X' OR = 'S' OR = 'O'
    OR = 'Q' OR = 'P')
    OR (NOT CG-S01.PC-6 = ' ' OR = 'Y' OR = 'N' OR = 'X' OR = 'S' OR = 'O')
  REINPUT USING HELP
    MARK *CG-S01.PC-1
END-IF
*
**IF   (NOT CG-S01.ANNUAL-RPT-FLAG = 'N' OR = 'F' OR = 'S')  /* RE17 START
*    AND (CG-S01.ID-NUMBER GT 1900)
*  REINPUT USING HELP
*    MARK *CG-S01.ANNUAL-RPT-FLAG
**END-IF
#MSG := FUNCTION-CV-CHECK (<'046',CG-S01.ANNUAL-RPT-FLAG>)
IF #MSG > ' '
  REINPUT #MSG
    MARK *ANNUAL-RPT-FLAG
END-IF                                                      
*
**IF NOT CG-S01.NEWSLETTER-CODE= 'N' OR = 'Y' OR = 'E' OR = 'B'
*  REINPUT USING HELP
*    MARK *CG-S01.NEWSLETTER-CODE
**END-IF
#MSG := FUNCTION-CV-CHECK (<'043',CG-S01.NEWSLETTER-CODE>)
IF #MSG > ' '
  REINPUT #MSG
    MARK *NEWSLETTER-CODE
END-IF                                                     
*
**IF NOT CG-S01.DATE-BOOK = 'N' OR = 'Y'
*  REINPUT USING HELP                         
*    MARK *CG-S01.DATE-BOOK
**END-IF
#MSG := FUNCTION-CV-CHECK (<'045',CG-S01.DATE-BOOK>)
IF #MSG > ' '
  REINPUT #MSG
    MARK *DATE-BOOK
END-IF                                                      /* RE17 END
*
IF CG-S01.PROCESS-IND = 'C'
  #EDIT-FLAG  := "C"
END-IF
*
**IF #MAIN-NAME NE #MAIN-NAME-HOLD                /* RE16 
*  IF   (#SCR-NM-CHG-REASON = ' ')
*      AND (CG-S01.ID-NUMBER GT 1900)
*    #SCR-NM-CHG-REASON-LBL_CV := (AD=PI)                    /* bz1
*    #SCR-NM-CHG-REASON_CV     := (AD=U)                     /* bz1
*    REINPUT 'Name-chg-reason required (marriage/divorce/no reason/etc)'
*      MARK *#SCR-NM-CHG-REASON
**  END-IF
**END-IF
*
IF #DT-MBR-CARD-MAILED NE #HOLD-DT-MBR-CARD-SINCE
  IF #DT-MBR-CARD-MAILED EQ 0
    MOVE 0 TO DT-MBR-CARD-SINCE
  ELSE
    IF #DT-MBR-CARD-MAILED NE MASK(MMDDYYYY)
      REINPUT 'INVALID MBR CARD DATE FORMAT - REINPUT MMDDYYYY'
        MARK *#DT-MBR-CARD-MAILED
    ELSE
      MOVE #DT-MBR-CARD-MAILED TO #WMMDDYYYY-N
      MOVE BY NAME #WMMDDYYYY TO #WYYYYMMDD
      MOVE #WYYYYMMDD-N TO DT-MBR-CARD-SINCE
    END-IF
  END-IF
END-IF
*
**IF ((NOT INTRO-FLAG = 'S' OR = 'K' OR = 'G')              /* RE11
*    AND (CG-S01.PROCESS-IND NE 'C'))
*    OR (CG-S01.RANK NE ' ')
*  RESET #RANK-DISPL
*    WRITE '=' #INVALID '='#CGA-ORIG-COMMAND '='CG-S01.RANK '='CG-S01.MILITARY-SERVICE '='#RANK-DISPL '='#RANK-LIT
*  CALLNAT 'GRANKSXX' #CGA-ORIG-COMMAND CG-S01.RANK
*    CG-S01.MILITARY-SERVICE #INVALID #RANK-DISPL #RANK-LIT
*    #RANK-DISPLAY
**
*  IF #INVALID
*    REINPUT USING HELP
*      MARK *CG-S01.RANK
*  END-IF
*
*  CALLNAT 'GRANKSXX' #CGA-ORIG-COMMAND #HOLD-RANK
*    CG-S01.MILITARY-SERVICE #INVALID #OLD-DISPL #RANK-LIT #RANK-DISPLAY
*  IF NOT #INVALID
*    IF   (#RANK-DISPL LE 30)   /* IS NOW A MILITARY RANK
*        AND (#RANK-DISPL GT #OLD-DISPL) /* AND IS LOWER THAN BEFORE
*      MOVE TRUE TO #RANK-LOWERED
*    END-IF
*  END-IF
*
*  IF  (RANK = 'DR' OR = 'MR' OR = 'MRS' OR = 'MS' OR = 'MIS' OR = 'REV')
*      AND (MILITARY-STATUS = 'A')
*    REINPUT 'RANK required with act mil status'
*      MARK *CG-S01.RANK
*  END-IF
**END-IF
*
**IF ((NOT INTRO-FLAG = 'S' OR = 'K' OR = 'G')
*    AND (CG-S01.PROCESS-IND NE 'C'))
*  CALLNAT 'GMLSTSXX' CG-S01.MILITARY-STATUS #INVALID #ERR-MSG
*  IF #INVALID AND (CG-S01.PROCESS-IND NE 'C')
*    REINPUT USING HELP
*      MARK *CG-S01.MILITARY-STATUS
*  END-IF
*
*  CALLNAT 'GMLIDSXX' CG-S01.MILITARY-SERVICE #INVALID #ERR-MSG
*  IF #INVALID AND (CG-S01.PROCESS-IND NE 'C')
*    REINPUT USING HELP
*      MARK *CG-S01.MILITARY-SERVICE
*  END-IF
**END-IF
*
**IF   (CG-S01.CHIEF-OF-STAFF-IND = 'Y')
*    AND (CG-S01.RANK NE 'GEN')
*  REINPUT 'IF CHIEF-OF-STAFF THEN RANK MUST BE "GEN"'
*    MARK *CG-S01.RANK
**END-IF
*
**IF   (CG-S01.DATE-RETIRED NE 0)
*    AND (CG-S01.MILITARY-STATUS = 'A')
*  REINPUT 'MIL-STAT CANNOT BE "A" IF RETD-DATE EXISTS - See CB Screen'  /* DW4
*    MARK *CG-S01.MILITARY-STATUS
**END-IF
*
**IF  (CG-S01.RANK NE 'CDT')
*    AND (CG-S01.MILITARY-SERVICE = 'ACR' OR = 'FCR')
*  REINPUT 'RANK MUST BE "CDT" IF SERVICE IS "ACR" OR "FCR"'
*    MARK *CG-S01.RANK
**END-IF
*                                                                 /* RE11
IF   (APPL-SOURCE = ' ')
  IF  (#HOLD-SOURCE = ' ')
    IGNORE
  ELSE
    REINPUT 'CANNOT CLEAR PREV ENTERED APPL SOURCE'
      MARK *CG-S01.APPL-SOURCE
  END-IF
END-IF
*
IF #HOLD-SUSPEND-CODE NE SUSPEND-CODE
  #MSG := FUNCTION-CODE-A-DESC (<'044',CG-S01.SUSPEND-CODE>)  /* RE17 START
  IF #MSG > ' '
    REINPUT #MSG
      MARK *SUSPEND-CODE
  END-IF 
**  IF ((SUSPEND-CODE GE '5') AND (SUSPEND-CODE LE '9'))
*      OR (SUSPEND-CODE = ' ')
*    IGNORE
*  ELSE
*    REINPUT USING HELP
*      MARK *CG-S01.SUSPEND-CODE
*  END-IF                                               /* RE17 END
END-IF
*
IF #SCN-TRADE-UP-DT-N NE #HOLD-TRADE-UP-SENT-DT
  IF #SCN-TRADE-UP-DT-N EQ 0
    MOVE 0 TO CG-S01.TRAD-UP-SENT-DT
  ELSE
    IF #SCN-TRADE-UP-DT-N NE MASK(MMDDYYYY)
      REINPUT 'Invalid Trade-Up Letter Date Format - REINPUT MMDDYYYY'
        MARK *#SCN-TRADE-UP-DT
    ELSE
      MOVE #SCN-TRADE-UP-YYYY TO TRADE-UP-DATE-YYYY
      MOVE #SCN-TRADE-UP-MM   TO TRADE-UP-DATE-MM
      MOVE #SCN-TRADE-UP-DD   TO TRADE-UP-DATE-DD
    END-IF
  END-IF
END-IF
*
**IF NOT CG-S01.BRIDGER-IND = 'N' OR = 'Y' OR = 'V'                  /* PM9  RE17 START
*  REINPUT 'CAP Bridger file indicator must be "Y", "N" or "V"'     /* PM9
*    MARK *CG-S01.BRIDGER-IND                                         /* PM9
**END-IF                                                             /* PM9
#MSG := FUNCTION-CV-CHECK (<'048',CG-S01.BRIDGER-IND>)
IF #MSG > ' '
  REINPUT #MSG
    MARK *BRIDGER-IND
END-IF                                                      /* RE17 END
*
END-SUBROUTINE /* (0952)
* *
DEFINE SUBROUTINE PREPARE-RECORD
* *
IF   (CG-S01.RANK NE #HOLD-RANK)
    AND (NOT #RANK-LOWERED)
    AND (NOT CG-S01.CHIEF-OF-STAFF-IND = 'F' OR = 'C')
    AND (CG-S01.MILITARY-STATUS = 'A')
    AND (NOT CG-S01.RANK = 'GA' OR = 'O11')
  MOVE TRUE TO #ASSUM-DOP
*
  IF CG-S01.DATE-OF-RANK NE 0
    MOVE CG-S01.DATE-OF-RANK TO CG-S01.PRIOR-DATE-OF-RANK
    RESET CG-S01.DATE-OF-RANK
  END-IF
END-IF
*
IF NEWSLETTER-CODE = 'Y' RESET NEWSLETTER-CODE END-IF
IF DATE-BOOK = 'N' RESET DATE-BOOK END-IF
IF DATA-SHARED-IND = 'N' RESET DATA-SHARED-IND END-IF
*
MOVE *DATN TO DTS-DATN
MOVE *TIMN TO DTS-TIMN
*
END-SUBROUTINE /* (1209)
*
* *
*
DEFINE SUBROUTINE PROCESS-TRLOG
* *
GET OLD-V #CGA-ISN /* READ ORIG REC BEFORE UPDATE(S)
MOVE TRUE TO #MEMBER-ONLY
MOVE 1 TO #TRX
RESET #SFX
IF #MEMBER
  GET CNT-V #CNT-ISN
ELSE                                                    /* RE18 
  FIND CNT-V WITH CONTACT-ID = OLD-V.SPOUSE-CONTACT-ID  /* RE18
  END-FIND                                              /* RE18
*  #I := #I + 1
*  #FIELD-DESCRIPTION(#I) := 'CG-SPS'
*  #OLD-DATA(#I)          := FUNCTION-DISP-CT-NAME(<CNT-V.FIRST-NAME,CNT-V.MIDDLE-NAME,CNT-V.LAST-NAME,CNT-V.SUFFIX>)
*  #NEW-DATA(#I)          := FUNCTION-DISP-CT-NAME(<CNT-V.FIRST-NAME,CNT-V.MIDDLE-NAME,CNT-V.LAST-NAME,CNT-V.SUFFIX>)
END-IF                                                  /* RE18
*
IF #OLD-NAME NE ' '          /* NG1
  ASSIGN OLD-V.NAME = #OLD-NAME
END-IF

IF OLD-V.NAME NE CG-S01.NAME
  ASSIGN #FIELD-CHANGED = TRUE                            /* RE18 START
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-NAME'
  #OLD-DATA(#I)          := OLD-V.NAME
  #NEW-DATA(#I)          := FUNCTION-DISP-CT-NAME(<CNT-V.FIRST-NAME,CNT-V.MIDDLE-NAME,CNT-V.LAST-NAME,CNT-V.SUFFIX>)
  IF #NAME-CHG-RSN-MEMBER NE ' '
    COMPRESS #NEW-DATA(#I) '  REASON:' #NAME-CHG-RSN-MEMBER INTO #NEW-DATA(#I)
  END-IF
END-IF
*
IF  (#OLD-PREFIX-TITLE NE CNT-V.PREFIX-TITLE)
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  IF #MEMBER
    #FIELD-DESCRIPTION(#I) := 'CG-PREFIX'
  ELSE
    #FIELD-DESCRIPTION(#I) := 'CG-SP-PFX'
  END-IF
  #OLD-DATA(#I)      := #OLD-PREFIX-TITLE 
  #NEW-DATA(#I)      := CNT-V.PREFIX-TITLE
END-IF
*
IF #MEMBER
  IF #OLD-SSN NE 0                /* NG1
    ASSIGN OLD-V.SSN = #OLD-SSN
  END-IF
  IF  (OLD-V.SSN NE CG-S01.SSN)
    ASSIGN #FIELD-CHANGED = TRUE
    ASSIGN #UPDATE-DATE   = TRUE
    #I := #I + 1
    #FIELD-DESCRIPTION(#I) := 'CG-SSN'
    #OLD-DATA(#I)      := OLD-V.SSN-X 
    #NEW-DATA(#I)      := CG-S01.SSN-X
  END-IF
ELSE
  IF  (#OLD-SSN-SP NE CNT-V.SSN)
    ASSIGN #FIELD-CHANGED = TRUE
    ASSIGN #UPDATE-DATE   = TRUE
    #I := #I + 1
    #FIELD-DESCRIPTION(#I) := 'CG-SP-SSN'
    #OLD-DATA(#I)      := #OLD-SSN-SP-A
    #NEW-DATA(#I)      := CNT-V.SSN-A
  END-IF
END-IF
*
IF  #OLD-SSN-PROTECT NE CNT-V.SSN-PROTECT
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  IF #MEMBER 
    #FIELD-DESCRIPTION(#I) := 'CG-SSN-PR'
  ELSE
    #FIELD-DESCRIPTION(#I) := 'CG-SP-SPR'
  END-IF
  #OLD-DATA(#I)      := #OLD-SSN-PROTECT
  #NEW-DATA(#I)      := CNT-V.SSN-PROTECT
END-IF
*
IF  #OLD-DOB NE CNT-V.DATE-OF-BIRTH
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  IF #MEMBER 
    #FIELD-DESCRIPTION(#I) := 'CG-DOB'
  ELSE
    #FIELD-DESCRIPTION(#I) := 'CG-SP-DOB'
  END-IF
  MOVE #OLD-DOB TO #DATE-N 
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #OLD-DATA(#I) LEAVING NO
  MOVE CNT-V.DATE-OF-BIRTH TO #DATE-N CG-S01.DATE-OF-BIRTH             /* RE21        
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #NEW-DATA(#I) LEAVING NO
END-IF
*
IF OLD-V.DATE-OF-MARRIAGE NE CG-S01.DATE-OF-MARRIAGE OR #OLD-SP-DOM NE #NEW-SP-DOM   /* RE20 START
  IF OLD-V.DATE-OF-MARRIAGE NE CG-S01.DATE-OF-MARRIAGE
    MOVE CG-S01.DATE-OF-MARRIAGE TO #DATE-N                           /* switch values because
    MOVE OLD-V.DATE-OF-MARRIAGE TO CG-S01.DATE-OF-MARRIAGE            /* current record actually contains old value
    MOVE #DATE-N TO OLD-V.DATE-OF-MARRIAGE                            /* and vice-versa
  END-IF                                                                             /* RE20 OLD
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-SP-DOM'
  IF OLD-V.DATE-OF-MARRIAGE NE CG-S01.DATE-OF-MARRIAGE   /* RE20 START
    MOVE OLD-V.DATE-OF-MARRIAGE TO #DATE-N   
  ELSE
    MOVE #OLD-SP-DOM TO #DATE-N
  END-IF                                                 /* RE20 END
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #OLD-DATA(#I) LEAVING NO
  IF OLD-V.DATE-OF-MARRIAGE NE CG-S01.DATE-OF-MARRIAGE   /* RE20 START
    MOVE CG-S01.DATE-OF-MARRIAGE TO #DATE-N                           
  ELSE
    MOVE #NEW-SP-DOM TO #DATE-N
  END-IF                                                 /* RE20 END
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #NEW-DATA(#I) LEAVING NO 
END-IF
*
IF  OLD-V.DATE-OF-DIVORCE NE CG-S01.DATE-OF-DIVORCE OR #OLD-SP-DIV NE #NEW-SP-DIV   /* RE20 START
  IF OLD-V.DATE-OF-DIVORCE NE CG-S01.DATE-OF-DIVORCE
    MOVE CG-S01.DATE-OF-DIVORCE TO #DATE-N                           /* switch values because
    MOVE OLD-V.DATE-OF-DIVORCE TO CG-S01.DATE-OF-DIVORCE            /* current record actually contains old value
    MOVE #DATE-N TO OLD-V.DATE-OF-DIVORCE                            /* and vice-versa
  END-IF                                                                             /* RE20 OLD
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-SP-DIV'
  IF OLD-V.DATE-OF-DIVORCE NE CG-S01.DATE-OF-DIVORCE   /* RE20 START
    MOVE OLD-V.DATE-OF-DIVORCE TO #DATE-N 
  ELSE
    MOVE #OLD-SP-DIV TO #DATE-N 
  END-IF                                               /* RE20 END
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #OLD-DATA(#I) LEAVING NO
  IF OLD-V.DATE-OF-DIVORCE NE CG-S01.DATE-OF-DIVORCE   /* RE20 START  
    MOVE CG-S01.DATE-OF-DIVORCE TO #DATE-N 
  ELSE
    MOVE #NEW-SP-DIV TO #DATE-N 
  END-IF                                               /* RE20 END
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #NEW-DATA(#I) LEAVING NO 
END-IF
*
IF  #OLD-BCC NE CNT-V.BIRTH-CERT-CODE
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  IF #MEMBER
    #FIELD-DESCRIPTION(#I) := 'CG-BCC'
  ELSE
    #FIELD-DESCRIPTION(#I) := 'CG-SP-BCC'
  END-IF
  #OLD-DATA(#I)      := #OLD-BCC
  #NEW-DATA(#I)      := CNT-V.BIRTH-CERT-CODE
END-IF
*
IF  #OLD-DCC NE CNT-V.DEATH-CERT-CODE
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  IF #MEMBER
    #FIELD-DESCRIPTION(#I) := 'CG-DCC'
  ELSE
    #FIELD-DESCRIPTION(#I) := 'CG-SP-DCC'
  END-IF
  #OLD-DATA(#I)      := #OLD-DCC
  #NEW-DATA(#I)      := CNT-V.DEATH-CERT-CODE
END-IF
*
IF  OLD-V.MARRIAGE-CERT-CODE NE CG-S01.MARRIAGE-CERT-CODE OR #OLD-SP-MCC NE #NEW-SP-MCC   /* RE20 START
  IF OLD-V.MARRIAGE-CERT-CODE NE CG-S01.MARRIAGE-CERT-CODE
    MOVE CG-S01.MARRIAGE-CERT-CODE TO #SAVE-MCC
    MOVE OLD-V.MARRIAGE-CERT-CODE TO CG-S01.MARRIAGE-CERT-CODE
    MOVE #SAVE-MCC TO OLD-V.MARRIAGE-CERT-CODE
  END-IF                                                                                  /* RE20 END
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-SP-MCC'
  IF OLD-V.MARRIAGE-CERT-CODE NE CG-S01.MARRIAGE-CERT-CODE    /* RE20 START
    #OLD-DATA(#I)      := OLD-V.MARRIAGE-CERT-CODE 
  ELSE
    #OLD-DATA(#I)      := #OLD-SP-MCC
  END-IF
  IF OLD-V.MARRIAGE-CERT-CODE NE CG-S01.MARRIAGE-CERT-CODE
    #NEW-DATA(#I)      := CG-S01.MARRIAGE-CERT-CODE  
  ELSE
    #NEW-DATA(#I)      := #NEW-SP-MCC 
  END-IF                                                      /* RE20 END
END-IF
*
IF OLD-V.INS-MAIL-CODE NE CG-S01.INS-MAIL-CODE
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-INS-ML'
  #OLD-DATA(#I)      := OLD-V.INS-MAIL-CODE
  #NEW-DATA(#I)      := CG-S01.INS-MAIL-CODE
END-IF
*
IF OLD-V.MEMBERSHIP-DRIVE NE CG-S01.MEMBERSHIP-DRIVE
  MOVE *DATN TO CG-S01.LAST-MBRSHIP-PHONE-DT
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-PC-CDS'
  #OLD-DATA(#I)      := OLD-V.MEMBERSHIP-DRIVE
  #NEW-DATA(#I)      := CG-S01.MEMBERSHIP-DRIVE
END-IF
*
IF #MEMBER
  IF #OLD-GENDER NE ' '             /* NG1
    ASSIGN OLD-V.SEX = #OLD-GENDER
  END-IF
  IF OLD-V.SEX  NE CG-S01.SEX
    ASSIGN #FIELD-CHANGED = TRUE
    ASSIGN #UPDATE-DATE   = TRUE
    #I := #I + 1
    #FIELD-DESCRIPTION(#I) := 'CG-SEX'
    #OLD-DATA(#I)      := OLD-V.SEX
    #NEW-DATA(#I)      := CG-S01.SEX
  END-IF
ELSE
  IF #OLD-SEX  NE CNT-V.GENDER-CD
    ASSIGN #FIELD-CHANGED = TRUE
    ASSIGN #UPDATE-DATE   = TRUE
    #I := #I + 1
    #FIELD-DESCRIPTION(#I) := 'CG-SP-SEX'
    #OLD-DATA(#I)      := #OLD-SEX
    #NEW-DATA(#I)      := CNT-V.GENDER-CD
  END-IF
END-IF
*
IF OLD-V.PROXY NE CG-S01.PROXY
  ASSIGN #FIELD-CHANGED = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-PROXY'
  #OLD-DATA(#I)      := OLD-V.PROXY
  #NEW-DATA(#I)      := CG-S01.PROXY
END-IF
*
IF OLD-V.DATE-BOOK NE CG-S01.DATE-BOOK
  ASSIGN #FIELD-CHANGED = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-ANN-MTG'
  #OLD-DATA(#I)      := OLD-V.DATE-BOOK
  #NEW-DATA(#I)      := CG-S01.DATE-BOOK
END-IF
*
IF OLD-V.SUSPEND-CODE NE CG-S01.SUSPEND-CODE
  ASSIGN #FIELD-CHANGED = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-SUS-CD'
  #OLD-DATA(#I)      := OLD-V.SUSPEND-CODE
  #NEW-DATA(#I)      := CG-S01.SUSPEND-CODE
END-IF
*
IF OLD-V.ANNUAL-RPT-FLAG NE CG-S01.ANNUAL-RPT-FLAG
  ASSIGN #FIELD-CHANGED = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-ANN-RP'
  #OLD-DATA(#I)      := OLD-V.ANNUAL-RPT-FLAG
  #NEW-DATA(#I)      := CG-S01.ANNUAL-RPT-FLAG
END-IF
*
IF #OLD-NAME-SP NE ' '             /* NG1   
  ASSIGN OLD-V.NAME-SP = #OLD-NAME-SP
END-IF
IF OLD-V.NAME-SP NE CG-S01.NAME-SP
  ASSIGN #FIELD-CHANGED = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-SPS-NM'
  #OLD-DATA(#I)      := OLD-V.NAME-SP
  #NEW-DATA(#I)          := FUNCTION-DISP-CT-NAME(<CNT-V.FIRST-NAME,CNT-V.MIDDLE-NAME,CNT-V.LAST-NAME,CNT-V.SUFFIX>)
  IF #NAME-CHG-RSN-SPOUSE NE ' '
    COMPRESS #NEW-DATA(#I) '  REASON:' #NAME-CHG-RSN-SPOUSE INTO #NEW-DATA(#I)
  END-IF
END-IF
*
IF OLD-V.NEWSLETTER-CODE NE CG-S01.NEWSLETTER-CODE
  ASSIGN #FIELD-CHANGED = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-NEWS-CD'
  #OLD-DATA(#I)      := OLD-V.NEWSLETTER-CODE
  #NEW-DATA(#I)      := CG-S01.NEWSLETTER-CODE
END-IF
*
IF OLD-V.DT-MBR-CARD-SINCE NE CG-S01.DT-MBR-CARD-SINCE
  ASSIGN #FIELD-CHANGED = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-DT-MBR'
  #OLD-DATA(#I)      := OLD-V.DT-MBR-CARD-SINCE
  #NEW-DATA(#I)      := CG-S01.DT-MBR-CARD-SINCE
END-IF
*
**IF #TRX GT 32
*  PERFORM WRITE-TRLOG
*  RESET OLD-DATA(*) NEW-DATA(*)
*  RESET SYNC-FLD-NUM (*) SYNC-FLD-OLD-DATA(*) SYNC-FLD-NEW-DATA (*)
*  MOVE 1 TO #TRX
*  RESET #SFX
**END-IF
*
IF OLD-V.TRAD-UP-SENT-DT NE CG-S01.TRAD-UP-SENT-DT
  ASSIGN #FIELD-CHANGED = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-TRD-UP'
  #OLD-DATA(#I)      := OLD-V.TRAD-UP-SENT-DT
  #NEW-DATA(#I)      := CG-S01.TRAD-UP-SENT-DT
END-IF
*
IF CG-S01.BRIDGER-IND = 'N'                                       /* PM9
  RESET CG-S01.BRIDGER-IND                                        /* PM9
END-IF                                                            /* PM9
IF OLD-V.BRIDGER-IND NE CG-S01.BRIDGER-IND                        /* PM9
  ASSIGN #FIELD-CHANGED = TRUE                                    /* PM9
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-BRIDGE'
  MOVE 'CG-BRIDGE'  TO #W-DESCRIPTION                             /* PM9
  IF OLD-V.BRIDGER-IND = ' '                                      /* PM9
    #OLD-DATA(#I)      := 'N'
  ELSE                                                            /* PM9
    #OLD-DATA(#I)      := OLD-V.BRIDGER-IND
  END-IF                                                          /* PM9
  IF CG-S01.BRIDGER-IND = ' '                                     /* PM9
    #NEW-DATA(#I)      := 'N'
  ELSE                                                            /* PM9
    #NEW-DATA(#I)      := CG-S01.BRIDGER-IND
  END-IF                                                          /* PM9
END-IF                                                            /* PM9   RE18 END
*
IF #UPDATE-DATE MOVE *DATN TO CG-S01.DATE-OTHER-UPDATE END-IF

END-SUBROUTINE /* (1235)
* *
DEFINE SUBROUTINE PROCESS-TRLOG-FOR-WIDOW-WITH-CN   /* RE20
* *
RESET #I
IF #NAME-CHG-RSN-SPOUSE NE ' '
  ASSIGN #FIELD-CHANGED = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-NAME'
  #OLD-DATA(#I)      := OLD-V.NAME-SP
  #NEW-DATA(#I)      := FUNCTION-DISP-CT-NAME(<CNT-V.FIRST-NAME,CNT-V.MIDDLE-NAME,CNT-V.LAST-NAME,CNT-V.SUFFIX>)
  COMPRESS #NEW-DATA(#I) '  REASON:' #NAME-CHG-RSN-SPOUSE INTO #NEW-DATA(#I)
END-IF
*
IF  (#OLD-PREFIX-TITLE NE CNT-V.PREFIX-TITLE)
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-PREFIX'
  #OLD-DATA(#I)      := #OLD-PREFIX-TITLE 
  #NEW-DATA(#I)      := CNT-V.PREFIX-TITLE
END-IF
*
IF  (#OLD-SSN-SP NE CNT-V.SSN)
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-SSN'
  #OLD-DATA(#I)      := #OLD-SSN-SP-A
  #NEW-DATA(#I)      := CNT-V.SSN-A
END-IF
*
IF  #OLD-SSN-PROTECT NE CNT-V.SSN-PROTECT
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-SSN-PR'
  #OLD-DATA(#I)      := #OLD-SSN-PROTECT
  #NEW-DATA(#I)      := CNT-V.SSN-PROTECT
END-IF
*
IF  #OLD-DOB NE CNT-V.DATE-OF-BIRTH
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-DOB'
  MOVE #OLD-DOB TO #DATE-N 
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #OLD-DATA(#I) LEAVING NO
  MOVE CNT-V.DATE-OF-BIRTH TO #DATE-N 
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #NEW-DATA(#I) LEAVING NO
END-IF
*
IF #OLD-SP-DOM NE #NEW-SP-DOM   
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-DOM'
  MOVE #OLD-SP-DOM TO #DATE-N
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #OLD-DATA(#I) LEAVING NO
  MOVE #NEW-SP-DOM TO #DATE-N
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #NEW-DATA(#I) LEAVING NO 
END-IF
*
IF #OLD-SP-DIV NE #NEW-SP-DIV   /* RE20 START
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-DIV'
  MOVE #OLD-SP-DIV TO #DATE-N 
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #OLD-DATA(#I) LEAVING NO
  MOVE #NEW-SP-DIV TO #DATE-N 
  COMPRESS #DATE-MM #DATE-DD #DATE-YY INTO #NEW-DATA(#I) LEAVING NO 
END-IF
*
IF  #OLD-BCC NE CNT-V.BIRTH-CERT-CODE
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-BCC'
  #OLD-DATA(#I)      := #OLD-BCC
  #NEW-DATA(#I)      := CNT-V.BIRTH-CERT-CODE
END-IF
*
IF  #OLD-DCC NE CNT-V.DEATH-CERT-CODE
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-DCC'
  #OLD-DATA(#I)      := #OLD-DCC
  #NEW-DATA(#I)      := CNT-V.DEATH-CERT-CODE
END-IF
*
IF #OLD-SP-MCC NE #NEW-SP-MCC   
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-MCC'
  #OLD-DATA(#I)      := #OLD-SP-MCC 
  #NEW-DATA(#I)      := #NEW-SP-MCC 
END-IF
*
IF #OLD-SEX  NE CNT-V.GENDER-CD
  ASSIGN #FIELD-CHANGED = TRUE
  ASSIGN #UPDATE-DATE   = TRUE
  #I := #I + 1
  #FIELD-DESCRIPTION(#I) := 'CG-SEX'
  #OLD-DATA(#I)      := #OLD-SEX
  #NEW-DATA(#I)      := CNT-V.GENDER-CD
END-IF
*
END-SUBROUTINE
*
DEFINE SUBROUTINE WRITE-TRANS-REG              /* RE18
* *
IF #MEMBER-ONLY                                        /* RE20
  MOVE CG-S01.ID-NUMBER        TO #TR-ID-NUMBER
  MOVE CG-S01.NAME             TO #TR-NAME
  RESET #MEMBER-ONLY
ELSE
  MOVE CNT-V.ID-NUMBER         TO #TR-ID-NUMBER   /* RE20 START
  MOVE FUNCTION-DISP-CT-NAME(<CNT-V.FIRST-NAME,CNT-V.MIDDLE-NAME,CNT-V.LAST-NAME,CNT-V.SUFFIX>) TO #TR-NAME 
END-IF                                            /* RE20 END
MOVE OLD-V.DATE-OTHER-UPDATE TO #TR-DATE-LAST-UPDATE
MOVE #CGA-CLERK              TO #TR-CLERK-ID
CALLNAT 'GPRN0004'
  #TR-FIELDS #SYNC-FIELD-TABLE(*)
  #OLD-DATA-TABLE(*) #NEW-DATA-TABLE(*)
RESET #FIELD-DESCRIPTION(*)
*
END-SUBROUTINE
* *
DEFINE SUBROUTINE WRITE-TRLOG
* *
*
**IF #NX-403                                          /* RE18 START
*  ADD 1 TO #SFX
*  MOVE 403 TO SYNC-FLD-NUM (#SFX)
*  MOVE 'NX Message' TO SYNC-FLD-NEW-DATA (#SFX)
*  ADD 1 TO #SFX
*  MOVE 503 TO SYNC-FLD-NUM (#SFX)                    /* DW1
*  MOVE 'NS Message' TO SYNC-FLD-NEW-DATA (#SFX)
**END-IF
*
**IF #NX-406
*  ADD 1 TO #SFX
*  MOVE 406 TO SYNC-FLD-NUM (#SFX)
*  MOVE 'NX Message' TO SYNC-FLD-NEW-DATA (#SFX)
*  ADD 1 TO #SFX
*  MOVE 502 TO SYNC-FLD-NUM (#SFX)
*  MOVE 'NS Message' TO SYNC-FLD-NEW-DATA (#SFX)
**END-IF                                              /* RE18 END
*
IF #NX-407
  ADD 1 TO #SFX
  MOVE 407 TO SYNC-FLD-NUM (#SFX)
  MOVE 'NX Message' TO SYNC-FLD-NEW-DATA (#SFX)
  MOVE CG-S01.ID-NUMBER   TO TRLOG.ID-NUMBER               /* RE18 START
  MOVE CG-S01.NAME        TO TRLOG.NAME
  MOVE CG-S01.PROCESS-IND TO TRLOG.PROCESS-IND
  MOVE OLD-V.DATE-OTHER-UPDATE TO TRLOG.DATE-LAST-UPDATE
  MOVE #CGA-CLERK TO TRLOG.CLERK-ID
  MOVE *INIT-ID   TO TRLOG.TERMINAL-ID
  MOVE *DATN      TO TRLOG.TRANSACTION-DATN
  MOVE *TIMN      TO TRLOG.TRANSACTION-TIMN
  MOVE 'CG-' TO NEW-DATA-CG (1)
  STORE TRLOG                                              /* RE18 END
END-IF
*
**IF #NX-408                                               /* RE18 START
*  ADD 1 TO #SFX
*  MOVE 408 TO SYNC-FLD-NUM (#SFX)
*  MOVE 'NX Message' TO SYNC-FLD-NEW-DATA (#SFX)
**END-IF
*
**MOVE CG-S01.ID-NUMBER   TO TRLOG.ID-NUMBER
**MOVE CG-S01.NAME        TO TRLOG.NAME
**MOVE CG-S01.PROCESS-IND TO TRLOG.PROCESS-IND             
**MOVE OLD-V.DATE-OTHER-UPDATE TO TRLOG.DATE-LAST-UPDATE
**MOVE #CGA-CLERK TO TRLOG.CLERK-ID
**MOVE *INIT-ID   TO TRLOG.TERMINAL-ID
**MOVE *DATN      TO TRLOG.TRANSACTION-DATN
**MOVE *TIMN      TO TRLOG.TRANSACTION-TIMN
**MOVE 'CG-' TO NEW-DATA-CG (1)
**STORE TRLOG                                             /* RE18 END
END-SUBROUTINE /* (1173)
* * * * * *
DEFINE SUBROUTINE RESET-YES-NO
* * * * * *
*
IF CG-S01.DATE-BOOK = ' '
  MOVE 'N' TO CG-S01.DATE-BOOK
END-IF
*
IF CG-S01.NEWSLETTER-CODE = ' '
  MOVE 'Y' TO CG-S01.NEWSLETTER-CODE
END-IF
END-SUBROUTINE
*
DEFINE POP-UP-CONTACT                /* NG1
/*     ==============
GET STATUS #CGA-ISN
RESET #MEMBER
* DECIDE FOR FIRST CONDITION
*  WHEN *CURS-LINE = 3
IF *CURS-LINE = 3
  MOVE TRUE TO #MEMBER
  ASSIGN #OLD-NAME    = CG-S01.NAME
  ASSIGN #OLD-SSN     = CG-S01.SSN
  ASSIGN #OLD-GENDER  = CG-S01.SEX
  FIND CNT-V WITH CONTACT-ID = STATUS.MEMBER-CONTACT-ID    /* RE18 START
    MOVE SSN-PROTECT  TO #OLD-SSN-PROTECT
    MOVE DATE-OF-BIRTH TO #OLD-DOB
    MOVE BIRTH-CERT-CODE TO #OLD-BCC
    MOVE DEATH-CERT-CODE TO #OLD-DCC
  END-FIND                                                 /* RE18 END
  IF #INDIVIDUAL                 /* RE17
    IGNORE
  ELSE
    #MODE := "O"                 /* RE17
  END-IF
  MOVE 'CG ADD' TO #MSG
  CALLNAT 'GUPCISXX'               /* RE1
*    CALLNAT 'GUPCGSXX'               /* RE1
    STATUS.MEMBER-CONTACT-ID
    STATUS.MEMBER-CONTACT-ID
    #CGA-ORIG-COMMAND
    STATUS.ID-NUMBER
    #CGA-USER-COMPANY
    #CGA-CLERK
    #MODE
    #MSG
  CALLNAT 'C2200NCG' STATUS.MEMBER-CONTACT-ID
    CG-S01.NAME
    CG-S01.SEX
    CG-S01.SSN
  P_CID := STATUS.MEMBER-CONTACT-ID                                       /* bz1
  MOVE 'X' TO #P-SEX                                                     /* RE7
  P_NAME := ' '                                                          /* bz2
  CALLNAT 'GPRS0CNT' P_CID P_NAME 1X V_DOB_M 1X V_DOD_M #P-SEX V_SSN_M   /* RE7
*  CALLNAT 'GPRS0CNT'  p_CID p_Name 1x v_DOB_m 1x v_DOD_m v_SEX_m v_SSN_m  /* bz1 RE7
  V_SEX_M := #P-SEX                                                      /* RE7
  V_NAME_M := P_NAME                                                      /* bz1
*  IF #MODE <> "N"                                                     /* RE16 START
*    #SCR-NM-CHG-REASON_CV := (AD=U)                        /* bz1
*    #SCR-NM-CHG-REASON-LBL_CV := (AD=P)                    /* bz1
*  END-IF  
  IF #MSG NE ' ' AND #MSG NE 'X'                                                          
    MOVE #MSG TO #NAME-CHG-RSN-MEMBER
  END-IF                                                                /* RE16 END
  RESET #MSG                                                          
  MOVE 1 TO *CURS-LINE     /* RE17
END-IF
*  WHEN *CURS-LINE = 4
IF CG-S01.WIDOW-FLAG = 'Y' AND *CURS-LINE = 4
*  ASSIGN #OLD-NAME-SP = CG-S01.NAME
  FIND CNT-V WITH CONTACT-ID = STATUS.SPOUSE-CONTACT-ID    /* RE18 START
    MOVE PREFIX-TITLE TO #OLD-PREFIX-TITLE
    MOVE GENDER-CD    TO #OLD-SEX
    MOVE SSN          TO #OLD-SSN-SP
    MOVE SSN-PROTECT  TO #OLD-SSN-PROTECT
    MOVE DATE-OF-BIRTH TO #OLD-DOB
    MOVE DATE-OF-DEATH TO #OLD-DOD
    MOVE BIRTH-CERT-CODE TO #OLD-BCC
    MOVE DEATH-CERT-CODE TO #OLD-DCC
    IF ID-NUMBER > 0                                        /* RE20 START
      FIND OLD-SP-V WITH ID-NUMBER = CNT-V.ID-NUMBER
        ASSIGN #OLD-SP-DOM  = OLD-SP-V.DATE-OF-MARRIAGE              
        ASSIGN #OLD-SP-MCC  = OLD-SP-V.MARRIAGE-CERT-CODE           
        ASSIGN #OLD-SP-DIV  = OLD-SP-V.DATE-OF-DIVORCE           
      END-FIND  
    END-IF                                                  /* RE20 END 
  END-FIND                                                /* RE18 END                 
  ASSIGN #OLD-NAME-SP = CG-S01.NAME-SP                       /* RE16
  #MODE := "C"
  MOVE 'CG ADD' TO #MSG
  CALLNAT 'GUPCISXX'             /* RE1
    STATUS.MEMBER-CONTACT-ID
    STATUS.SPOUSE-CONTACT-ID
    #CGA-ORIG-COMMAND
    STATUS.ID-NUMBER
    #CGA-USER-COMPANY
    #CGA-CLERK
    #MODE
    #MSG
  CALLNAT 'C2200NCG' STATUS.SPOUSE-CONTACT-ID
    CG-S01.NAME-SP
    #OLD-GENDER
    #OLD-SSN
  RESET #OLD-SSN
    #OLD-GENDER
  CALLNAT 'MBRCNTC'
    STATUS.SPOUSE-CONTACT-ID
    #XML
    #LINE
    #RESPONSE
    #CRM-REQUEST
  P_CID := STATUS.SPOUSE-CONTACT-ID                                       /* bz1
  MOVE 'X' TO #P-SEX                                                      /* RE7
  P_NAME := ' '                                                           /* bz2
  CALLNAT 'GPRS0CNT'  P_CID P_NAME 1X V_DOB_W 1X V_DOD_W #P-SEX V_SSN_W   /* RE7
*  CALLNAT 'GPRS0CNT'  p_CID p_Name 1x v_DOB_w 1x v_DOD_w v_SEX_w v_SSN_w  /* bz1 RE7
 V_SEX_W := #P-SEX                                                      /* RE7
 V_NAME_W := P_NAME                                                      /* bz1
  IF #MSG NE ' ' AND #MSG NE 'X'                         /* RE16 start                               
    MOVE #MSG TO #NAME-CHG-RSN-SPOUSE 
  END-IF                                                                /* RE16 END
  RESET #MSG                                                        
  IF CNT-V.ID-NUMBER > 0                                  /* RE20 START
    FIND OLD-SP-V WITH ID-NUMBER = CNT-V.ID-NUMBER
      ASSIGN #NEW-SP-DOM  = OLD-SP-V.DATE-OF-MARRIAGE              
      ASSIGN #NEW-SP-MCC  = OLD-SP-V.MARRIAGE-CERT-CODE           
      ASSIGN #NEW-SP-DIV  = OLD-SP-V.DATE-OF-DIVORCE           
    END-FIND  
  END-IF                                                  /* RE20 END 
END-IF
*  WHEN NONE IGNORE
* END-DECIDE
END-SUBROUTINE
* - - - - -  - - - - -  - - - - - - - - - - - - - - - - - - - - - - - -
DEFINE SUBROUTINE DO-HEADER-M
IGNORE
END-SUBROUTINE
END
