DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #OLD-VALUES
  2 #OLD-ACCESS-AUTH-CODE (A1)
  2 #OLD-DATE-BOOK (A1)
  2 #OLD-ANNUAL-RPT-FLAG (A1)
  2 #OLD-BRIDGER-IND (A1)
  2 #OLD-INS-MAIL-CODE (A1)
  2 #OLD-NEWSLETTER-CODE (A1)
  2 #OLD-CHIEF-OF-STAFF-IND (A1)
  2 #OLD-SUSPEND-CODE (A1)
END-DEFINE
