* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PGM-ID: C2330NCI   ** Claimants CALCULATER
***********************************************************************************
*                       MODIFICATION LOG
* USER   DATE      TAG  REASON
*
* NGG    20130905  Created
* bz1    12-3-2013   (OI-2373)
* vxt    03/20/2015  vt1 Fix 1305 errror /Ticket 3418/
* TMT    12/24/2015  1099 Project
* bz-Name-C 07/07/2017     Fine Names. Keep all capital  
********************************************************************************
DEFINE DATA
PARAMETER
1 #REQUEST     (I2)
1 #MSG         (A) DYNAMIC
1 #CN          (N9)
1 #BN-NUM-BEN  (N2)
1 #BN-TBL      (12)
  2 #BN-CV                     (C)
  2 #NUM                       (N2)
  2 #NAME                      (A33)
  2 REDEFINE #NAME
    3 #NAME-S (A33)
  2 #PCT                       (N3.2)
  2 REDEFINE #PCT
    3 #PCT-A   (N3)
    3 #PCT-B   (N2)
  2 #PCT-PCT                   (A1)
  2 #FRAC-1                    (N1)
  2 #FRAC-1-X                  (N2.3)
  2 #FRAC-/                    (A1)
  2 #FRAC-2                    (N2)
  2 #FRAC-2-X                  (N2)
  2 #AMT                       (N7.2)
  2 REDEFINE #AMT
    3 #DOL7   (N1)
    3 #DOL6   (N1)
    3 #DOL5   (N1)
    3 #DOL4   (N1)
    3 #DOL3   (N1)
    3 #DOL2   (N1)
    3 #DOL1   (N1)
    3 #CENT1  (N1)
    3 #CENT2  (N1)
  2 #DB                        (N7.2)
  2 REDEFINE #DB
    3 #DB-2       (N7.2)
  2 #PREM                      (N5.2)
  2 #PRIN                      (N7.2)     /* vt1 was n5.2
  2 #ACC-INT                   (N5.2)
  2 #EARNED-INT                (N5.2)
  2 #TOT-LINE                  (A11)
  2 #TOT-DB-PAID               (N7.2)
  2 REDEFINE #TOT-DB-PAID
    3 #TOT-DB-PAID-2 (N7.2)
  2 #CHK-#-DATE                (A25)
* added for BOT
  2 #HOLD-DB-TO-PAY            (N7.2)
  2 #DB-TO-PAY                 (N7.2)
  2 #DB-TO-PAY-ANNUITIZE       (N7.2)
  2 #DOB-MMDDYYYY (A8)
  2 REDEFINE #DOB-MMDDYYYY
    3 #DOB-MM      (N2)
    3 REDEFINE #DOB-MM
      4 #DOB-MM-A   (A2)
    3 #DOB-DD-A    (A2)
    3 #DOB-YYYY-A  (A4)
  2 REDEFINE #DOB-MMDDYYYY
    3 #DOB-MMDDYYYY-A (A8)
  2 #AGE                       (N3)
  2 #SSN                       (N9)
  2 #SEX                       (A1)
  2 #CLAIMANT-ISN              (P8)
  2 #CLAIMANT-CI               (N8)            /* TT1
  2 #CLAIMANT-POLICY           (A16)           /* TT1
LOCAL
1 #LETTER          (A6) CONST <'LETTER'>
1 #SCREEN          (A6) CONST <'SCREEN'>
1 Screen           (A) DYNAMIC
1 #ALREADY-LISTED-CNS        (N6/1:*)         /* TT1 Begin
1 X                          (I4)
1 #STRING                    (A) DYNAMIC
1 #END-INDEX                 (I4)             /* TT1 End
*
1 INT-1099-V VIEW OF A-INT-1099
  2 SSN
  2 RELATED-ID-NUMBER
  2 CLAIMANT-ID
  2 POLICY-NUMBER                             /* TT1
  2 CONTACT-ID
  2 SHARE                                     /* TT1
  2 YEAR
  2 INT-TYPE
  2 SSN-TAX-ID-IND
1 P_DOB_N  (N8) 1 REDEFINE P_DOB_N
  2 DOB_YYYY  (N4)
  2 DOB_MM    (N2)
  2 DOB_DD    (N2)
1 P_DOB    (A10)
1 P_DOD_N  (N8)
1 P_DOD    (A10)
1 P_SEX    (A1)
*
1 #GET      (I2) CONST <1>
1 #COMPRESS (I2) CONST <2>
1 #UPDATE   (I2) CONST <4>
1 BLANK     (A1) CONST <' '>
1 #INDEX    (I4)                /* TT1
1 J         (I2)
1 K         (I2)
END-DEFINE
*
DECIDE ON FIRST VALUE OF #REQUEST
  VALUE #GET
    PERFORM GET-CLAIMENTS
  VALUE #COMPRESS
    PERFORM COMPRESS-CLAIMENTS
  VALUE #UPDATE
    PERFORM UPDATE-CLAIMENTS
  NONE VALUE
    IGNORE
END-DECIDE
*
DEFINE COMPRESS-CLAIMENTS
/*     ==================
J := 1
K := J + 1
IF K > #BN-NUM-BEN
  ESCAPE ROUTINE
END-IF
REPEAT UNTIL J > #BN-NUM-BEN
    OR K > #BN-NUM-BEN
  REPEAT UNTIL J > #BN-NUM-BEN
      OR #NAME (J) = BLANK
    ADD 1 TO J
  END-REPEAT
  K := J + 1
  REPEAT UNTIL K > #BN-NUM-BEN
      OR #NAME (K) NE BLANK
    ADD 1 TO K
  END-REPEAT
  IF K <= #BN-NUM-BEN
    MOVE BY NAME #BN-TBL (K) TO #BN-TBL (J)
    RESET #BN-TBL (K)
  END-IF
END-REPEAT
IF J <= #BN-NUM-BEN
  RESET #BN-TBL (J:#BN-NUM-BEN)
END-IF
IF J > 1
  #BN-NUM-BEN := J - 1
END-IF
END-SUBROUTINE
*
DEFINE GET-CLAIMENTS
/*     =============
MOVE (AD=P) TO #BN-CV (*)
RESET #BN-NUM-BEN #ALREADY-LISTED-CNS(*) X              /* TT1
ADD 1 TO X                                              /* TT1
EXPAND ARRAY #ALREADY-LISTED-CNS TO (1:X)               /* TT1
*
FIND INT-1099-V WITH RELATED-ID-NUMBER = #CN
  IF CLAIMANT-ID > 0
    IF CLAIMANT-ID = #ALREADY-LISTED-CNS(*)             /* TT1 Begin
      ESCAPE TOP
    ELSE
      #ALREADY-LISTED-CNS(X) := CLAIMANT-ID
      ADD 1 TO X
      EXPAND ARRAY #ALREADY-LISTED-CNS TO (1:X)
    END-IF                                              /* TT1 End

    ADD 1 TO #BN-NUM-BEN
    RESET #BN-CV ( #BN-NUM-BEN )
    MOVE #BN-NUM-BEN  TO #NUM    (#BN-NUM-BEN)
    MOVE '/'  TO #FRAC-/ (#BN-NUM-BEN)
    MOVE '%'  TO #PCT-PCT(#BN-NUM-BEN)
    MOVE INT-1099-V.SSN TO #SSN  (#BN-NUM-BEN)
*   RESET Screen /* := #SCREEN  /* bz1
    Screen := '! T'              /* bz1         /* bz-Name-C
    CALLNAT 'GPRS0CNT' CLAIMANT-ID Screen
      P_DOB_N
      P_DOB
      P_DOD_N
      P_DOD
      P_SEX
    #NAME (#BN-NUM-BEN) := Screen
    #SEX  (#BN-NUM-BEN) := P_SEX
    COMPRESS FULL
      DOB_MM
      DOB_DD
      DOB_YYYY
      INTO #DOB-MMDDYYYY-A (#BN-NUM-BEN) LEAVING NO
*    #DOB-MMDDYYYY-A (#BN-NUM-BEN) := P_DOB_N
    #CLAIMANT-ISN (#BN-NUM-BEN)   := *ISN (0167)
    #CLAIMANT-CI (#BN-NUM-BEN)    := INT-1099-V.CLAIMANT-ID      /* TT1
  END-IF
END-FIND
END-SUBROUTINE
*
END

