DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
 1 #SCN-DB-CR-LBL (A15)
   INIT<'UNPAID INTEREST'>
 1 #SCN-FM-DATE (A8)
 1 #HOLD-CONVERT-DATE (N8.0)
 1 REDEFINE #HOLD-CONVERT-DATE /* REDEF. BEGIN : #HOLD-CONVERT-
   2 #HCD-YYYY (N4.0)
   2 #HCD-MMDD (N4.0)
 1 REDEFINE #HOLD-CONVERT-DATE /* REDEF. BEGIN : #HOLD-CONVERT-
   2 #HCD-YYYY-A (A4)
   2 #HCD-MM-A (A2)
   2 #HCD-DD-A (A2)
 1 #SCN-ID (N6.0/1:15)
 1 #SCN-ID-ATTR (C/1:15)
 1 #SCN-NAME (A3/1:15)
 1 #SCN-NAME-ATTR (C/1:15)
 1 #SCN-EFF-DT (A8/1:15)
 1 REDEFINE #SCN-EFF-DT /* REDEF. BEGIN : #SCN-EFF-DT
   2 #SCN-EFF-DT-OCC (1:15)
     3 #SCN-EFF-DT-A (A8)
     3 REDEFINE #SCN-EFF-DT-A /* REDEF. BEGIN : #SCN-EFF-DT-A
       4 #SED-MM-A (A2)
       4 #SED-DD-A (A2)
       4 #SED-YYYY-A (A4)
 1 #EFF-X (I2/1:15)
 1 #SCN-EFF-DT-YYYYMMDD (N8.0/1:15)
 1 REDEFINE #SCN-EFF-DT-YYYYMMDD /* REDEF. BEGIN : #SCN-EFF-DT-YY
   2 #SCN-EFF-DT-YYYYMMDD-A (A8/1:15)
 1 #SCN-LOAN-DATE (A8/1:15)
 1 REDEFINE #SCN-LOAN-DATE /* REDEF. BEGIN : #SCN-LOAN-DATE
   2 #SCN-LOAN-DATE-RA (1:15)
     3 #SLD-MM-A (A2)
     3 #SLD-DD-A (A2)
     3 #SLD-YYYY-A (A4)
 1 REDEFINE #SCN-LOAN-DATE /* REDEF. BEGIN : #SCN-LOAN-DATE
   2 #SCN-LOAN-DT-R (1:15)
     3 #SLD-MM (N2.0)
     3 #SLD-DD (N2.0)
     3 #SLD-YYYY (N4.0)
 1 #SCN-ATTR (C/1:15)
 1 #SCN-LOAN-DATE-ATTR (C/1:15)
 1 #SCN-OLD-LOAN-AMT (N6.2/1:15)
 1 #SCN-OLD-LOAN-AMT-ATTR (C/1:15)
 1 #SCN-INT-TRANS (N4.2/1:15)
 1 #SCN-INT-TRANS-ATTR (C/1:15)
 1 #SCN-NEW-LOAN-AMT-ATTR (C/1:15)
 1 #SCN-NEW-LOAN-AMT (N6.2/1:15)
 1 #SCN-NEW-WIRE-AMT (N6.2/1:15)
 1 #SCN-LOAN-OWNER-FLAG (A1/1:15)
 1 #SCN-TOTAL-LOAN (P6.2/1:15)
 1 #SCN-INTR-RATE (P2.3/1:15)
 1 #SCN-ANN-INTR (N5.2/1:15)
 1 #TOTAL-OLD-LOAN-AMT (N7.2)
 1 #TOTAL-NEW-LOAN-AMT (N6.2)
 1 #TOTAL-INT-TRANS (N5.2)
 1 #TOTAL-LOAN-VALUE (N7.2/1:15)
 1 #TOTAL-LOAN-AMT (N6.2)
 1 #TOTAL-ANN-INT (N5.2)
 1 #AVG-INT-RATE (N2.3)
 1 #SCN-LETR-ANN-INT (A10)
 1 REDEFINE #SCN-LETR-ANN-INT /* REDEF. BEGIN : #SCN-LETR-ANN-
   2 #SCN-LETR-ANN-INT-D (A1/1:10)
 1 #SCN-LETR-NEW-LOAN (A11)
 1 REDEFINE #SCN-LETR-NEW-LOAN /* REDEF. BEGIN : #SCN-LETR-NEW-
   2 #SCN-LETR-NEW-LOAN-D (A1/1:11)
 1 #SCN-LETR-TOTAL-LOAN (A11)
 1 REDEFINE #SCN-LETR-TOTAL-LOAN /* REDEF. BEGIN : #SCN-LETR-TOTA
   2 #SCN-LETR-TOTAL-LOAN-D (A1/1:11)
 1 #SCN-LETR-INT-RATE (A6)
 1 REDEFINE #SCN-LETR-INT-RATE /* REDEF. BEGIN : #SCN-LETR-INT-
   2 #SCN-LETR-INT-RATE-N (A5)
   2 #SCN-LETR-INT-RATE-P (A1)
 1 #SCN-LETR-OLD-LOAN (A11)
 1 REDEFINE #SCN-LETR-OLD-LOAN /* REDEF. BEGIN : #SCN-LETR-OLD-
   2 #SCN-LETR-OLD-LOAN-D (A1/1:11)
 1 #SCN-LETR-INT-TRAN (A9)
 1 REDEFINE #SCN-LETR-INT-TRAN /* REDEF. BEGIN : #SCN-LETR-INT-
   2 #SCN-LETR-INT-TRAN-D (A1/1:9)
 1 #SCN-LETR-NAME (A40)
 1 #SCN-DATE (A17)
 1 #SCN-ADDR1 (A70)
 1 #SCN-ADDR2 (A70)
 1 #SCN-ADDR3 (A70)
 1 #SCN-SALUT (A48)
 1 #SCN-LETR-ID (A10)
 1 #SCN-ADD-ROW1 (A75)
 1 #SCN-ADD-ROW2 (A75)
 1 #SCN-ADD-ROW3 (A75)
 1 #SCN-ADD-ROW4 (A75)
 1 #SCN-ADD-ROW5 (A75)
 1 #SCN-ADD-ROW6 (A75)
 1 #SCN-ADD-ROW7 (A75)
 1 #HOLD-RECD-NAME (A25/1:15)
 1 #HOLD-ADDR1 (A70/1:15)
 1 #HOLD-ADDR2 (A70/1:15)
 1 #HOLD-ADDR3 (A70/1:15)
 1 #HOLD-ZIP-CODE (N9.0/1:15)
 1 REDEFINE #HOLD-ZIP-CODE /* REDEF. BEGIN : #HOLD-ZIP-CODE
   2 #HOLD-ZIP-CODE-RA (1:15)
     3 #ZIP-H1 (A5)
     3 #ZIP-H2 (A4)
 1 #HOLD-RANK (A3/1:15)
 1 #HOLD-ISS-DT (P8.0/1:15)
 1 #HOLD-MIL-STATUS (A1/1:15)
 1 #HOLD-MMDDYYYY (A8)
 1 REDEFINE #HOLD-MMDDYYYY /* REDEF. BEGIN : #HOLD-MMDDYYYY
   2 #HOLD-MMDDYYYY-N (N8.0)
   2 REDEFINE #HOLD-MMDDYYYY-N /* REDEF. BEGIN : #HOLD-MMDDYYYY
     3 #HN-MM (N2.0)
     3 #HN-DD (N2.0)
     3 #HN-YYYY (N4.0)
 1 A-STATUS-VIEW VIEW OF A-STATUS
   2 ID-NUMBER (N6.0)
   2 MEMBER-FLAG (A1)
   2 MEMBER-CONTACT-ID (N8)
   2 INTRO-FLAG (A1)
   2 PROCESS-IND (A1)
   2 RANK (A3) /*
   2 ALOT-SW (A1)
   2 MILITARY-STATUS (A1) /*
   2 NAME (A25)
   2 REDEFINE NAME /* REDEF. BEGIN : NAME
     3 NAME-3 (A3)
     3 NAME-REST (A22)
   2 MEC-IND (A1/1:9)
   2 DEBIT-CREDIT-AMT (P7.2)
   2 X-FIRST-PLACE-FEE (P7.2/1:9)
   2 X-BILL-ADJUST (P5.2/1:9)
   2 X-LOAN-AMOUNT (P5.2/1:9)
   2 X-LOAN-AMOUNT-2 (P7.2/1:9)
   2 X-INTEREST-RATE (P2.3/1:9)
   2 X-LOAN-DATE (N8.0/1:9)
   2 REDEFINE X-LOAN-DATE /* REDEF. BEGIN : X-LOAN-DATE
     3 X-LOAN-DATE-OCC (1:9)
       4 X-LD-YYYY (N4.0)
       4 X-LD-MM (N2.0)
       4 X-LD-DD (N2.0)
   2 X-LOAN-DATE-2 (N8.0/1:9)
   2 REDEFINE X-LOAN-DATE-2 /* REDEF. BEGIN : X-LOAN-DATE-2
     3 X-LOAN-DATE-2-OCC (1:9)
       4 X-LD-YYYY-2 (N4.0)
       4 X-LD-MM-2 (N2.0)
       4 X-LD-DD-2 (N2.0)
   2 X-ALT-LP-IND (A1/1:9)
   2 X-ACCUM-INTEREST (P5.2/1:9)
   2 X-ACCUM-INTEREST-2 (P5.2/1:9)
   2 X-NXT-YR-ACCUM-INT (P5.2/1:9)
   2 X-NXT-YR-ACCUM-INT-2 (P5.2/1:9)
   2 LOAN-INT-TYPE (A1)
   2 CAP-CONV-ACV (P5.2)
   2 NUMBER-MEMBERSHIPS (P1.0)
   2 COST-BASIS (P7.2/1:9)
   2 OWNERSHIP-FLAG (A1/1:9)
   2 MTD-ACV-PREM-ADJ (P5.2/1:9) /* MU-FIELD /*OCCURS 9 TIMES
   2 MTD-ACV-INT-ADJ (P5.2/1:9) /* MU-FIELD /*OCCURS 9 TIMES
   2 MTD-ACV-COI-ADJ (P5.2/1:9) /* MU-FIELD /*OCCURS 9 TIMES
   2 POLICY-ID (A16/1:9)
   2 ACTIVE-SEGMENTS (1:9) /*PERIODIC GROUP
     3 STATUS (A1)
     3 PAY-STATUS (A2)
     3 SPLIT-IND (P1.0)
     3 ISSUE-DATE (N8.0)
     3 REDEFINE ISSUE-DATE /* REDEF. BEGIN : ISSUE-DATE
       4 ISS-DATE-CC (N2.0)
       4 ISS-DATE-YY (N2.0)
       4 ISS-DATE-MM (N2.0)
       4 ISS-DATE-DD (N2.0)
     3 FACE-AMOUNT (P7.2)
     3 PLAN (A3)
     3 REDEFINE PLAN /* REDEF. BEGIN : PLAN
       4 PLAN-A1 (A1)
       4 PLAN-A2 (A2)
     3 CASH-VALUE (P7.2)
     3 CONV-DURATION (P3.0)
     3 NXT-YR-MIN-CASH-VALUE (P7.2)
     3 NXT-MON-CASH-VALUE (P7.2)
     3 ACC-CASH-VALUE (P7.2)
     3 BEG-CASH-VALUE (P7.2)
     3 MONTH-ALLOC-AMT (P3.2)
     3 TOT-PREMIUMS-PAID (P7.2)
     3 PAID-TO-DATE (N8.0)
     3 REDEFINE PAID-TO-DATE
       4 PAID-TO-DATE-CENT (N2.0) /*REDEF. FROM PREDICT
       4 PAID-TO-DATE-YYMMDD (N6.0) /*REDEF. FROM PREDICT
     3 PAID-UP-DATE (N8.0)
     3 ANNUAL-PREM (P5.2)
     3 MODE (A1)
 1 #SCN-TOTAL-LOAN-ATTR (C/1:15)
 1 U-STATUS-VIEW VIEW OF A-STATUS
   2 ID-NUMBER (N6.0)
   2 MEMBER-CONTACT-ID (N8)
   2 DATE-ACCT-UPDATE (N8.0) /*
   2 DATE-TIME-STAMP /* GROUP
     3 DTS-TIMN (P7.0) /*
     3 DTS-DATN (P9.0) /*
   2 NAME (A25) /*
   2 MBR-SINCE (N6.0)
   2 SSN (N9.0) /*
   2 CAP-ENTRY-DATE (N6.0)
   2 PLAN (A3/1:9)
   2 X-LOAN-AMOUNT (P5.2/1:9)
   2 X-LOAN-AMOUNT-2 (P7.2/1:9)
   2 X-INTEREST-RATE (P2.3/1:9)
   2 X-PRINCIPAL-CHG-CODE (A1/1:9)
   2 X-LOAN-DATE (N8.0/1:9)
   2 X-LOAN-DATE-2 (N8.0/1:9)
   2 X-ACCUM-INTEREST (P5.2/1:9)
   2 X-ACCUM-INTEREST-2 (P5.2/1:9)
   2 X-NXT-YR-ACCUM-INT (P5.2/1:9)
   2 X-NXT-YR-ACCUM-INT-2 (P5.2/1:9)
   2 X-BILL-INTEREST-AMT (P5.2/1:9)
   2 X-BILL-INTEREST-AMT-2 (P5.2/1:9)
   2 X-INTEREST-RECEIVED (P5.2/1:9)
   2 X-INTEREST-RECEIVED-2 (P5.2/1:9)
   2 X-BILL-SW (A1/1:9)
   2 X-BILL-SW-2 (A1/1:9)
   2 X-CAP-AMT (P5.2/1:9)
   2 X-CAP-AMT-2 (P5.2/1:9)
   2 MEC-IND (A1/1:9)
   2 LAST-LOAN-CHECK (P7.2)
   2 STATUS (A1/1:9)
   2 ISSUE-DATE (N8.0/1:9)
   2 REDEFINE ISSUE-DATE /* REDEF. BEGIN : ISSUE-DATE
     3 ISS-DATE-R (1:9)
       4 ISS-DATE-CC (N2.0)
       4 ISS-DATE-YY (N2.0)
       4 ISS-DATE-MM (N2.0)
       4 ISS-DATE-DD (N2.0)
   2 PAY-STATUS (A2/1:9)
   2 PAID-UP-DATE (N8.0/1:9)
   2 LAST-ANN-CASH-VALUE (P7.2/1:9)
   2 ACC-CASH-VALUE (P7.2/1:9)
   2 CASH-VALUE (P7.2/1:9)
   2 NXT-MON-CASH-VALUE (P7.2/1:9)
   2 COST-BASIS (P7.2/1:9)
   2 OWNERSHIP-FLAG (A1/1:9)
   2 POLICY-ID (A16/1:9)
 1 ACCT-REG VIEW OF A-ACCOUNTING-REGISTER
   2 ID-NUMBER (N6.0)
   2 TRANSACTION-DATN (P9.0)
   2 TRANSACTION-TIMN (P7.0)
   2 SG-CATEGORY-1 (A2/1:1)
   2 SG-CATEGORY-2 (A2/1:1)
   2 SG-AMOUNT (N6.2/1:1)
   2 CASH-CODE (A1)
   2 TXN-CODE (A4)
   2 POLICY-NUMBER (A16)
   2 SEQUENCE-NUM (N1.0) /*
   2 NAME (A25)
   2 TXN-ACCT-NUMBER (N3.0) /*
   2 ACCT-DATE (N8.0) /*
   2 DATE-LAST-ACCT-UPDATE (N8.0) /*
   2 DEBIT-AMOUNT (P7.2)
   2 CREDIT-AMOUNT (P7.2)
   2 DESCRIPTION (A20)
   2 REDEFINE DESCRIPTION /* REDEF. BEGIN : DESCRIPTION
     3 DESC-LIT (A4)
     3 DESC-RATE (N2.3)
     3 DESC-SPACE (A1)
     3 DESC-ISSUE-DATE (A10)
   2 MESSAGE-CODE (A1)
   2 AALP-FLAG (A1)
   2 CLERK-ID (A3)
   2 TERMINAL-ID (A8) /*
 1 IN-V VIEW OF A-INT-1099
   2 SSN (N9)
   2 YEAR (N4)
   2 AMOUNT (P9.2)
   2 SSN-TAX-ID-IND (A1)
   2 RELATED-ID-NUMBER (N6)
   2 INT-TYPE (A1)
   2 GROSS-AMT (P9.2)
   2 INSURED (A25)
   2 TYPE-1099 (A4)
   2 DATE-ENTERED (N8)
   2 BANKRUPTCY-IND (A1)
   2 CONTACT-ID (N8)
   2 CLAIMANT-ID (N8)
   2 NAME-2 (A25)
   2 POLICY-NUMBER (A16)
   2 LAST-UPD-USER (A8)
   2 LAST-UPD-DATE (N8)
   2 LAST-UPD-TIME (N7)
   2 OWNER-SSN (N9)
END-DEFINE
