* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PGM-ID: C265PSCA       PDF Screen for death data
DEFINE DATA                 /* not finished coding
GLOBAL USING BCOMMGXX WITH MASTER-BLOCK
LOCAL  USING GONERLXX    /* WORK FIELDS FOR GONERCXX - ERROR ROUTINE
LOCAL USING G3500AAD
LOCAL
*
1 ST-V VIEW OF A-STATUS   /* For owner
 2 NAME
 2 SSN
*
1 #CN    (N9)
1 REDEFINE #CN
 2 #CN-3   (A3)
 2 #CN-A   (A6)
*
* 1 #NAME      (A25)
1 #LAST      (A25)
1 #FIRST-20  (A20)
1 #MI        (A1)
1 #ERR-MSG      (A60)
1 #FILL-BLNKS (A78/24)
1 #BENE-LINE  (A60)
1 REDEFINE #BENE-LINE
 2 #BENE-LINE-X  (A1/60)
*
1 #FOUND-AST   (L)
1 #FOUND-SLASH (L)
*
1 #BENE-DATA   (A60)
1 REDEFINE #BENE-DATA
 2 #BENE-DATA-X   (A1/60)
1 REDEFINE #BENE-DATA
 2 #BENE-DATA-N1   (N1)
1 REDEFINE #BENE-DATA
 2 #BENE-DATA-N2   (N2)
1 REDEFINE #BENE-DATA
 2 #BENE-DATA-N3   (N3)
1 REDEFINE #BENE-DATA
 2 #BENE-DATA-SSN1 (A3)
 2 #BENE-DATA-SSN2 (A2)
 2 #BENE-DATA-SSN3 (A4)
*
1 #BENE-NAME     (A30)  /* was 25
1 #BENE-REL      (A1)
1 #BENE-REL-DISP (A12)
1 #BENE-SSN      (A11)
1 #BENE-PCT      (A5)
1 #BENE-SET-OPT  (A1)
1 #BENE-RESTRICT (A1)
1 #SCR-OWNER-NAME  (A25)
1 #SCR-OWNER-SSN   (A11)
1 #P-S           (A1)
1 #P-#           (I2)
1 #S-#           (I2)
1 #P-S-#         (I2)
*
*
1 #SCR-LINES-CV   (C/57)
1 #SCR-LINES      (A78/57)
1 REDEFINE #SCR-LINES
 2 #SCR-LINES-OCC     (57)
  3 #SCR-LINES-FIL    (A7)
  3 #SCR-LINES-INDENT (A71)
  3 REDEFINE #SCR-LINES-INDENT
   4 #SCR-LINES-FIL-2       (A39)
   4 #SCR-LINES-SIGNATURE   (A32)
  3 REDEFINE #SCR-LINES-INDENT
   4 #SCR-LINES-FIL-3       (A65)
   4 #SCR-LINES-LST-6       (A6)
1 #SCR-POLS       (A60)
1 #SCR-POLS-2     (A30)
*
1 #YYYYMMDD    (N8)
1 REDEFINE #YYYYMMDD
 2 #YYYY       (N4)
 2 #MM         (N2)
 2 #DD         (N2)
*
1 #TODAY-MMDDYYYY-DISP  (A10)
*
1 #MONTHS (A36)  INIT
   <'JanFebMarAprMayJunJulAugSepOctNovDec'>
1 REDEFINE #MONTHS
 2 #MON       (A3/12)
*
1 #POL        (A14)
1 #CNT        (P2)
1 #SCR-X      (I2)
1 #OWN-X      (I2)
1 #I1         (I2)
1 #I2         (I2)
1 #I3         (I2)
1 #I4         (I2)
1 #I5         (I2)
1 #I6         (I2)
1 #HOLD-ID     (N9)
1 #HOLD-SUFFIX (A3)
1 #MANUAL      (L)
1 #TRUSTEEZ   (A10)
1 #OWNERZ     (A8)
1 #I  (A2)  /* or we
1 #IC (A2)  /* or We
1 #AM (A3)  /* or are
1 #MY (A3)  /* or our
1 #ME (A3)  /* or us
1 #WP         (L)
1 #SIGNATURE  (A20)
1 REDEFINE #SIGNATURE
 2 #SIGNATURE-FIL (A13)
 2 #SIGNATURE-SIG (A7)
1 #SIG-LINES (P3)
1 #DEF-CMP   (L)
1 #SCR-MBR   (A25)
*
END-DEFINE
* * * * * * * * * * * * * * * * *
*
INCLUDE GONERCXX       /* NATURAL ERROR ROUTINE
WRITE 'top of c2655xpca'
*
MOVE #CGA-SCR-ID TO #CN    /* initialize owner as insured
FIND ST-V WITH MEMBER-KEY = #CN-A
  MOVE ST-V.NAME TO #NAME
  RESET #LAST #MI #FIRST-20
  CALLNAT 'GFMLNSXX' /* split name
   #NAME
   #FIRST-20
   #MI
   #LAST
   #ERR-MSG
  COMPRESS #FIRST-20 #MI #LAST INTO #SCR-OWNER-NAME
  MOVE EDITED ST-V.SSN (EM=999-99-9999) TO #SCR-OWNER-SSN
END-FIND
*
MOVE '%FDF-1.2' TO #FILL-BLNKS (1)
MOVE '1 0 obj << /FDF << /Fields [' TO #FILL-BLNKS (2)
COMPRESS '<</T(F1-1)/V(' #FIRST-20 INTO #FILL-BLNKS (3) LEAVING NO
COMPRESS #FILL-BLNKS (3) #MI       INTO #FILL-BLNKS (3)
COMPRESS #FILL-BLNKS (3) ')>>'
         '<</T(F1-2)/V(' #LAST ')>>'
                                  INTO #FILL-BLNKS (3) LEAVING NO
* MOVE '<</T(PolNumber)/V(' TO #FILL-BLNKS (3)
*
* FOR #I1 1 TO 9
*  IF #POL-NUM (#I1) = ' '
*    ESCAPE TOP
*  END-IF
*  IF #I1 NE 1
*    COMPRESS #FILL-BLNKS (3) ',' INTO #FILL-BLNKS (3) LEAVING NO
*  END-IF
* COMPRESS #FILL-BLNKS (3) #POL-NUM(#I1) INTO #FILL-BLNKS (3) LEAVING NO
* END-FOR
*
* COMPRESS #FILL-BLNKS (3) ')>>' INTO #FILL-BLNKS (3) LEAVING NO
* COMPRESS '<</T(InsuredName)/V(' #SCR-NAME ')>>'
*      INTO #FILL-BLNKS (4) LEAVING NO
* COMPRESS '<</T(OwnerName)/V(' #SCR-OWNER-NAME ')>>'
*      INTO #FILL-BLNKS (5) LEAVING NO
* COMPRESS '<</T(OwnerSSN)/V(' #SCR-OWNER-SSN ')>>'
*      INTO #FILL-BLNKS (6) LEAVING NO
* MOVE '<</T(PerStirpes)/V(?)>><</T(Disaster)/V(?)>><</T(Days)/V(??)>>'
* MOVE '<</T(PerStirpes)/V( )>><</T(Disaster)/V( )>><</T(Days)/V(  )>>'
*        TO #FILL-BLNKS (7)
*
* IF #SCR-TYPE (2) ='A'
*   MOVE 'All children, born or adopted*C*N/A*|' TO #SCR-DESIG (2, 1)
* END-IF
*
* & MOVE 7 TO #I6
* FOR #I1 1 TO 2
*   FOR #I2 1 TO 5
* DISPLAY #I1 #I2
*      #SCR-DESIG (#I1, #I2)(EM=XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX)
*       #SCR-TYPE (#I1)
*     IF #SCR-DESIG (#I1, #I2) NE ' '
*       RESET #I4   /* field #
*       RESET #I5   /* build data index
*      RESET #FOUND-SLASH
*      MOVE #SCR-DESIG (#I1, #I2) TO #BENE-LINE
*      FOR #I3 1 TO 60
*        IF #BENE-LINE-X (#I3) = '*'
*          MOVE TRUE TO #FOUND-AST
*        END-IF
*      END-FOR
*    END-IF
*  END-FOR
* D-FOR
*
MOVE '] /F (F:\BENEFICIARY DESIGNATION.PDF)>> >> endobj'
      TO #FILL-BLNKS (12)
MOVE'trailer <</Root 1 0 R >> %%EOF'  TO #FILL-BLNKS  (13)
*
INPUT USING MAP 'GPDFXMXX'
*
MOVE 'ST' TO #CGA-SCR-COMMAND
RESET #CGA-SCR-SUFFIX
FETCH 'G1000PXX'
*
END
