DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 STATUS-VIEW VIEW OF A-STATUS
  2 ID-NUMBER (N6.0)
  2 RANK (A3)
  2 MILITARY-STATUS (A1)
  2 NAME (A25)
  2 MILITARY-SERVICE (A3)
  2 S-ADDRESS-IND (A1)
  2 SSN (N9.0)
END-DEFINE
