DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 IM-I01 VIEW OF A-INTRO-MEMBER
  2 SSN (N9.0)
1 SA-V VIEW OF A-SOURCE-OF-APPL
  2 SOURCE-CODE-GROUP (A1) /*
  2 SOURCE-CODE (A6)
  2 SOURCE-CUR-INQUIRIES (P5.0/12)
END-DEFINE
