DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
 1 #TABL-CN (A6/1:102) INIT
   (1) <'13926'>
   (2) <'21594'>
   (3) <'21594'>
   (4) <'28423'>
   (5) <'28423'>
   (6) <'28423'>
   (7) <'28971'>
   (8) <'31209'>
   (9) <'37807'>
   (10) <'38246'>
   (11) <'38622'>
   (12) <'38622'>
   (13) <'39058'>
   (14) <'39462'>
   (15) <'40451'>
   (16) <'41204'>
   (17) <'41866'>
   (18) <'41866'>
   (19) <'42466'>
   (20) <'42829'>
   (21) <'42829'>
   (22) <'44595'>
   (23) <'46326'>
   (24) <'47299'>
   (25) <'48602'>
   (26) <'49327'>
   (27) <'49327'>
   (28) <'50879'>
   (29) <'50879'>
   (30) <'51333'>
   (31) <'51688'>
   (32) <'51883'>
   (33) <'53283'>
   (34) <'54939'>
   (35) <'57280'>
   (36) <'57280'>
   (37) <'57951'>
   (38) <'57951'>
   (39) <'58189'>
   (40) <'58722'>
   (41) <'59198'>
   (42) <'59254'>
   (43) <'59831'>
   (44) <'60202'>
   (45) <'60202'>
   (46) <'61105'>
   (47) <'61914'>
   (48) <'62001'>
   (49) <'63114'>
   (50) <'64137'>
   (51) <'64226'>
   (52) <'67007'>
   (53) <'70858'>
   (54) <'70947'>
   (55) <'71044'>
   (56) <'71359'>
   (57) <'71487'>
   (58) <'72515'>
   (59) <'72524'>
   (60) <'72872'>
   (61) <'73077'>
   (62) <'74192'>
   (63) <'74417'>
   (64) <'74785'>
   (65) <'75048'>
   (66) <'75098'>
   (67) <'76172'>
   (68) <'76314'>
   (69) <'76314'>
   (70) <'76957'>
   (71) <'78496'>
   (72) <'79697'>
   (73) <'79697'>
   (74) <'81444'>
   (75) <'81444'>
   (76) <'81889'>
   (77) <'82201'>
   (78) <'82693'>
   (79) <'83699'>
   (80) <'87080'>
   (81) <'89120'>
   (82) <'89231'>
   (83) <'91044'>
   (84) <'92273'>
   (85) <'92319'>
   (86) <'92401'>
   (87) <'94657'>
   (88) <'94900'>
   (89) <'94900'>
   (90) <'94939'>
   (91) <'102727'>
   (92) <'120278'>
   (93) <'144610'>
   (94) <'150921'>
   (95) <'159449'>
   (96) <'159791'>
   (97) <'160187'>
   (98) <'160249'>
   (99) <'160311'>
   (100) <'168481'>
   (101) <'168962'>
END-DEFINE
