* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
LOCAL
1 ADR-POOL VIEW OF A-ADDRESS-POOL
  2 ADDRESS-POOL-ID
  2 ADDR-VALID-IND
  2 LAST-DATE-UPD (N8)
  2 LAST-TIME-UPD (N7)
  2 LAST-USER-UPD (A8)
END-DEFINE
READ ADR-POOL DESCENDING BY ADDRESS-POOL-ID
  IF NOT ( LAST-DATE-UPD = 20101129 AND LAST-DATE-UPD >= 1300000 )
    ESCAPE TOP
  END-IF
  DISPLAY ADR-POOL
END-READ
END
