* >Natural Source Header 000000
* :Mode R
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
************************************************************************
* PGM CKPT-LST      LIST CHECK-POINT FILE RECORDS
*  NOTE: DATE-TIME IS BINARY INTERNAL SYSTEM CLOCK TIME
* CREATED  03/04/85 CRR
* LAST CHG 07/15/88 CRR - CONVERTED TO NAT2.1
************************************************************************
**RMAT PS=23
REPEAT
  INPUT '      LIST CHECK POINT FILE' (I)
    //     '       ENTER STARTING ISN:' #ISN(N6) (AD=M)
    //     '       LIST CHECK POINTS ?' #CP(A1)
    //     'LIST END TRANSACTION DATA?' #ET(A1)
    //     '      OR ENTER "X" TO STOP' #X(A1)
*
  IF #X NE ' ' STOP
  IF #CP = ' ' AND #ET = ' '
  REINPUT 'MUST REQUEST AT LEAST 1 LIST OPTION' MARK 2 ALARM
*
  RESET #RECORDS(P5) #CP-COUNT(P5) #ET-COUNT(P5)
  ASSIGN *PAGE-NUMBER = 0
*
* READ CHECKPOINT-FILEY BY ISN STARTING FROM #ISN
*   ADD 1 TO #RECORDS
*
*   IF #CP = ' ' REJECT IF CHECKPOINT-NAME NE ' '
*   IF #ET = ' ' REJECT IF CHECKPOINT-NAME = ' '
*
* DISPLAY ET-DATA RECORDS
*
*   IF CHECKPOINT-NAME = ' ' DO
*     ADD 1 TO #ET-COUNT
*     NEWPAGE IF LESS THAN 2 LINES
*     WRITE (AD=I)
*       'ISN'       *ISN(0027) (EM=ZZZ9)
*       'ET ID'     USER-IDENTIFIER(0027)
*       'PRIORITY'  PRIORITY(0027)
*       'LAST TRAN' LAST-TRANS(0027)
*       'LAST ET'   LAST-TRANS-ET(0027) /
*       'ET DATA'   ET-DETAIL-DATA(0027)
*   DOEND
*
* FORMAT & DISPLAY CHECK-POINT RECORDS
*
*   IF CHECKPOINT-NAME NE ' ' DO
*     ADD 1 TO #CP-COUNT
*     ASSIGN
*       #TN(N03) = TAPE-NUMBER(0027)
*       #BN(N05) = BLOCK-NUMBER(0027)
*       #CL(N03) = CLUSTER-NUMBER(0027)
*       #EX(N03) = EXU-IDENTIFIER(0027)
*       #DT(B04) = DATE-TIME(0027)
*     WRITE (AD=I)
*       'ISN'    *ISN(0027)            (EM=ZZZ9)
*       'JOB'    JOB-NAME(0027)
*       'CP'     CHECKPOINT-NAME(0027)
*       'TYPE'   CHECKPOINT-TYPE(0027)
*       'EXU'    #EX
*       'LOG'    #TN
*****   'DATE'   #DT
*       'BLK'    #BN
*       'CLUS'   #CL
*   DOEND
* LOOP(0027) /* READ
* SKIP 3
* WRITE (AD=I)
*   'EOJ - RECS READ:' #RECORDS 'ET CNT:' #ET-COUNT 'CP CNT' #CP-COUNT
LOOP /* REPEATE
END
