DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #CLASS-1 (A1) INIT
  <'1'>
1 #CLASS-1-DESC (A35) INIT
  <'Rated Premiums Class 1'>
1 #CLASS-2 (A1) INIT
  <'2'>
1 #CLASS-2-DESC (A35) INIT
  <'Rated Premiums Class 2'>
1 #CLASS-3 (A1) INIT
  <'3'>
1 #CLASS-3-DESC (A35) INIT
  <'Rated Premiums Class 3'>
END-DEFINE
