* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ATHPZP9U - UPDATE DATABASE TO 9-DIGIT ZIP with dpb
*                 dpb = delivery-point bar-code
* **** make sure TR should or should not be created- scan for NCOA-TR
* SCAN FOR 'DECOMPRESS-REC' TO SEE INPUT PROCESS
* after NCOA-TR check for undeliverable update processing
* do not update address-chg-code on a non ncoa update   <******
*
DEFINE DATA
GLOBAL USING BCOMMGXX WITH MASTER-BLOCK
LOCAL  USING GONERLXX
LOCAL
1 #DATE-EXTRACT   (N8) INIT <20021015>  /* REMEMBER TO UPDATE ATHPZIP9
*
1 TR-V VIEW OF A-TRANSACTION-REGISTER
 2 ID-NUMBER
 2 PROCESS-IND
 2 NAME
 2 DATE-LAST-UPDATE
 2 TERMINAL-ID  (A8)
 2 CLERK-ID
 2 TRANSACTION-DATN (P9)
 2 TRANSACTION-TIMN (P7)
 2 OLD-DATA        (A125/32)
 2 NEW-DATA        (A125/32)
 2 REDEFINE NEW-DATA
  3 NEW-DATA-OCC    (32)
   4 NEW-DATA-NCOA   (A8)
   4 NEW-DATA-REST   (A117)
*
1 #TRX           (I2)
1 #W-OLD-NEW-DATA  (A125)
1 REDEFINE #W-OLD-NEW-DATA
  2 #W-DESCRIPTION (A10)
  2 #W-DATA        (A115)
*                                       /* with new last cn number
1 ST-ISN-V VIEW OF A-STATUS
1 #ISN    (P8)
*                                       /* with new last cn number
1 ST-V VIEW OF A-STATUS
 2 WIDOW-FLAG            (A1)
 2 ID-NUMBER             (N6)
 2 PROCESS-IND
 2 DTS-DATN
 2 DTS-TIMN
 2 DATE-ACCT-UPDATE      (N8)
* 2 DATE-LAST-ADDR-UPDT   (N8)
 2 DATE-OTHER-UPDATE
 2 NAME
*
1 IM-V VIEW OF A-INTRO-MEMBER
 2 ID-NUMBER             (N6)
 2 DTS-DATN              (P9)
 2 ADDRESS-1             (A25)
 2 ADDRESS-2             (A25)
 2 ADDRESS-3             (A25)
 2 ZIP-CODE              (N9)
 2 REDEFINE ZIP-CODE
  3 ZIP-CODE-5           (A5)
  3 ZIP-CODE-4           (A4)
*
1 NT-V VIEW OF A-NOTES
 2 ID-NUMBER
 2 NOTE-DATE (N8/3)
 2 DTS-DATN  (P9)
 2 DTS-TIMN  (P7)
 2 NOTE-CLERK-ID (A3/3)
 2 NOTE-LINE-NUM (P1/3)
 2 NOTE-TEXT (A60/3)
 2 REDEFINE NOTE-TEXT
  3 ANN-MTG-CNT   (N5)
*
1 #INT      (I2)
1 #NOTE-TEXT (A60/10)
1 #NOTE-NUM (N6)
1 #USER-TO-RECEIVE (A3)
1 #TO-INIT     (A3)
1 #HOLD-SUFFIX (A3)
*
1 #DATE-DISP (A10)
1 #YYYYMMDD  (N8)
1 REDEFINE #YYYYMMDD
 2 #YYYY  (N4)
 2 #MM    (N2)
 2 #DD    (N2)
1 REDEFINE #YYYYMMDD
 2 #YYYY-A (A4)
 2 #MM-A   (A2)
 2 #DD-A   (A2)
*
1 #FLD-#    (P3)   /* to identify content of field
1 #FLD-X    (I2)
*
1 #FIELD     (A35)
1 REDEFINE #FIELD
 2  #FIELD-X (A1/35)
1 REDEFINE #FIELD
 2  #FIELD-1 (N1)
1 REDEFINE #FIELD
 2  #FIELD-2 (N2)
1 REDEFINE #FIELD
 2  #FIELD-3 (N3)
1 REDEFINE #FIELD
 2  #FIELD-4 (N4)
1 REDEFINE #FIELD
 2  #FIELD-5 (N5)
1 REDEFINE #FIELD
 2  #FIELD-6 (N6)
1 REDEFINE #FIELD
 2  #FIELD-9 (N9)
1 REDEFINE #FIELD
 2 #FIELD-ZIP-5 (N5)
 2 #FIELD-ZIP-- (A1)
 2 #FIELD-ZIP-4 (N4)
1 REDEFINE #FIELD
 2  #FIELD-25 (A25)
 2  #FIELD-10 (A10)
*
1 #ZIP-9-EXTR-C1 (A80)
1 REDEFINE #ZIP-9-EXTR-C1
 2 #ZIP-9-C1 (A6)
 2 #ZIP-9-C1A (A74)
*
1 #ZIP-9-EXTR-C2 (A80)
1 REDEFINE #ZIP-9-EXTR-C2
 2 #ZIP-9-C2 (A6)
 2 #ZIP-9-C2A (A74)
*
1 #ZIP-9-EXTR-O  (A80)
*
1 #ID-NUMBER            (N6)
1 REDEFINE #ID-NUMBER
 2 #ID-NUMBER-A         (A6)
1 #FIRST-ADDRESS        (A25)
1 #FIRST-ADDRESS-35     (A35)
1 REDEFINE #FIRST-ADDRESS-35
 2 #1ST-ADDR-X     (A1/35)
1 #SECOND-ADDRESS       (A25)
1 #SECOND-ADDRESS-35    (A35)
1 #CITY                 (A22)
1 #CITY-35              (A35)
1 #STATE                (A2)
1 #ZIP-CODE             (N9)
1 REDEFINE #ZIP-CODE
 2 #ZIP-CODE-5          (A5)
 2 #ZIP-CODE-4          (A4)
1 REDEFINE #ZIP-CODE
 2 #ZIP-CODE-5N         (N5)
 2 #ZIP-CODE-4N         (N4)
1 REDEFINE #ZIP-CODE
 2 #ZIP-CODE-A9         (A9)
1 #ZIP-CODE-DPB         (N2)
1 REDEFINE #ZIP-CODE-DPB
 2 #ZIP-CODE-DPB-A      (A2)
*
1 #OLD-ZIP               (A13)
1 #NEW-ZIP               (A13)
*
1 #NAME          (A35)
1 #FOUND-MEMBER  (L)
1 #FOUND-WIDOW   (L)
1 #OVER-25-REC   (L)
1 #OVER-25-ADDR1 (L)
1 #OVER-25-ADDR2 (L)
1 #OVER-25-CITY  (L)
1 #COUNTERS
  2 #RECS-READ        (P7)
  2 #RECS-WRITTEN     (P7)
  2 #NUM-RECS         (P7)
  2 #CNT              (P7)
  2 #I1               (I2)
  2 #I2               (I2)
  2 #I3               (I2)
  2 #I4               (I2)
  2 #I5               (I2)
  2 #TOT-ZIP-9-NOT-FND (P5)
  2 #TOT-ALREADY-HAD-9 (P5)
  2 #NO-CHG           (P5)
  2 #ERRORS           (P5)
  2 #UPDATES          (P5)
  2 #RECENT-CHGS      (P5)
  2 #TOT-ZIP-5-CHG    (P5)
  2 #TOT-ADDR-CHG     (P5)
  2 #TOT-CITY-ST-CHG  (P5)
  2 #TOT-NU-ZIP-4     (P5)
  2 #TOT-NU-ZIP-DPB   (P5)
  2 #NOT-FOUND        (P5)
  2 #TOT-ZIP-9-IN     (P5)
  2 #TOT-ZIP-11-IN    (P5)
  2 #TOT-DPB-CHG      (P5)
  2 #TOT-ZIP4-CHG     (P5)
  2 #TOT-NON-FOREIGN-IN (P5)
*
1 #FILE-CITY-STATE            (A25)
1 #CITY-STATE            (A25)
1 #CITY-1                (A25)
1 #CITY-2                (A25)
1 #CITY-3                (A25)
1 #CITY-4                (A25)
1 #CITY-5                (A25)
1 #CITY-6                (A25)
1 #CITY-7                (A25)
1 #CITY-8                (A25)
1 #CITY-9                (A25)
*
1 #FE-EXTRACT-125   (A125)
1 #REC-OVERFLOW (A250)
1 REDEFINE #REC-OVERFLOW
 2 #REC-OVF-1ST-125   (A125)
 2 #REC-OVF-2ND-125   (A125)
*
1 #CNT-2   (N6)
1 #CNT-3   (N6)
1 #CNT-4   (N6)
1 #CNT-5   (N6)
1 #CNT-6   (N6)
1 #CNT-7   (N6)
1 #CNT-8   (N6)
1 #UPDATE-ADDR   (L)
*
1 #LETTER-TABLE
  2 #1T (A26) INIT <'AaBbCcDdEeFfGgHhIiJjKkLlMm'>
  2 #2T (A26) INIT <'NnOoPpQqRrSsTtUuVvWwXxYyZz'>
1 REDEFINE #LETTER-TABLE
  2 #LETTER-OCC  (26)
    3 #UPPER     (A1)
    3 #LOWER     (A1)
*
END-DEFINE
* * * * * * * * *
INCLUDE GONERCXX
* * * * * * * * *
READ WORK 1 RECORD #ZIP-9-EXTR-C1
  READ WORK 2 RECORD #ZIP-9-EXTR-C2
    IF #ZIP-9-C1 = #ZIP-9-C2
      MOVE #ZIP-9-EXTR-C2 TO #ZIP-9-EXTR-O
      WRITE WORK 3 #ZIP-9-EXTR-O
    ELSE
      IF #ZIP-9-C1 > #ZIP-9-C2
        ESCAPE TOP
      END-IF
    END-IF
  END-WORK
END-WORK
END
