* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL
1 #X (N5.7)
1 #Y (N5.7)
1 #Z (N5)
END-DEFINE
*
COMPUTE #X = 2 ** 4
WRITE '2 ** 1.5 = 2.8'
*
COMPUTE #X = 1.5 * LOG (2)
WRITE '1.5 * LOG (2) =' #X
*
COMPUTE #Y = EXP (#X)
MOVE #Y TO #Z
WRITE 'EXP #Y =' #Y
END
