DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 PDA-CONTACT
  2 P-CONTACT-ID (N8.0)
  2 P-ID-NUMBER (N6)
  2 P-GENDER (A1)
  2 P-DATE-OF-BIRTH (N8.0)
END-DEFINE
