* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*  PGM-ID COOCRSXX   Opt/Out Credit fot 12 2005 month-end
*  called by C2H30PVW
*
DEFINE DATA PARAMETER
1 #CN              (N6)
1 REDEFINE #CN
 2 #CN-A           (A6)
1 #ISS-DT          (N8)
1 #OO-CREDIT-AMT   (N3.2)
*
LOCAL
*
1 ST-V VIEW OF A-STATUS
 2 ISSUE-DATE    (N8/9)
 2 NUM-MBRSHIPS  (N1/9)
 2 POL-NUM-PRE   (A4/9)
 2 POL-NUM-SUF   (A5/9)
*
1 #I1     (I2)
*
1 #OO-CREDIT-TBL
 2 #OO-1  (A22) INIT <'013691-19460421- 00433'>
 2 #OO-2  (A22) INIT <'013691-19470421- 00455'>
 2 #OO-3  (A22) INIT <'013691-19650301- 00455'>
 2 #OO-4  (A22) INIT <'017707-19480623- 02618'>
 2 #OO-5  (A22) INIT <'018990-19490901- 02578'>
 2 #OO-6  (A22) INIT <'021152-19520901- 01198'>
 2 #OO-7  (A22) INIT <'021152-19550701- 01320'>
 2 #OO-8  (A22) INIT <'028560-19580601- 02518'>
 2 #OO-9  (A22) INIT <'028595-19580701- 01248'>
 2 #OO-10 (A22) INIT <'028595-19610101- 01370'>
 2 #OO-11 (A22) INIT <'030079-19590201- 01678'>
 2 #OO-12 (A22) INIT <'030079-19620101- 00900'>
 2 #OO-13 (A22) INIT <'030663-19590401- 02578'>
 2 #OO-14 (A22) INIT <'033362-19600701- 02518'>
 2 #OO-15 (A22) INIT <'034010-19601201- 01198'>
 2 #OO-16 (A22) INIT <'034010-19660510- 00660'>
 2 #OO-17 (A22) INIT <'034010-19840504- 00660'>
 2 #OO-18 (A22) INIT <'034114-19610101- 01638'>
 2 #OO-19 (A22) INIT <'034114-19620201- 00880'>
 2 #OO-20 (A22) INIT <'034298-19610201- 02518'>
 2 #OO-21 (A22) INIT <'035039-19610601- 01638'>
 2 #OO-22 (A22) INIT <'035039-19671001- 00880'>
 2 #OO-23 (A22) INIT <'035608-19611001- 02518'>
 2 #OO-24 (A22) INIT <'035877-20050412- 01584'>
 2 #OO-25 (A22) INIT <'035933-20041214- 02366'>
 2 #OO-26 (A22) INIT <'036196-19620201- 01678'>
 2 #OO-27 (A22) INIT <'036196-19630101- 00900'>
 2 #OO-28 (A22) INIT <'036268-19620301- 01858'>
 2 #OO-29 (A22) INIT <'036268-19750401- 00660'>
 2 #OO-30 (A22) INIT <'037529-19621101- 02618'>
 2 #OO-31 (A22) INIT <'037758-19630101- 02578'>
 2 #OO-32 (A22) INIT <'040490-19640401- 02618'>
 2 #OO-33 (A22) INIT <'040968-19640701- 02578'>
 2 #OO-34 (A22) INIT <'041470-19641001- 01986'>
 2 #OO-35 (A22) INIT <'041593-20050114- 02406'>
 2 #OO-36 (A22) INIT <'044968-19660318- 02618'>
 2 #OO-37 (A22) INIT <'045306-20041214- 02306'>
 2 #OO-38 (A22) INIT <'046998-19670402- 01348'>
 2 #OO-39 (A22) INIT <'047102-19670501- 01348'>
 2 #OO-40 (A22) INIT <'047418-19670701- 01986'>
 2 #OO-41 (A22) INIT <'048681-19680301- 01858'>
 2 #OO-42 (A22) INIT <'048681-19860725- 00660'>
 2 #OO-43 (A22) INIT <'050028-19681005- 00138'>
 2 #OO-44 (A22) INIT <'050344-19690120- 01348'>
 2 #OO-45 (A22) INIT <'051615-19691001- 02624'>
 2 #OO-46 (A22) INIT <'052048-20040123--00134'>
 2 #OO-47 (A22) INIT <'052152-19700201- 01348'>
 2 #OO-48 (A22) INIT <'052608-19700501- 02618'>
 2 #OO-49 (A22) INIT <'053186-19700601- 02578'>
 2 #OO-50 (A22) INIT <'053228-19700801- 01938'>
 2 #OO-51 (A22) INIT <'053228-19790406- 00690'>
 2 #OO-52 (A22) INIT <'055181-19710801- 02518'>
 2 #OO-53 (A22) INIT <'056129-19720301- 02618'>
 2 #OO-54 (A22) INIT <'059579-19741101- 01858'>
 2 #OO-55 (A22) INIT <'059579-19750101- 00660'>
 2 #OO-56 (A22) INIT <'063064-19770701- 02578'>
 2 #OO-57 (A22) INIT <'064575-19780618- 02518'>
 2 #OO-58 (A22) INIT <'065385-19790424- 02518'>
 2 #OO-59 (A22) INIT <'065476-20041210- 02406'>
 2 #OO-60 (A22) INIT <'066415-19800131- 02578'>
 2 #OO-61 (A22) INIT <'067355-19800901- 00538'>
 2 #OO-62 (A22) INIT <'067355-19840627- 00660'>
 2 #OO-63 (A22) INIT <'067355-19860822- 01320'>
 2 #OO-64 (A22) INIT <'068997-19820108- 02578'>
 2 #OO-65 (A22) INIT <'070536-19830228- 01198'>
 2 #OO-66 (A22) INIT <'070536-19870914- 01320'>
 2 #OO-67 (A22) INIT <'071821-19840411- 01198'>
 2 #OO-68 (A22) INIT <'071821-19860630- 00660'>
 2 #OO-69 (A22) INIT <'071821-19860701- 00660'>
 2 #OO-70 (A22) INIT <'071977-19840604- 02578'>
 2 #OO-71 (A22) INIT <'072294-19840901- 00148'>
 2 #OO-72 (A22) INIT <'072649-19840921- 02578'>
 2 #OO-73 (A22) INIT <'072649-20020528- 00000'>
 2 #OO-74 (A22) INIT <'075427-19860325--00242'>
 2 #OO-75 (A22) INIT <'075427-19880114- 00000'>
 2 #OO-76 (A22) INIT <'075657-19860424- 00778'>
 2 #OO-77 (A22) INIT <'075657-19940915- 00900'>
 2 #OO-78 (A22) INIT <'075657-19941021- 00900'>
 2 #OO-79 (A22) INIT <'086179-19910219- 01348'>
 2 #OO-80 (A22) INIT <'090323-19921222- 00252'>
 2 #OO-81 (A22) INIT <'092714-19940808- 00152'>
 2 #OO-82 (A22) INIT <'094612-19960517- 01348'>
 2 #OO-83 (A22) INIT <'099061-19980201- 02406'>
 2 #OO-84 (A22) INIT <'099061-20010724- 00000'>
1 REDEFINE #OO-CREDIT-TBL
 2 #OO-CREDIT-OCC (84)
  3 #OO-CN          (N6)
  3 #OO-FILL1       (A1)
  3 #OO-ISS-DT      (N8)
  3 #OO-FILL2       (A1)
  3 #OO-CREDIT-SIGN (A1)
  3 #OO-CREDIT      (N3.2)
*
END-DEFINE
*
RESET #OO-CREDIT-AMT
FOR #I1 1 TO 84
  IF   (#CN     = #OO-CN     (#I1))
   AND (#ISS-DT = #OO-ISS-DT (#I1))
    IF #OO-CREDIT-SIGN (#I1) = '-'
      COMPUTE #OO-CREDIT-AMT = #OO-CREDIT (#I1) * -1
    ELSE
      MOVE #OO-CREDIT (#I1) TO #OO-CREDIT-AMT
    END-IF
*
    ESCAPE BOTTOM
  END-IF
END-FOR
*
END
