* >Natural Source Header 000000
* :Mode R
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
read terminals with terminal-id 
display(1) terminal-id 
. 
