* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
**************************************************************
* PGM-ID: DN090SNX
*     'NX' COMMAND PROCESSING  - MISC NOTE PROCESSOR
* also processes auto msgs (lt 6 lines) to AAFMAA users such as c2200pcg
*        and W5700PWN
*******************************************
* clONE OF g4090pnx PROGRAM
*******************************************
DEFINE DATA PARAMETER
1 #SUFFIX    (A3)
1 #FROM-INIT   (A3)
1 #TO-INIT     (A3)
1 #MSG         (A60/5)
*
* LOCAL USING GONERLXX     /* WORK FIELDS FOR GONERCXX - ERROR ROUTINE
LOCAL
1 NT-V VIEW OF A-NOTES
   2 ID-NUMBER (N6.0)
   2 REDEFINE ID-NUMBER
     3 ID-NUMBER-A (A6)
   2 DTS-DATN (P9.0)
   2 DTS-TIMN (P7.0)
   2 C*NOTE-TABLE
   2 NOTE-DATE (N8.0/40)
   2 NOTE-CLERK-ID (A3/40)
   2 NOTE-TEXT (A60/40)
*
1 TRMS-V VIEW OF A-TERMINALS
   2 CLERK-ID (A3)
   2 MSG-JUST-SENT (A1)
*
1 #NOTE-NUM  (N6)
1 #I1        (I2)
*
END-DEFINE
*
*  INCLUDE GONERCXX      /* NATURAL ERROR ROUTINE
*
**write *program '=' #suffix '=' #FROM-INIT
**'=' #TO-INIT
**'=' #MSG (1)
IF #SUFFIX = '*NX'
    PERFORM SEND-AUTO-MSG
  ESCAPE ROUTINE
END-IF
*
*****************
DEFINE SUBROUTINE SEND-AUTO-MSG
*****************
*
MOVE 950000 TO #NOTE-NUM       /* SEND ACCOUNTING NOTES
READ (1) NT-V BY ID-NUMBER FROM #NOTE-NUM /* FIND NEXT AVAIL NX NOTE
  MOVE NT-V.ID-NUMBER TO #NOTE-NUM
END-READ
*
IF  (#NOTE-NUM LE 950000)
    OR (#NOTE-NUM GT 980000)
  MOVE 980000 TO #NOTE-NUM
END-IF
*
SUBTRACT 1 FROM #NOTE-NUM
RESET NT-V
MOVE #NOTE-NUM     TO NT-V.ID-NUMBER
MOVE *DATN         TO NT-V.DTS-DATN
MOVE *TIMN         TO NT-V.DTS-TIMN
MOVE *DATN         TO NT-V.NOTE-DATE (1)
MOVE #FROM-INIT    TO NT-V.NOTE-CLERK-ID (1)
MOVE #TO-INIT      TO NT-V.NOTE-CLERK-ID (2)
MOVE 'UNV'         TO NT-V.NOTE-CLERK-ID (3)
*
FOR #I1 1 TO 5
  IF #MSG (#I1) NE ' '
    MOVE #MSG (#I1) TO NT-V.NOTE-TEXT (#I1)
  END-IF
END-FOR
*
STORE NT-V
*
FIND (1) TRMS-V WITH CLERK-ID = #TO-INIT
  MOVE 'Y' TO MSG-JUST-SENT
  UPDATE (0084)
END-FIND
*
END-SUBROUTINE
*
END
