* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
**************************************************************************
* SUBPROGRAM-ID: DNXVN005
* DESCRIPTION: Assemble Death Information
**************************************************************************
*        MODIFICATION LOG
**************************************************************************
* USER   DATE      TAG  REASON
* RSE  12-10-2010  RE1  Creation
* RSE  03-16-2011  RE2  Fix DOD issue (DOD not being picked up correctly)
* RSE  04-29-2011  RE3  Use function to get DOD status description
**************************************************************************
DEFINE DATA
PARAMETER
1 #CONTACT-ID  (N8)
1 #ISN         (P8)
1 #TEXT        (A67/1:V)
LOCAL
1 CONTACT-V VIEW OF A-CONTACTS
  2 ID-NUMBER
  2 DATE-OF-DEATH
  2 REDEFINE DATE-OF-DEATH
    3 #DOD-YY  (A4)
    3 #DOD-MM  (A2)
    3 #DOD-DD  (A2)
  2 DATE-OF-DEATH-REPORTED
  2 REDEFINE DATE-OF-DEATH-REPORTED
    3 #DOD-REP-YY  (A4)
    3 #DOD-REP-MM  (A2)
    3 #DOD-REP-DD  (A2)
  2 DATE-OF-DEATH-STATUS-CODE
  2 date-of-death-status-date
  2 redefine date-of-death-status-date
    3 #dod-st-cde-yyyy   (a4)
    3 #dod-st-cde-mm     (a2)
    3 #dod-st-cde-dd     (a2)
  2 cause-of-death
  2 place-of-death
*
1 #DOD              (A10)
1 #dod-st           (a10)
1 #nodod         (a8)  Const <'DOD: ?'>
1 #noservco      (a16) Const <'Service Conn: ?'>
1 #nocause       (a8)  Const <'Cause: ?'>
1 #noplace       (a8)  Const <'Place: ?'>
1 #save-text     (a67) /* RE3
*
END-DEFINE
*
RESET #TEXT (*)
*
GET CONTACT-V #ISN
*
IF CONTACT-V.DATE-OF-DEATH > 0                                     /* RE1
  COMPRESS #DOD-MM '/' #DOD-DD '/' #DOD-YY INTO #DOD LEAVING NO    /* RE1
ELSE
  IF DATE-OF-DEATH-REPORTED > 0
    COMPRESS #DOD-REP-MM '/' #DOD-REP-DD '/' #DOD-REP-YY INTO #DOD LEAVING NO
  END-IF
END-IF
*
if contact-v.date-of-death-status-date >0
  compress #dod-st-cde-mm '/' #dod-st-cde-dd '/' #dod-st-cde-yyyy into #dod-st leaving no
end-if
*
if #dod = ' '
  compress #text(1) #nodod into #text(1)
else
  COMPRESS 'DOD:' #DOD INTO #TEXT  (1)
end-if
*
#save-text := FUNCTION-CODE-1-DESC(<'029',contact-v.date-of-death-status-code>)      /* RE3
compress #text(1) #save-text 'as of' #dod-st into #TEXT(1)                           /* RE3
**if contact-v.date-of-death-status-code ='P'
**  compress #text(1)  ' Pending Confirmation as of' #dod-st into #TEXT(1)
**else
**  if contact-v.date-of-death-status-code ='C'
**    compress #text(1)  ' Confirmed as of' #dod-st into #TEXT(1)
**  end-if
**end-if
*
IF contact-v.cause-of-death  = ' '
  compress #text(2) #nocause   into #text(2)
else
  compress 'Cause:' contact-v.cause-of-death into #text(2)
END-IF
*
if contact-v.place-of-death = ' '
  compress #text(2) #noplace  into #text (2)
else
  compress #text(2) '                   Place:' contact-v.place-of-death into #text(2)
end-if
*
ON ERROR
  COMPRESS 'Application error' *ERROR-NR *ERROR-LINE *PROGRAM
    INTO #TEXT  (1)
  ESCAPE ROUTINE
END-ERROR

END
