DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 NOTES-V VIEW OF A-NOTES
  2 ID-NUMBER (N6.0)
  2 C*NOTE-TABLE
  2 NOTE-DATE (N8.0/1:500)
  2 NOTE-CLERK-ID (A3/1:500)
  2 NOTE-LINE-NUM (P1.0/1:500)
  2 NOTE-TEXT (A60/1:500)
  2 USER-COMPANY (A1/1:500)
END-DEFINE
