* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 5
* <Natural Source Header
* ***********************************************************
* PROGRAM-ID: E4300PDD
* PURPOSE   : 'DD' COMMAND PROCESSING OR DOCUMENT SCREEN
*
***********************MODIFICATION LOG**********************
* 012005  CHGD TO START CSR AT CMND LINE PER JMJ          TDM
* 062005  ADD DOCS MSG WHEN APPL-SRCE IS 'TU' FOR AFSC    TM2
* 012007  UPDATED YEAR ON 'DA' SCREEN FROM 2006 TO 2007   TM3
* 042006  ALLOW MBR CORR TO GO TO DD SCREEN/ RMV SGLI     TM4
* 05042006  afsc/aafm syncing processing                  DW5
* 11202006  compress right side of DA and add 2 va docs         DW6
* 03172007 DW7 Protect entire Screen & Remove Access AUTH & Remove UPDATES
* ***********************************************************
DEFINE DATA
GLOBAL USING BCOMMGXX WITH MASTER-BLOCK
LOCAL USING GONERLXX    /* WORK FIELDS FOR GONERCXX - ERROR ROUTINE
LOCAL USING E4300LDD
LOCAL
1 #SFX       (I2)    /* DW5
1 #SCR-COPY-CN-1    (P6/20)
1 #BAD-COPY-IND-1   (L/20)
1 #SCR-COPY-CN-2    (P6/20)
1 #BAD-COPY-IND-2   (L/20)
1 #SCR-COPY-CN-3    (P6/20)
1 #BAD-COPY-IND-3   (L/20)
1 #BAD-COPY         (L)
1 #ICOP             (I2)
1 #CN               (P6)
*
1 #SCR-NAME-LBL   (A6)
1 #SCR-RANK       (A3)
1 #SCR-NAME       (A25)
1 #SCR-SSN        (N9)
*
1 #DCNI             (I2)
1 #MAIN-DOC         (A50)
1 #COP-DOC          (A50)
1 #MAX-DOC          (A50)
1 REDEFINE #MAX-DOC
 2 #MAX-DOC-1ST-37 (A37)
 2 #MAX-DOC-LST-13 (A13)
*
1 #CNT-ENTS      (P3)
1 #ISN             (P8)
1 #SCR-HEADING     (A22)
1 #SCR-DA-CODE     (A1/40)
1 REDEFINE #SCR-DA-CODE
 2 #SCR-DA-CODE-2  (A1/40)
1 #SCR-DA-CODE-CV  (C/40)
*
1 #SCR-DA-TEXT     (A25/40)
1 REDEFINE #SCR-DA-TEXT
 2 #SCR-DA-TEXT-2  (A25/40)
1 REDEFINE #SCR-DA-TEXT
 2 #SCR-DA-TEXT-3  (A25/40)
1 REDEFINE #SCR-DA-TEXT
 2 #SCR-DA-TEXT-4  (A25/40)
1 REDEFINE #SCR-DA-TEXT
 2 #SCR-DA-TEXT-5  (A25/40)
1 REDEFINE #SCR-DA-TEXT
 2 #SCR-DA-TEXT-6  (A25/40)
1 #SCR-DA-TEXT-CV  (C/40)
*
1 #SCR-DA-INFO     (A16/40)
1 REDEFINE #SCR-DA-INFO
 2 #SCR-DA-INFO-OCC (40)
  3 #SCR-DA-INFO-1ST (A1)
  3 #SCR-DA-INFO-LST (A15)
1 REDEFINE #SCR-DA-INFO
 2 #SCR-DA-INFO-2  (A16/40)
1 REDEFINE #SCR-DA-INFO
 2 #SCR-DA-INFO-3  (A16/40)
1 #SCR-DA-INFO-CV  (C/40)
*
1 #SCR-DA-DT       (A6/40)
1 REDEFINE #SCR-DA-DT
 2 #SCR-DA-DT-2    (A6/40)
1 REDEFINE #SCR-DA-DT
 2 #SCR-DA-DT-3    (40)
  3 #SCR-DA-MM     (N2)
  3 #SCR-DA-YYYY   (A4)
1 #SCR-DA-DT-CV    (C/40)
*
1 #SCR-DA-ACCESS-CODE (A1)
1 #SCR-DA-ACCESS-TEXT-1 (A20)
1 #SCR-DA-ACCESS-TEXT-2 (A35)
1 #SCR-DA-ACCESS-TEXT-3 (A35)
*
1 #SCR-CV               (C)
1 #SCR-CVX              (C/36)
1 #SCR-DOCS             (A37/36)
1 REDEFINE #SCR-DOCS
 2 #SCR-DOCS-2           (A37/36)
1 #SCR-TEXT             (A78)
1 #SCR-ACCESS-AUTH-CODE (A1)
1 #SUP-MESSAGE (A75)
1 #FIELD-CHANGED (L)
1 #STAT-UPDATE   (L)
1 #NO-FIRS       (L)
1 #INDEXR (I2)
1 #INDEXT (I2)
1 #FMX    (I2)
1 #TOX    (I2)
1 #I1     (I2)
1 #I2     (I2)
1 #I3     (I2)
1 #DDI    (I2)
1 #TRI    (I2)
1 #CODE-ENTERED  (L)
1 #INVALID       (L)
1 #ERR-MSG       (A60)
*
1 #NAME-1        (A25)
1 #NAME-2        (A25)
1 #NAME-3        (A25)
1 #NAME-4        (A25)
1 #NAME-5        (A25)
1 #WORK-NAME     (A24)
*
1 #WYYYYMMDD
 2 #WCENT  (N2)
 2 #WYY    (N2)
 2 REDEFINE #WYY
  3 #WYY-A     (A2)
 2 #WMM      (N2)
 2 REDEFINE #WMM
  3 #WMM-A   (A2)
 2 #WDD      (N2)
 2 REDEFINE #WDD
  3 #WDD-A   (A2)
1 REDEFINE #WYYYYMMDD
 2 #WYYYYMMDD-N (N8)
1 REDEFINE #WYYYYMMDD
 2 #YYYY     (A4)
 2 #MM       (A2)
 2 #DD       (A2)
*
1 #W-DATE-EDITED (A9)
1 #MONTHS (A36)  INIT
   <'JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC'>
1 REDEFINE #MONTHS
 2 #MON       (A3/12)
*
1 TRLOG VIEW OF A-TRANSACTION-REGISTER
  2 ID-NUMBER (N6)
  2 PROCESS-IND (A1) /* PM - 06/2000 - SPLIT COMPANIES
  2 NAME      (A25)
  2 DATE-LAST-UPDATE (N8)
  2 TERMINAL-ID (A8)
  2 CLERK-ID    (A3)
  2 TRANSACTION-DATN (P9)
  2 TRANSACTION-TIMN (P7)
  2 OLD-DATA        (A125/32)
  2 NEW-DATA        (A125/32)
  2 SYNC-FLD-NUM      (1)     /* DW5
  2 SYNC-FLD-OLD-DATA (1)
  2 SYNC-FLD-NEW-DATA (1)
1 #HOLD-FIR-ISN (P8)
END-DEFINE
* - - - - - - - -
INCLUDE GONERCXX
* - - - - - - - -
*
move (AD=P) to #scr-cv    /* DW7_
GET DD-S01-VIEW #CGA-ISN
*
IF DD-S01-VIEW.WIDOW-FLAG = 'Y'
  MOVE 'SPOUSE' TO #SCR-NAME-LBL
  RESET            #SCR-RANK
  MOVE NAME-SP  TO #SCR-NAME
  MOVE SSN-SP   TO #SCR-SSN
  MOVE DATE-OF-BIRTH-SP TO #HOLD-CONVERT-DATE
*
  FIND (1) DD-F01-VIEW WITH WIDOW-KEY = #CGA-ID-G
    IF NO RECORDS FOUND
      ASSIGN #NO-FIRS = TRUE
      MOVE DD-S01-VIEW.ID-NUMBER TO DD-F01-VIEW.ID-NUMBER
      MOVE 'Y'                   TO DD-F01-VIEW.WIDOW-FLAG
*
      IF DD-S01-VIEW.MEMBER-FLAG = 'Y'
        MOVE 'Y' TO DD-F01-VIEW.MEMBER-FLAG
      END-IF
    END-NOREC
    MOVE *ISN TO #ISN
  END-FIND
ELSE
  MOVE 'MEMBER' TO #SCR-NAME-LBL
  MOVE RANK     TO #SCR-RANK
  MOVE NAME     TO #SCR-NAME
  MOVE SSN      TO #SCR-SSN
  MOVE DATE-OF-BIRTH TO #HOLD-CONVERT-DATE
*
  FIND (1) DD-F01-VIEW WITH MEMBER-KEY = #CGA-ID-G
    IF NO RECORDS FOUND
      ASSIGN #NO-FIRS = TRUE
      MOVE DD-S01-VIEW.ID-NUMBER TO DD-F01-VIEW.ID-NUMBER
      MOVE 'Y'                   TO DD-F01-VIEW.MEMBER-FLAG
*
      IF DD-S01-VIEW.PLAN (1) = '2SW' OR = '3SW' OR = '2DW' OR = '3DW'
        MOVE 'Y' TO DD-F01-VIEW.WIDOW-FLAG
      END-IF
*
    END-NOREC
    MOVE *ISN TO #ISN
  END-FIND
END-IF
*
IF #CGA-SCR-COMMAND = 'DA'
  IF   (NAME-SP NE ' ')
   AND (STATUS-CODE-SP NE 'D')
    PERFORM SPS-NAME-HUNT
    COMPRESS 'SPOUSE' #WORK-NAME INTO #SCR-DA-ACCESS-TEXT-1
  END-IF
*
  FOR #I1 1 TO 40
    MOVE (AD=P) TO #SCR-DA-TEXT-CV (#I1)
    MOVE (AD=P) TO #SCR-DA-INFO-CV (#I1)
    DECIDE ON EVERY VALUE OF #I1
      VALUE 1  MOVE 'MBR CORRESPONDENCE'      TO #SCR-DA-TEXT (#I1)
      VALUE 2  MOVE 'COMPUTATION OF RET PAY'  TO #SCR-DA-TEXT (#I1)
      VALUE 3  MOVE 'RETIREMENT ORDER'        TO #SCR-DA-TEXT (#I1)
      VALUE 4  MOVE 'DD FORM 214 #1'          TO #SCR-DA-TEXT (#I1)
      VALUE 5  MOVE 'SOC SEC EARNING'         TO #SCR-DA-TEXT (#I1)
               RESET #SCR-DA-INFO-CV (#I1)
      VALUE 6  MOVE 'SOC SEC AWARD LTR'       TO #SCR-DA-TEXT (#I1)
               RESET #SCR-DA-INFO-CV (#I1)
      VALUE 7  MOVE 'SOC SEC COLA'            TO #SCR-DA-TEXT (#I1)
               RESET #SCR-DA-INFO-CV (#I1)
      VALUE 8  MOVE 'W2 FORM'                 TO #SCR-DA-TEXT (#I1)
*
      VALUE 9  MOVE 'MEMBER"S WILL'           TO #SCR-DA-TEXT (#I1)
      VALUE 10 MOVE 'MEMBER"S LIVING WILL'    TO #SCR-DA-TEXT (#I1)
      VALUE 11 MOVE 'MBR"S POWER OF ATTORNEY' TO #SCR-DA-TEXT (#I1)
      VALUE 12 MOVE 'MEMBER"S DURABLE POA'    TO #SCR-DA-TEXT (#I1)
      VALUE 13 MOVE 'MBR"S DURABLE MED POA'   TO #SCR-DA-TEXT (#I1)
      VALUE 14 MOVE 'MBR"S TRUST AGREEMENT'   TO #SCR-DA-TEXT (#I1)
*
      VALUE 15 MOVE 'DIV DEC MBR/'            TO #SCR-DA-TEXT (#I1)
               RESET #SCR-DA-INFO-CV (#I1)
      VALUE 16 MOVE 'DIV DEC SPOUSE/'         TO #SCR-DA-TEXT (#I1)
               RESET #SCR-DA-INFO-CV (#I1)
      VALUE 17 MOVE 'ADOPTION PAPERS'         TO #SCR-DA-TEXT (#I1)
               RESET #SCR-DA-INFO-CV (#I1)
      VALUE 18 MOVE 'BAPTISMAL PAPERS'        TO #SCR-DA-TEXT (#I1)
               RESET #SCR-DA-INFO-CV (#I1)
      VALUE 19 MOVE 'DEATH RECORD'            TO #SCR-DA-TEXT (#I1)
               RESET #SCR-DA-INFO-CV (#I1)
*
      VALUE 20 MOVE 'RP STATEMENT'            TO #SCR-DA-TEXT (#I1)
      VALUE 21 MOVE 'LEAVE/EARNING STATEMENT' TO #SCR-DA-TEXT (#I1)
      VALUE 22 MOVE 'SBP ELECTION/FORMS'      TO #SCR-DA-TEXT (#I1)
      VALUE 23 MOVE 'STATEMENT OF POINTS'     TO #SCR-DA-TEXT (#I1)
      VALUE 24 MOVE 'DD FORM 214 #4'          TO #SCR-DA-TEXT (#I1)
      VALUE 25 MOVE 'VA DISABILITY AWARD'     TO #SCR-DA-TEXT (#I1)
      VALUE 26 MOVE 'VA POA-AFSC        '  TO #SCR-DA-TEXT (#I1) /* DW6
      VALUE 27 MOVE 'TOT DIS-INDV UNEMPLOYABLE'             /* DW6
                                           TO #SCR-DA-TEXT (#I1) /* DW6
      VALUE 28 MOVE 'PROMOTION ORDER'         TO #SCR-DA-TEXT (#I1)
      VALUE 29 MOVE 'RC 20 YEAR LETTER'       TO #SCR-DA-TEXT (#I1)
*     VALUE 28 MOVE (AD=P) TO #SCR-DA-CODE-CV (#I1)               /* TM4
*              MOVE (AD=P) TO #SCR-DA-DT-CV   (#I1)               /* TM4
*              MOVE (AD=P) TO #SCR-DA-TEXT-CV (#I1)               /* TM4
      VALUE 30 MOVE 'AUTH DOCS MOVED TO AFSC' TO #SCR-DA-TEXT (#I1)
      VALUE 31 MOVE 'SPOUSE"S WILL'           TO #SCR-DA-TEXT (#I1)
      VALUE 32 MOVE 'SPOUSE"S LIVING WILL'    TO #SCR-DA-TEXT (#I1)
      VALUE 33 MOVE 'SPS"S POWER OF ATTORNEY' TO #SCR-DA-TEXT (#I1)
      VALUE 34 MOVE 'SPOUSE"S DURABLE POA'    TO #SCR-DA-TEXT (#I1)
      VALUE 35 MOVE 'SPS"S DURABLE MED POA'   TO #SCR-DA-TEXT (#I1)
      VALUE 36 MOVE 'SPS"S TRUST AGREEMENT'   TO #SCR-DA-TEXT (#I1)
*     VALUE 36 MOVE (AD=P) TO #SCR-DA-CODE-CV (#I1)
*              MOVE (AD=P) TO #SCR-DA-DT-CV   (#I1)
*
      VALUE 37 MOVE 'CTZNSHP CTF NO.'         TO #SCR-DA-TEXT (#I1)
               RESET #SCR-DA-INFO-CV (#I1)
               MOVE (AD=P) TO #SCR-DA-DT-CV   (#I1)
      VALUE 38 MOVE '*ENTER FREE FORM BELOW*' TO #SCR-DA-TEXT (#I1)
               MOVE (AD=P) TO #SCR-DA-CODE-CV (#I1) /* PM CHG FOR FREE
      VALUE 39 MOVE (AD=I) TO #SCR-DA-TEXT-CV (#I1) /* FORM DD STATEMENT
      VALUE 40 MOVE (AD=P) TO #SCR-DA-CODE-CV (#I1) /* 03/2000
               MOVE (AD=I) TO #SCR-DA-TEXT-CV (#I1) /*
*     VALUE 38 MOVE (AD=P) TO #SCR-DA-CODE-CV (#I1) /*
*              MOVE (AD=P) TO #SCR-DA-DT-CV   (#I1) /*
*     VALUE 39 MOVE (AD=P) TO #SCR-DA-CODE-CV (#I1) /*
*              MOVE (AD=P) TO #SCR-DA-DT-CV   (#I1) /*
*     VALUE 40 MOVE (AD=P) TO #SCR-DA-CODE-CV (#I1) /*
*              MOVE (AD=P) TO #SCR-DA-DT-CV   (#I1) /*
      NONE VALUE IGNORE
    END-DECIDE
  END-FOR
*
  MOVE '*' TO #CGA-SCR-COMMAND
  MOVE 'TYPE "C/O/A/F/I/B" ON DESIRED ENTRIES TO ADD TO "DD" SCREEN'
                                                 TO #SUP-MESSAGE
  INPUT TEXT #SUP-MESSAGE MARK *#SCR-DA-CODE (1)
   USING MAP 'E4301MDD'
*
  IF #CGA-SCR-COMMAND NE '*'
    FETCH 'G1000PXX'
  END-IF
*
  RESET #CODE-ENTERED
*
  IF #SCR-DA-ACCESS-CODE = 'O' OR = 'I' OR = 'B' OR = ' '
    IGNORE
  ELSE
    REINPUT 'ONLY O/I/B ARE ALLOWED'
    MARK *#SCR-DA-ACCESS-CODE
  END-IF
*
  IF #SCR-DA-ACCESS-CODE NE ' '
    MOVE TRUE TO #CODE-ENTERED
*
    IF #SCR-DA-ACCESS-TEXT-1 = ' '
      REINPUT 'Accessee must be entered'
      MARK *#SCR-DA-ACCESS-TEXT-1
    END-IF
  END-IF
*
  RESET #CNT-ENTS
  FOR #I1 1 TO 40
    IF #SCR-DA-CODE (#I1) NE ' '
      ADD 1 TO #CNT-ENTS
    END-IF
*
    IF #I1 = 39                   /* PM ADDED 03/2000 FOR FREE FORM DD
      IF NOT #SCR-DA-CODE (#I1) = 'C' OR = 'O'
                      OR = 'I' OR = 'B' OR = ' '
        REINPUT 'ONLY   C/O/I/B AVAILABLE FOR FREE FORM DD'
        MARK *#SCR-DA-CODE (#I1)
      END-IF
*
      IF #SCR-DA-TEXT (#I1) NE ' '
       AND #SCR-DA-CODE (#I1) EQ ' '
        REINPUT 'Please enter appropriate code for free form DD'
        MARK *#SCR-DA-CODE (#I1)
      END-IF
*
      IF #SCR-DA-CODE (#I1) NE ' '
       AND #SCR-DA-TEXT (#I1) = ' '
        REINPUT 'Free form DD msg blank'
        MARK *#SCR-DA-CODE (#I1)
      END-IF
    ELSE                  /* DW6
      IF NOT #SCR-DA-CODE (#I1) = 'C' OR = 'O' OR = 'A' OR = 'F'
           OR = 'I' OR = 'B' OR = ' '
        REINPUT USING HELP
        MARK *#SCR-DA-CODE (#I1)
      END-IF
    END-IF
*
    IF   (#I1 = 1)   /* mbr correspondance
     AND (NOT #SCR-DA-CODE (#I1) = 'I' OR = 'B' OR = ' ')
      REINPUT 'Only I/B is valid fr Mbr Corr'
      MARK *#SCR-DA-CODE (#I1)
    END-IF
*
    IF #I1 = 40                     /* PM ADDED 03/2000 FOR FREE FORM DD
     AND #SCR-DA-TEXT (#I1) NE ' '
      IF #SCR-DA-TEXT (#I1 - 1) = ' '
        REINPUT 'Continuation cannot be entered without prior msg'
        MARK *#SCR-DA-TEXT (#I1)
      ELSE
        MOVE 'C' TO #SCR-DA-CODE (#I1)
      END-IF
    END-IF
*
    IF #SCR-DA-CODE(#I1) = 'C' OR = 'O' OR = 'A' OR = 'F'
                OR = 'I' OR = 'B'
      MOVE TRUE TO #CODE-ENTERED
      IF   (#SCR-DA-DT (#I1) NE ' ')
       AND ((#SCR-DA-DT (#I1) NE MASK (MMYYYY))
        OR  (#SCR-DA-YYYY (#I1) LT '1950')
        OR  (#SCR-DA-YYYY (#I1) GT '2007'))                /* TM3
        REINPUT 'Date must be in format "MMYYYY"'
        MARK *#SCR-DA-DT (#I1)
      END-IF
    END-IF
*
    IF  (#I1 = 5  OR =  6 OR =  7)
     AND (NOT #SCR-DA-INFO (#I1) = ' ' OR  = 'SPS' OR = 'MBR')
      REINPUT 'Must be "SPS" or "MBR" or blank'
      MARK *#SCR-DA-INFO (#I1)
    END-IF
  END-FOR
*
  IF NOT #CODE-ENTERED
    REINPUT 'NO CODE WAS ENTERED'
    MARK *#SCR-DA-CODE (1)
  END-IF
*
  FIND (1) DD-F01-VIEW WITH MEMBER-KEY = #CGA-ID-G
    IF NO RECORDS FOUND
      MOVE TRUE TO #NO-FIRS
      MOVE #CGA-SCR-ID TO ID-NUMBER
      MOVE 'Y' TO DD-F01-VIEW.MEMBER-FLAG
*
      IF DD-S01-VIEW.MEMBER-FLAG = 'Y'
        MOVE 'Y' TO DD-F01-VIEW.MEMBER-FLAG
      END-IF
    END-NOREC
*
    MOVE C*DOCUMENT TO #DDI
    RESET #TRI
    RESET #DCNI
*
    FOR #I1 1 TO 40
      RESET #MAX-DOC
      RESET #MAIN-DOC
      RESET #W-DATE-EDITED
*
      IF #SCR-DA-CODE (#I1) = 'C' OR = 'O' OR = 'A' OR = 'F'
                  OR = 'I' OR = 'B'
        IF #SCR-DA-DT (#I1) NE ' '
          MOVE #SCR-DA-MM (#I1) TO #I2
          COMPRESS #MON (#I2) #SCR-DA-YYYY (#I1)
                                INTO #W-DATE-EDITED LEAVING NO
        END-IF
*
        IF #SCR-DA-CODE (#I1) = 'C'
          IF #I1 = 40             /* PM ADDED 03/2000 FOR FREE FORM DD
            COMPRESS '..' #SCR-DA-TEXT (#I1) INTO #MAIN-DOC
            RESET #SCR-DA-CODE (#I1)
          ELSE
            COMPRESS 'COPY' #SCR-DA-TEXT (#I1) INTO #MAIN-DOC
          END-IF
        ELSE
          IF #SCR-DA-CODE (#I1) = 'O'
            COMPRESS 'ORIGINAL' #SCR-DA-TEXT (#I1) INTO #MAIN-DOC
          ELSE
            IF #SCR-DA-CODE (#I1) = 'A'
              COMPRESS 'ATTESTED' #SCR-DA-TEXT (#I1) INTO #MAIN-DOC
            ELSE
              IF #SCR-DA-CODE (#I1) = 'F'
                COMPRESS 'CERTIFIED' #SCR-DA-TEXT (#I1) INTO #MAIN-DOC
              ELSE
                IF #SCR-DA-CODE (#I1) = 'B'
                  IF #I1 = 39
                    COMPRESS '+' #SCR-DA-TEXT (#I1) INTO #MAIN-DOC
                  ELSE
                    COMPRESS '+COPY' #SCR-DA-TEXT (#I1) INTO #MAIN-DOC
                  END-IF
                ELSE
                  IF #SCR-DA-CODE (#I1) = 'I'
                    IF #I1 = 39
                      COMPRESS '=' #SCR-DA-TEXT (#I1) INTO #MAIN-DOC
                    ELSE
                     COMPRESS '=COPY' #SCR-DA-TEXT(#I1) INTO #MAIN-DOC
                    END-IF
                  END-IF
                END-IF
              END-IF
            END-IF
          END-IF
        END-IF
      END-IF
*
*     IF #I1 NE 1   /* DO NOT PUT 'MBR CORR' ON DD FILE           /* TM4
       IF  #MAIN-DOC NE ' '                                       /* TM4
        COMPRESS #MAIN-DOC #SCR-DA-INFO (#I1) #W-DATE-EDITED
                                                     INTO #MAX-DOC
        MOVE #MAX-DOC TO #COP-DOC
        ADD 1 TO #TRI
        MOVE #MAX-DOC TO TRLOG.NEW-DATA (#TRI)
*
        IF #MAX-DOC-LST-13 = ' '
          IF (#DDI + 1) GT 72
            REINPUT
               'THIS ENTRY WILL EXCEED 72 DOCUMENTS - COMPRESS DOCS'
            MARK *#SCR-DA-CODE (#I1)
          END-IF
*
          ADD 1 TO #DDI
          MOVE #MAX-DOC TO DOCUMENT (#DDI)
        ELSE
          IF (#DDI + 2) GT 72
            REINPUT
              'THIS ENTRY WILL EXCEED 72 DOCUMENTS - COMPRESS DOCS'
            MARK *#SCR-DA-CODE (#I1)
          END-IF
*
          ADD 1 TO #DDI
          MOVE #MAIN-DOC TO DOCUMENT (#DDI)
          ADD 1 TO #DDI
          COMPRESS '..' #SCR-DA-INFO (#I1) #W-DATE-EDITED
                                                  INTO DOCUMENT (#DDI)
        END-IF
      END-IF
*     END-IF
    END-FOR
*
    IF #SCR-DA-ACCESS-CODE NE ' '
      ADD 1 TO #DDI
*
      IF #DDI GT 72
        REINPUT 'THIS ENTRY WILL EXCEED 72 DOCUMENTS - COMPRESS DOCS'
        MARK *#SCR-DA-ACCESS-CODE
      END-IF
*
      ADD 1 TO #TRI
*
*     IF #SCR-DA-ACCESS-CODE = 'M'
*       MOVE TRUE TO #MF
*       ADD 1 TO #DCNI
*       COMPRESS 'AUTH ACCESS FILE' TO #MA-DESC (#DCNI)
*
*       MOVE '#AUTH ACCESS' TO DOCUMENT (#DDI)
*     ELSE
        IF #SCR-DA-ACCESS-CODE = 'I'
          MOVE '=AUTH ACCESS' TO DOCUMENT (#DDI)
        ELSE
          IF #SCR-DA-ACCESS-CODE = 'B'
            MOVE '+AUTH ACCESS' TO DOCUMENT (#DDI)
          ELSE
            MOVE 'ORIG AUTH ACCESS' TO DOCUMENT (#DDI)
          END-IF
        END-IF
*     END-IF
*
      IF ACCESS-AUTH-CODE NE 'Y'                        /* DW6
        ADD 1 TO #SFX
        MOVE 28 TO SYNC-FLD-NUM (#SFX)
        MOVE ACCESS-AUTH-CODE TO SYNC-FLD-OLD-DATA (#SFX)
        MOVE 'Y'              TO SYNC-FLD-NEW-DATA (#SFX)
      END-IF
*
      MOVE 'Y' TO ACCESS-AUTH-CODE
      MOVE TRUE TO #STAT-UPDATE
      COMPRESS DOCUMENT (#DDI) #SCR-DA-ACCESS-TEXT-1
                    INTO DOCUMENT (#DDI)
      MOVE DOCUMENT (#DDI) TO TRLOG.NEW-DATA (#TRI)
*
      IF #SCR-DA-ACCESS-TEXT-2 NE ' '
        ADD 1 TO #DDI
*
        IF #DDI GT 72
          REINPUT 'THIS ENTRY WILL EXCEED 72 DOCUMENTS - COMPRESS DOCS'
          MARK *#SCR-DA-ACCESS-TEXT-2
        END-IF
*
        ADD 1 TO #TRI
*
        COMPRESS '..' #SCR-DA-ACCESS-TEXT-2
                    INTO DOCUMENT (#DDI) LEAVING NO
        MOVE DOCUMENT (#DDI) TO TRLOG.NEW-DATA (#TRI)
      END-IF
*
      IF #SCR-DA-ACCESS-TEXT-3 NE ' '
        ADD 1 TO #DDI
*
        IF #DDI GT 72
          REINPUT 'THIS ENTRY WILL EXCEED 72 DOCUMENTS - COMPRESS DOCS'
          MARK *#SCR-DA-ACCESS-TEXT-3
        END-IF
*
        ADD 1 TO #TRI
*
        COMPRESS '..' #SCR-DA-ACCESS-TEXT-3
                    INTO DOCUMENT (#DDI) LEAVING NO
        MOVE DOCUMENT (#DDI) TO TRLOG.NEW-DATA (#TRI)
      END-IF
    END-IF
*
    MOVE *DATN TO DOCU-LAST-FM-DATE
    MOVE *TIMN TO DTS-TIMN
    MOVE *DATN TO DTS-DATN
*
*    IF #STAT-UPDATE    /* DW7
*      UPDATE (0170)
*    END-IF
*
*    IF #NO-FIRS                /* DW7
*      STORE DD-F01-VIEW
*    ELSE
*      UPDATE (0396)
*    END-IF
*
    COMPRESS #CGA-ORIG-COMMAND '-' INTO OLD-DATA (1) LEAVING NO
*
    IF #TRI NE 0
      PERFORM TRLOG-WRITE
    END-IF
*
    END TRANSACTION
  END-FIND
*
  IF #CGA-SCR-SUFFIX = 'COP'
    IF #CNT-ENTS GT 1
      REINPUT 'Only 1 entry is allowed on a "DA" COP'
      MARK *#CGA-SCR-COMMAND
    END-IF
*
*   MOVE #CGA-SCR-ID TO #SCR-COPY-CN-1 (1)
    MOVE '*' TO #CGA-SCR-COMMAND
    INPUT TEXT 'Enter up to 60 CN"s to receive the just entered DD'
      MARK *#SCR-COPY-CN-1 (1) USING MAP 'G4001MNU' /* also in G4000PNU
*
    IF #CGA-SCR-COMMAND NE '*'
      FETCH 'G1000PXX'
    END-IF
*
    FOR #ICOP 1 TO 20
      RESET #BAD-COPY
      IF #SCR-COPY-CN-1 (#ICOP) NE 0
        MOVE #SCR-COPY-CN-1 (#ICOP) TO #CGA-ID
        PERFORM PROCESS-DD-COP
*
        IF #BAD-COPY
          MOVE TRUE TO #BAD-COPY-IND-1 (#ICOP)
        END-IF
      END-IF
    END-FOR
*
    FOR #ICOP 1 TO 20
      RESET #BAD-COPY
      IF #SCR-COPY-CN-2 (#ICOP) NE 0
        MOVE #SCR-COPY-CN-2 (#ICOP) TO #CGA-ID
        PERFORM PROCESS-DD-COP
*
        IF #BAD-COPY
          MOVE TRUE TO #BAD-COPY-IND-2 (#ICOP)
        END-IF
      END-IF
    END-FOR
*
    FOR #ICOP 1 TO 20
      RESET #BAD-COPY
      IF #SCR-COPY-CN-3 (#ICOP) NE 0
        MOVE #SCR-COPY-CN-3 (#ICOP) TO #CGA-ID
        PERFORM PROCESS-DD-COP
*
        IF #BAD-COPY
          MOVE TRUE TO #BAD-COPY-IND-3 (#ICOP)
        END-IF
      END-IF
    END-FOR
*
    FOR #ICOP 1 TO 20
      IF #BAD-COPY-IND-1 (#ICOP)
        MOVE #SCR-COPY-CN-1 (#ICOP) TO #CN
        PERFORM SHOW-COPY-ERROR
      END-IF
    END-FOR
*
    FOR #ICOP 1 TO 20
      IF #BAD-COPY-IND-2 (#ICOP)
        MOVE #SCR-COPY-CN-2 (#ICOP) TO #CN
        PERFORM SHOW-COPY-ERROR
      END-IF
    END-FOR
*
    FOR #ICOP 1 TO 20
      IF #BAD-COPY-IND-3 (#ICOP)
        MOVE #SCR-COPY-CN-3 (#ICOP) TO #CN
        PERFORM SHOW-COPY-ERROR
      END-IF
    END-FOR
*
    RESET #CGA-SCR-SUFFIX
    MOVE 'All Copied DA"s have been added' TO #SUP-MESSAGE
    INPUT TEXT #SUP-MESSAGE USING MAP 'G1000MXX'
*
    IF #CGA-SCR-COMMAND = '*'
      MOVE 'DD' TO #CGA-SCR-COMMAND
      RESET #CGA-SCR-SUFFIX
    END-IF
*
    FETCH 'G1000PXX'
  END-IF
*
* * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE SHOW-COPY-ERROR
* * * * * * * * * * * * * * * * *
WRITE 'Copied DD for CN' #CN
WRITE 'not applied due to edit errors'
WRITE 'Press ENTER to return to "DD" screen'
*
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE PROCESS-DD-COP
* * * * * * * * * * * * * * * * *
*
FIND DD-S01-VIEW WITH MEMBER-KEY = #CGA-ID-G
  IF NO RECORDS FOUND
    MOVE TRUE TO #BAD-COPY
    ESCAPE ROUTINE
  END-NOREC
END-FIND
*
FIND DD-F01-VIEW WITH MEMBER-KEY = #CGA-ID-G
  IF NO RECORDS FOUND
    ASSIGN #NO-FIRS = TRUE
    MOVE DD-S01-VIEW.ID-NUMBER TO DD-F01-VIEW.ID-NUMBER
    MOVE 'Y'                   TO DD-F01-VIEW.MEMBER-FLAG
*
    IF DD-S01-VIEW.MEMBER-FLAG = 'Y'
      MOVE 'Y' TO DD-F01-VIEW.MEMBER-FLAG
    END-IF
  END-NOREC
*
  MOVE C*DOCUMENT TO #DDI
*
  IF #MAX-DOC-LST-13 = ' '
    IF (#DDI + 1) GT 72
      MOVE TRUE TO #BAD-COPY
      ESCAPE ROUTINE
    END-IF
*
    ADD 1 TO #DDI
    MOVE #COP-DOC TO DOCUMENT (#DDI)
  ELSE
    IF (#DDI + 2) GT 72
      MOVE TRUE TO #BAD-COPY
      ESCAPE ROUTINE
    END-IF
*
    ADD 1 TO #DDI
    MOVE #MAIN-DOC TO DOCUMENT (#DDI)
    ADD 1 TO #DDI
    COMPRESS '..' #SCR-DA-INFO (#I1) #W-DATE-EDITED INTO DOCUMENT (#DDI)
  END-IF
*
*  IF #NO-FIRS              /* DW7
*    STORE DD-F01-VIEW
*  ELSE
*    UPDATE (0695)
*  END-IF
*
  COMPRESS #CGA-ORIG-COMMAND '-' INTO OLD-DATA (1) LEAVING NO
  PERFORM TRLOG-WRITE
  END TRANSACTION
END-FIND
*
END-SUBROUTINE
*
  FOR #I1 1 TO 40
    MOVE (AD=P) TO #SCR-DA-CODE-CV (#I1)
    MOVE (AD=P) TO #SCR-DA-TEXT-CV (#I1)
    MOVE (AD=P) TO #SCR-DA-DT-CV   (#I1)
    MOVE (AD=P) TO #SCR-DA-INFO-CV (#I1)
  END-FOR
  MOVE (AD=P) TO #SCR-CV
*
  MOVE 'TRANSACTION COMPLETED' TO #SUP-MESSAGE
  MOVE 'DA' TO #CGA-SCR-COMMAND
*
  INPUT TEXT #SUP-MESSAGE USING MAP 'E4301MDD'
*
  IF #CGA-SCR-COMMAND NE '*'
    FETCH 'G1000PXX'
  END-IF
*
* IF   (#CGA-SCR-SUFFIX = 'DOC')
*  AND (#DCNI GT 1)
*   MOVE *DATN TO #WYYYYMMDD-N
*   COMPRESS #WMM-A #WDD-A #WYY-A INTO #MA-DESC (1) LEAVING NO
*   COMPRESS 'CY MULTI DOCS' #MA-DESC (1) INTO #MA-DESC (1)
*   MOVE 2 TO #I1
* ELSE
    COMPUTE #I1 = #DCNI + 1
* END-IF
END-IF
*
IF DD-S01-VIEW.WIDOW-FLAG = 'Y'
  MOVE 'WIDOW UPDATE DOCUMENTS' TO #SCR-HEADING
ELSE
  MOVE 'FIRS UPDATE DOCUMENTS' TO #SCR-HEADING
END-IF
*
IF ACCESS-AUTH-CODE = ' '
  MOVE 'N' TO #SCR-ACCESS-AUTH-CODE
ELSE
  MOVE ACCESS-AUTH-CODE TO #SCR-ACCESS-AUTH-CODE
END-IF
*
MOVE '* ' TO #CGA-SCR-COMMAND
*
COMPRESS #HCD-MM '/' #HCD-DD '/' #HCD-YYYY INTO #SCN-DOB
  LEAVING NO SPACE
*
IF #NO-FIRS
  MOVE 0 TO #HOLD-CONVERT-DATE
ELSE
  GET DD-F01-VIEW #ISN
  MOVE DOCU-LAST-FM-DATE TO #HOLD-CONVERT-DATE
  MOVE *ISN TO #HOLD-FIR-ISN
END-IF
*
MOVE DD-S01-VIEW.LAST-FM-DATE TO #WYYYYMMDD-N
IF (#WYYYYMMDD.#WMM GT 00) AND (#WYYYYMMDD.#WMM LT 13)
   COMPRESS #DD #MON (#WMM) #YYYY INTO #SCN-LST-FM-DM WITH '-'
ELSE
    MOVE '    ?    ' TO #SCN-LST-FM-DM
END-IF
*
MOVE DD-F01-VIEW.DP-LAST-FM-DATE TO #WYYYYMMDD-N
IF (#WYYYYMMDD.#WMM GT 00) AND (#WYYYYMMDD.#WMM LT 13)
   COMPRESS #DD #MON (#WMM) #YYYY INTO #SCN-LST-FM-DC WITH '-'
ELSE
   MOVE '    ?    ' TO #SCN-LST-FM-DC
END-IF
*
MOVE DD-F01-VIEW.DOCU-LAST-FM-DATE TO #WYYYYMMDD-N
IF (#WYYYYMMDD.#WMM GT 00) AND (#WYYYYMMDD.#WMM LT 13)
   COMPRESS #DD #MON (#WMM) #YYYY INTO #SCN-LST-FM-DD WITH '-'
ELSE
  MOVE '    ?    ' TO #SCN-LST-FM-DD
END-IF
*
MOVE DD-F01-VIEW.INS-LAST-FM-DATE TO #WYYYYMMDD-N
IF (#WYYYYMMDD.#WMM GT 00) AND (#WYYYYMMDD.#WMM LT 13)
   COMPRESS #DD #MON (#WMM) #YYYY INTO #SCN-LST-FM-DP WITH '-'
ELSE
  MOVE '    ?    ' TO #SCN-LST-FM-DP
END-IF
*
MOVE DD-S01-VIEW.LAST-FM-DATE-WH TO #WYYYYMMDD-N
IF (#WYYYYMMDD.#WMM GT 00) AND (#WYYYYMMDD.#WMM LT 13)
   COMPRESS #DD #MON (#WMM) #YYYY INTO #SCN-LST-FM-SU WITH '-'
ELSE
  MOVE '    ?    ' TO #SCN-LST-FM-SU
END-IF
*
IF #CGA-ORIG-SUFFIX = 'ADL'
  MOVE 37 TO #FMX
  MOVE 72 TO #TOX
  MOVE 'THIS IS THE 2ND SET OF 36 DOCS' TO #SCR-TEXT
ELSE
  IF C*DOCUMENT GT 36
    MOVE 'OVER 36 DOCS - USE SUFFIX "ADL" FOR ADDL' TO #SCR-TEXT
  END-IF
*
  MOVE  1 TO #FMX
  MOVE 36 TO #TOX
END-IF
*
RESET #I2
FOR #I1 #FMX TO #TOX
  ADD 1 TO #I2
  MOVE DOCUMENT (#I1) TO #SCR-DOCS (#I2)
END-FOR
*
FOR #I1 1 TO 72
  IF   (DOCUMENT (#I1) = MASK ('#COPY AUTH DOCS MOVED'))
   OR  (DOCUMENT (#I1) = MASK ('COPY AUTH DOCS MOVED'))
   OR  (DOCUMENT (#I1) = MASK ('=COPY AUTH DOCS MOVED'))
   OR  (DOCUMENT (#I1) = MASK ('+COPY AUTH DOCS MOVED'))
    COMPRESS 'Docs moved to AFSC' #SCR-TEXT INTO #SCR-TEXT
    ESCAPE BOTTOM
  END-IF
END-FOR
*
IF PROCESS-IND = 'S' AND APPL-SOURCE = 'TU'               /* TM2
  COMPRESS #SCR-TEXT '*Docs Stored in AAFMAA Vault ' INTO #SCR-TEXT
END-IF                                                    /* TM2
*
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
INPUT TEXT #SCR-TEXT USING MAP 'E4300MDD'
* INPUT TEXT #SCR-TEXT MARK *#SCR-DOCS (1) USING MAP 'E4300MDD'
*
IF  (#CGA-SCR-COMMAND NE '*')
 OR (#CGA-SCR-ID NE #CGA-ORIG-ID)
  END TRANSACTION
  FETCH 'G1000PXX'
END-IF
*
move 'DD' to #cga-scr-command   /* DW7
FETCH 'G1000PXX'                /* DW7
*
* * * * * * * * * * * * * * * * * PROCESS ACCESS AUTH CODE * * * *
*
RESET #I2
FOR #I1 #FMX TO #TOX
  ADD 1 TO #I2
  MOVE #SCR-DOCS (#I2) TO DOCUMENT (#I1)
END-FOR
*
IF   (DD-S01-VIEW.ACCESS-AUTH-CODE = ' ')
 AND (#SCR-ACCESS-AUTH-CODE = 'N')
  IGNORE
ELSE
  IF DD-S01-VIEW.ACCESS-AUTH-CODE NE #SCR-ACCESS-AUTH-CODE
    MOVE TRUE TO #STAT-UPDATE
    MOVE TRUE TO #FIELD-CHANGED
    CALLNAT 'GACAUSXX' #SCR-ACCESS-AUTH-CODE #INVALID #ERR-MSG
    IF #INVALID
      REINPUT USING HELP
      MARK *#SCR-ACCESS-AUTH-CODE
    END-IF
*
*   below removed 3/27/96 as per skh
*   IF #SCR-ACCESS-AUTH-CODE = 'S'    /* IF ITS GOING TO "S"
*     IF DD-S01-VIEW.NAME-SP = ' '
*       REINPUT 'NO SPOUSE NAME ON FILE'
*       MARK *#SCR-ACCESS-AUTH-CODE
*    END-IF
*
*     FOR #I1 72 1 STEP -1
*       IF DD-F01-VIEW.DOCUMENT (#I1) NE ' '
*         ADD 1 TO #I1
*         ESCAPE BOTTOM
*       END-IF
*     END-FOR
*
*     IF #I1 LT 1
*       MOVE 1 TO #I1
*     END-IF
*
*     IF #I1 GT 72
*       REINPUT 'MAXIMUM DD ENTRIES EXIST - MAKE LAST ONE AVAILABLE'
*       MARK *DD-F01-VIEW.DOCUMENT (1)
*     END-IF
*
*     PERFORM SPS-NAME-HUNT
*     COMPRESS '*SPOUSE' #WORK-NAME 'HAS ACCESS TO FILE'
*                                  TO DD-F01-VIEW.DOCUMENT (#I1)
*   ELSE
      IF DD-S01-VIEW.ACCESS-AUTH-CODE = 'S' OR = 'Y' /* IF IT WAS "S/Y"
        FOR #I1 1 TO 72
          IF   (DD-F01-VIEW.DOCUMENT(#I1) = MASK ('*SPOUSE'))
           OR  (DD-F01-VIEW.DOCUMENT(#I1) = MASK ('#SPOUSE'))
           OR  (DD-F01-VIEW.DOCUMENT(#I1) = MASK ('ORIG AUTH'))
           OR  (DD-F01-VIEW.DOCUMENT(#I1) = MASK ('AUTH'))
           OR  (DD-F01-VIEW.DOC-36 (#I1)  = MASK ('AUTH'))
           OR  (DD-F01-VIEW.DOC-36 (#I1)  = MASK ('LTR AUTH'))
           OR  (DD-F01-VIEW.DOC-36 (#I1)  = MASK ('LETTER AUTH'))
            FOR #I2 1 TO 36
              IF #SCR-DOCS (#I2) = DD-F01-VIEW.DOCUMENT (#I1)
                RESET #SCR-DOCS (#I2)
                ESCAPE BOTTOM
              END-IF
            END-FOR
*
            RESET DD-F01-VIEW.DOCUMENT (#I1)
*
            IF DD-F01-VIEW.DOCUMENT (#I1 + 1) = MASK ('.')
              FOR #I2 1 TO 36
                IF #SCR-DOCS (#I2) = DD-F01-VIEW.DOCUMENT (#I1 + 1)
                  RESET #SCR-DOCS (#I2)
                  ESCAPE BOTTOM
                END-IF
              END-FOR
*
              RESET DD-F01-VIEW.DOCUMENT (#I1 + 1)
              IF DD-F01-VIEW.DOCUMENT (#I1 + 2) = MASK ('.')
                FOR #I2 1 TO 36
                  IF #SCR-DOCS (#I2) = DD-F01-VIEW.DOCUMENT (#I1 + 1)
                    RESET #SCR-DOCS (#I2)
                    ESCAPE BOTTOM
                  END-IF
                END-FOR
*
                RESET DD-F01-VIEW.DOCUMENT (#I1 + 2)
              END-IF
            END-IF
            ESCAPE BOTTOM
          END-IF
        END-FOR
      END-IF
*   END-IF
  END-IF
END-IF
*
PERFORM PROCESS-TRLOG
*
IF #FIELD-CHANGED
  PERFORM TRLOG-WRITE
  MOVE *DATN TO DOCU-LAST-FM-DATE
  MOVE *TIMN TO DTS-TIMN
  MOVE *DATN TO DTS-DATN
  MOVE 'TRANSACTION COMPLETED' TO #SUP-MESSAGE
*
*  IF #STAT-UPDATE    /* DW7
*    UPDATE (0170)
*  END-IF
*
*  IF #NO-FIRS
*    STORE DD-F01-VIEW
*    END TRANSACTION
*  ELSE
*    UPDATE (0789)
*    END TRANSACTION
*  END-IF
ELSE
  MOVE 'NO UPDATES REQUESTED' TO #SUP-MESSAGE
END-IF
*
IF DD-S01-VIEW.WIDOW-FLAG = 'Y'
  MOVE 'DF' TO #CGA-SCR-COMMAND
ELSE
  MOVE 'DD' TO #CGA-SCR-COMMAND
END-IF
*
MOVE (AD=P) TO #SCR-CV
MOVE (AD=P) TO #SCR-CVX (*)
*
IF   (NOT #FIELD-CHANGED)
 AND (DD-S01-VIEW.WIDOW-FLAG = 'Y')
  IGNORE
ELSE
  INPUT TEXT #SUP-MESSAGE USING MAP 'E4300MDD'
END-IF
*
FETCH 'G1000PXX'
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
DEFINE SUBROUTINE PROCESS-TRLOG
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
*
COMPRESS #CGA-ORIG-COMMAND '-' INTO OLD-DATA (1) LEAVING NO
MOVE 2 TO #INDEXT
RESET #SFX      /* DW5
*
IF   (DD-S01-VIEW.ACCESS-AUTH-CODE = ' ')
 AND (#SCR-ACCESS-AUTH-CODE = 'N')
  IGNORE
ELSE
  IF DD-S01-VIEW.ACCESS-AUTH-CODE NE #SCR-ACCESS-AUTH-CODE
    MOVE TRUE TO #FIELD-CHANGED
    MOVE TRUE TO #STAT-UPDATE
    COMPRESS 'OLD ACCESS-AUTH-CODE = ' DD-S01-VIEW.ACCESS-AUTH-CODE
                                       TO TRLOG.OLD-DATA (#INDEXT)
    COMPRESS 'NEW ACCESS-AUTH-CODE = ' #SCR-ACCESS-AUTH-CODE
                                       TO TRLOG.NEW-DATA (#INDEXT)
*
    ADD 1 TO #SFX                           /* DW5
    MOVE 28 TO SYNC-FLD-NUM (#SFX)
    MOVE DD-S01-VIEW.ACCESS-AUTH-CODE TO SYNC-FLD-OLD-DATA (#SFX)
    MOVE #SCR-ACCESS-AUTH-CODE        TO SYNC-FLD-NEW-DATA (#SFX)
*
    ADD 1 TO #INDEXT
*
    IF #SCR-ACCESS-AUTH-CODE = 'N'
      RESET DD-S01-VIEW.ACCESS-AUTH-CODE
    ELSE
      MOVE #SCR-ACCESS-AUTH-CODE TO DD-S01-VIEW.ACCESS-AUTH-CODE
    END-IF
  END-IF
END-IF
*
IF #NO-FIRS
  FOR #INDEXR 1 TO 36
    IF DD-F01-VIEW.DOCUMENT(#INDEXR) NE '    '
      MOVE DD-F01-VIEW.DOCUMENT(#INDEXR) TO TRLOG.NEW-DATA(#INDEXT)
      COMPUTE #INDEXT = #INDEXT + 1
      ASSIGN #FIELD-CHANGED = TRUE
    END-IF
  END-FOR
ELSE
  GET OLD-DD #HOLD-FIR-ISN
  FOR #INDEXR #FMX TO #TOX
    IF DD-F01-VIEW.DOCUMENT (#INDEXR) NE OLD-DD.DOCUMENT (#INDEXR)
      ASSIGN #FIELD-CHANGED = TRUE
      MOVE OLD-DD.DOCUMENT (#INDEXR) TO TRLOG.OLD-DATA (#INDEXT)
      MOVE DD-F01-VIEW.DOCUMENT (#INDEXR) TO TRLOG.NEW-DATA (#INDEXT)
*
      IF #INDEXT LT 32
        ADD 1 TO #INDEXT
      END-IF
    END-IF
  END-FOR
END-IF
*
END-SUBROUTINE /* (1011)
*
* * * * * * * * * * * * * * * *
DEFINE SUBROUTINE TRLOG-WRITE
* * * * * * * * * * * * * * * *
*
MOVE DD-S01-VIEW.NAME      TO TRLOG.NAME
MOVE DD-F01-VIEW.ID-NUMBER TO TRLOG.ID-NUMBER
MOVE DD-S01-VIEW.PROCESS-IND TO TRLOG.PROCESS-IND /* PM - 06/2000 -SPLIT
MOVE DD-F01-VIEW.DOCU-LAST-FM-DATE TO TRLOG.DATE-LAST-UPDATE
MOVE #CGA-CLERK            TO TRLOG.CLERK-ID
MOVE *INIT-ID              TO TRLOG.TERMINAL-ID
MOVE *DATN                 TO TRLOG.TRANSACTION-DATN
MOVE *TIMN                 TO TRLOG.TRANSACTION-TIMN
STORE TRLOG
*
END-SUBROUTINE /* (1071)
*
* * * * * * * * * * * * * * * *
DEFINE SUBROUTINE SPS-NAME-HUNT
* * * * * * * * * * * * * * * *
*
SEPARATE DD-S01-VIEW.NAME-SP INTO #NAME-1 #WORK-NAME #NAME-3 #NAME-4
                WITH  DELIMITER ','
RESET #NAME-1 #NAME-2 #NAME-3 #NAME-4 #NAME-5
SEPARATE #WORK-NAME INTO #NAME-1 #NAME-2 #NAME-3 #NAME-4 #NAME-5
                WITH  DELIMITER ' '
*
IF   (#NAME-1 = MASK (..'             '))  /* 1ST INITIAL
 AND (#NAME-2 NE ' ')
  MOVE #NAME-2 TO #WORK-NAME
ELSE
  MOVE #NAME-1 TO #WORK-NAME
END-IF
*
END-SUBROUTINE /*(0919)
*
* * * * * * * * * * * * * * * *
DEFINE SUBROUTINE DATE-REFORMAT
* * * * * * * * * * * * * * * *
*
IF (#WYYYYMMDD.#WMM GT 00) AND (#WYYYYMMDD.#WMM LT 13)
  MOVE #WYYYYMMDD.#WMM TO #I1
  MOVE EDITED #WYYYYMMDD.#WDD (EM=Z9) TO #WYYYYMMDD.#WDD-A
  COMPRESS #WYYYYMMDD.#WDD #MON (#I1) #WYYYYMMDD.#WYY-A
                                   INTO #W-DATE-EDITED WITH '-'
ELSE
  MOVE '    ?    ' TO #W-DATE-EDITED
END-IF
*
END-SUBROUTINE
*
END
