* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PGM-ID: E4700NBD - THIS SUBPROGRAM IS BD PART FOR BENE NEW DATA FILE
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
* NGG    11292012  NONE    Created for CN Expansion Project            *
* NGG    08032015  NG2     Policy ownership Project                    *
************************************************************************
DEFINE DATA
PARAMETER
1  #REQUEST                (I4)
1 #FINAL-BENE-NT-REC-NUM   (N6)  /* in
1 #SEGMENT                 (N1)  /* in
1 #FINAL-BENE-NT-REC-FND   (L)   /* out
1 #FINAL-NT-ISN            (P8)  /* out
1 #NUM-BN-PEND-POLS        (P3)  /* out
1 #PEND-BENE-NT-REC-NUM    (N6)  /* out
1 #PEND-BENE-NT-REC-FND    (L)   /* out
1 #PEND-NT-ISN             (P8)  /* out
1 #TEMPDATA                (L)   /* out
LOCAL
1 DRAFT VIEW OF A-BENE-DRAFT  /* NG1
  2 ID-NUMBER  (N6)           /* D = bene desig (1-6)
  2 NOTE-DATE           (N8/60) /* P/A = PRIN/ALT DESIG
  2 NOTE-CLERK-ID       (A3/60)
  2 NOTE-TEXT           (A60/60)
  2 BENE-CONTACT-ID     (N8/60)
  2 LST-BD-FINALIZATION-USER (A3)
*
1 NT-V VIEW OF A-BENE-FINAL  /* NG1
  2 ID-NUMBER  (N6)          /* D = bene desig (1-6)
  2 NOTE-DATE  (N8/60)       /* P/A = PRIN/ALT DESIG
  2 REDEFINE NOTE-DATE       /* L = linked pols
    3 BENE-DATES-6-POLS   (6)
      4 BENE-ISS-DT       (N6/7) /* (D, L)
      4 BENE-SPLIT-IND    (N1/7) /* (D, L)
      4 BENE-LST-UPD      (N8)   /* (D)
      4 BENE-STRT-PEND    (N8)   /* (D)
      4 BENE-FOL-UP-IND   (N1)   /* (D)
      4 BENE-OWN-TRNSF-DT (N8)   /* (D)
      4 BENE-SUC-OWN      (N1)   /* (d)
      4 BENE-NEW-LAYOUT   (N1)   /* (D)/* was -setl-opt
      4 BENE-COM-DIS      (N2)   /* (D)/* Common disaster
      4 BENE-PER-STR      (N1)   /* (D)/* Per Stirpes
      4 BENE-FIL1         (A1)
  2 NOTE-CLERK-ID         (A3/60)
  2 NOTE-TEXT             (A60/60)
  2 BENE-CONTACT-ID       (N8/60)
  2 LST-BD-FINALIZATION-USER (A3)
  2 ADD-USER              (A8)   /* NG2
1 #GET         (I4) CONST <1>
1 #UPDATE      (I4) CONST <2>
1 #I1  (I4)
1 #I2  (I4)
END-DEFINE
*
IF #REQUEST = #GET
*   MOVE #FINAL-BENE-NT-REC-NUM TO #PEND-BENE-NT-REC-NUM
*   FIND DRAFT WITH ID-NUMBER = #PEND-BENE-NT-REC-NUM
*     IF NO RECORDS FOUND
*       RESET #PEND-BENE-NT-REC-FND
*       ESCAPE BOTTOM
*     END-NOREC
*     ADD 500000 TO #PEND-BENE-NT-REC-NUM
* /* IF THERE ARE OLD PENDING
*     FIND NT-V WITH ID-NUMBER = #PEND-BENE-NT-REC-NUM
*       DELETE
*     END-FIND
*     MOVE TRUE TO #PEND-BENE-NT-REC-FND
*     MOVE BY NAME DRAFT TO NT-V
*     NT-V.ID-NUMBER := #PEND-BENE-NT-REC-NUM
*     STORE NT-V
*     MOVE *ISN (0076) TO #PEND-NT-ISN
*     FOR #I1 1 TO 6
*       FOR #I2 1 TO 7
*         IF NT-V.BENE-ISS-DT (#I1, #I2) NE 0
*           ADD 1 TO #NUM-BN-PEND-POLS
*         END-IF
*       END-FOR
*     END-FOR
*   END-FIND
* END-IF
  FIND (1) NT-V WITH ID-NUMBER = #FINAL-BENE-NT-REC-NUM
    IF NO RECORDS FOUND
      PERFORM CONVERT-AUC-BENE
      ESCAPE BOTTOM
    END-NOREC
    MOVE *ISN TO #FINAL-NT-ISN
    PERFORM CONVERT-AUC-BENE
  END-FIND
END-IF
IF #REQUEST = #UPDATE
  IF #TEMPDATA
    ESCAPE ROUTINE
  END-IF
  FIND (1) DRAFT WITH ID-NUMBER = #FINAL-BENE-NT-REC-NUM
    DELETE
  END-FIND
  #PEND-BENE-NT-REC-NUM := #FINAL-BENE-NT-REC-NUM + 500000
  FIND (1) NT-V WITH ID-NUMBER = #PEND-BENE-NT-REC-NUM
    IF NO RECORDS FOUND
      ESCAPE BOTTOM
    END-NOREC
    MOVE BY NAME NT-V TO DRAFT
    SUBTRACT 500000 FROM DRAFT.ID-NUMBER
    DELETE (0104)
    STORE DRAFT
  END-FIND
END-IF
/*   NG2
DEFINE CONVERT-AUC-BENE
/*     ----------------
CALLNAT 'POSN0015'
  #FINAL-BENE-NT-REC-NUM
  #FINAL-NT-ISN
  #SEGMENT
  #TEMPDATA
IF #FINAL-NT-ISN > 0
  MOVE TRUE TO #FINAL-BENE-NT-REC-FND
ELSE
  RESET #FINAL-BENE-NT-REC-FND
END-IF
END-SUBROUTINE
/*
END
