DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
 1 #AGE-TBL-1 (P3/11) CONST /* CHG LAST-UPD DATES IN
   (1) <26>
   (2) <30>
   (3) <35>
   (4) <40>
   (5) <45>
   (6) <50>
   (7) <55>
   (8) <60>
   (9) <65>
   (10) <70>
   (11) <999>
 1 #AGE-TBL-2 (P3/3) CONST /* E9010SDX IF AMTS CHGED
   (1) <56>
   (2) <61>
   (3) <999>
 1 #AGE-TBL-3 (P3/12) CONST
   (1) <31>
   (2) <36>
   (3) <41>
   (4) <46>
   (5) <51>
   (6) <56>
   (7) <61>
   (8) <65>
   (9) <70>
   (10) <75>
   (11) <80>
   (12) <999>
 1 #AGE-IDX (I1)
 1 #VGLI-ACT-LAST-UPD (A10) /*<<<<<<
   INIT<'08/09/2006'>
 1 #VGLI-LAST-UPD (A10) /*<<<<<<
   INIT<'08/09/2006'>
 1 #AFRBA-LAST-UPD (A10) /*<<<<<<
   INIT<'06/01/1989'>
 1 #MBA-LAST-UPD (A10) /*<<<<<<
   INIT<'06/29/1992'>
/*
 1 #SGLI-ACT-RESV-FULL-TIME-CST
   2 #SARFTC-400K (N2.2)
     INIT<29.00>
   2 #SARFTC-350K (N2.2)
     INIT<25.50>
   2 #SARFTC-300K (N2.2)
     INIT<22.00>
   2 #SARFTC-250K (N2.2)
     INIT<18.50>
   2 #SARFTC-200K (N2.2)
     INIT<15.00>
   2 #SARFTC-150K (N2.2)
     INIT<11.50>
   2 #SARFTC-100K (N2.2)
     INIT<08.00>
   2 #SARFTC-50K (N2.2)
     INIT<04.50>
/* 2#SARFTC-70K                     N 2.2INIT<04.55>
/* 2#SARFTC-60K                     N 2.2INIT<03.90>
/* 2#SARFTC-50K                     N 2.2INIT<03.25>
/* 2#SARFTC-40K                     N 2.2INIT<02.60>
/* 2#SARFTC-30K                     N 2.2INIT<01.95>
/* 2#SARFTC-20K                     N 2.2INIT<01.30>
/* 2#SARFTC-10K                     N 2.2INIT<00.65>
/*
 1 REDEFINE #SGLI-ACT-RESV-FULL-TIME-CST /* REDEF. BEGIN : #VGLI-ACT-RESV
   2 #SGLI-ACT-RESV-FULL-TIME-COST (N2.2/8)
/*
 1 #SGLI-ACT-RESV-PART-TIME-CST
   2 #SARPTC-400K (N2.2)
     INIT<40.00>
   2 #SARPTC-350K (N2.2)
     INIT<35.00>
   2 #SARPTC-300K (N2.2)
     INIT<30.00>
   2 #SARPTC-250K (N2.2)
     INIT<25.00>
   2 #SARPTC-200K (N2.2)
     INIT<20.00>
   2 #SARPTC-100K (N2.2)
     INIT<10.00>
   2 #SARPTC-90K (N2.2)
     INIT<09.00>
   2 #SARPTC-80K (N2.2)
     INIT<08.00>
   2 #SARPTC-70K (N2.2)
     INIT<07.00>
   2 #SARPTC-60K (N2.2)
     INIT<06.00>
   2 #SARPTC-50K (N2.2)
     INIT<05.00>
   2 #SARPTC-40K (N2.2)
     INIT<04.00>
   2 #SARPTC-30K (N2.2)
     INIT<03.00>
   2 #SARPTC-20K (N2.2)
     INIT<02.00>
   2 #VSRPTC-10K (N2.2)
     INIT<01.00>
/*
 1 REDEFINE #SGLI-ACT-RESV-PART-TIME-CST /* REDEF. BEGIN : #VGLI-ACT-RESV
   2 #SGLI-ACT-RESV-PART-TIME-COST (N2.2/15)
/*
 1 #SGLI-RET-RESV-CST
   2 #SRRC-44-250K (N3.2)
     INIT<85.00>
   2 #SRRC-44-200K (N3.2)
     INIT<68.00>
   2 #SRRC-44-100K (N3.2)
     INIT<34.00>
   2 #SRRC-44-90K (N3.2)
     INIT<30.60>
   2 #SRRC-44-80K (N3.2)
     INIT<27.20>
   2 #SRRC-44-70K (N3.2)
     INIT<23.80>
   2 #SRRC-44-60K (N3.2)
     INIT<20.40>
   2 #SRRC-44-50K (N3.2)
     INIT<17.00>
   2 #SRRC-44-40K (N3.2)
     INIT<13.60>
   2 #SRRC-44-30K (N3.2)
     INIT<10.20>
   2 #SRRC-44-20K (N3.2)
     INIT<06.80>
   2 #SRRC-45-250K (N3.2)
     INIT<105.00>
   2 #SRRC-45-200K (N3.2)
     INIT<84.00>
   2 #SRRC-45-100K (N3.2)
     INIT<42.00>
   2 #SRRC-45-90K (N3.2)
     INIT<37.80>
   2 #SRRC-45-80K (N3.2)
     INIT<33.60>
   2 #SRRC-45-70K (N3.2)
     INIT<29.40>
   2 #SRRC-45-60K (N3.2)
     INIT<25.20>
   2 #SRRC-45-50K (N3.2)
     INIT<21.00>
   2 #SRRC-45-40K (N3.2)
     INIT<16.80>
   2 #SRRC-45-30K (N3.2)
     INIT<12.60>
   2 #SRRC-45-20K (N3.2)
     INIT<08.40>
   2 #SRRC-50-250K (N3.2)
     INIT<140.00>
   2 #SRRC-50-200K (N3.2)
     INIT<112.00>
   2 #SRRC-50-100K (N3.2)
     INIT<56.00>
   2 #SRRC-50-90K (N3.2)
     INIT<50.40>
   2 #SRRC-50-80K (N3.2)
     INIT<44.80>
   2 #SRRC-50-70K (N3.2)
     INIT<39.20>
   2 #SRRC-50-60K (N3.2)
     INIT<33.60>
   2 #SRRC-50-50K (N3.2)
     INIT<28.00>
   2 #SRRC-50-40K (N3.2)
     INIT<22.40>
   2 #SRRC-50-30K (N3.2)
     INIT<16.80>
   2 #SRRC-50-20K (N3.2)
     INIT<11.20>
   2 #SRRC-55-250K (N3.2)
     INIT<180.00>
   2 #SRRC-55-200K (N3.2)
     INIT<144.00>
   2 #SRRC-55-100K (N3.2)
     INIT<72.00>
   2 #SRRC-55-90K (N3.2)
     INIT<64.80>
   2 #SRRC-55-80K (N3.2)
     INIT<57.60>
   2 #SRRC-55-70K (N3.2)
     INIT<50.40>
   2 #SRRC-55-60K (N3.2)
     INIT<43.20>
   2 #SRRC-55-50K (N3.2)
     INIT<36.00>
   2 #SRRC-55-40K (N3.2)
     INIT<28.80>
   2 #SRRC-55-30K (N3.2)
     INIT<21.60>
   2 #SRRC-55-20K (N3.2)
     INIT<14.40>
/*
 1 REDEFINE #SGLI-RET-RESV-CST /* REDEF. BEGIN : #VGLI-RET-RESV
   2 #SGLI-RET-RESV-COST-GR (4)
     3 #SGLI-RET-RESV-COST (N3.2/11)
/*
 1 #VGLI-COST-PER-1K-B4-1-9-93
   2 #VC-29 (N1.3)
     INIT<0.120>
   2 #VC-30 (N1.3)
     INIT<0.200>
   2 #VC-35 (N1.3)
     INIT<0.340>
   2 #VC-45 (N1.3)
     INIT<0.420>
   2 #VC-50 (N1.3)
     INIT<0.520>
   2 #VC-60 (N1.3)
     INIT<0.750>
/*
 1 REDEFINE #VGLI-COST-PER-1K-B4-1-9-93 /* REDEF. BEGIN : #VGLI-COST-PER
   2 #VGLI-CST-PER-1K-B4-1-9-93 (N1.3/6)
/*
 1 #VGLI-COST-PER-1K-EFF-1-9-93
   2 #VC-29 (N1.3)
     INIT<0.120>
   2 #VC-30 (N1.3)
     INIT<0.200>
   2 #VC-35 (N1.3)
     INIT<0.260>
   2 #VC-40 (N1.3)
     INIT<0.340>
   2 #VC-45 (N1.3)
     INIT<0.440>
   2 #VC-50 (N1.3)
     INIT<0.650>
   2 #VC-55 (N1.3)
     INIT<0.880>
   2 #VC-60 (N1.3)
     INIT<1.125>
   2 #VC-65 (N1.3)
     INIT<1.500>
   2 #VC-70 (N1.3)
     INIT<2.250>
   2 #VC-75 (N1.3)
     INIT<4.500>
/*
 1 REDEFINE #VGLI-COST-PER-1K-EFF-1-9-93 /* REDEF. BEGIN : #VGLI-COST-PER
   2 #VGLI-CST-PER-1K-EFF-1-9-93 (N1.3/11)
/*                                       below are 1993 rates
 1 #VGLI-CST
   2 #VC-29-10K-93 (N3.2)
     INIT<001.20>
   2 #VC-29-50K-93 (N3.2)
     INIT<006.00>
   2 #VC-29-100K-93 (N3.2)
     INIT<012.00>
   2 #VC-29-150K-93 (N3.2)
     INIT<018.00>
   2 #VC-29-200K-93 (N3.2)
     INIT<024.00>
   2 #VC-30-10K-93 (N3.2)
     INIT<002.00>
   2 #VC-30-50K-93 (N3.2)
     INIT<010.00>
   2 #VC-30-100K-93 (N3.2)
     INIT<020.00>
   2 #VC-30-150K-93 (N3.2)
     INIT<030.00>
   2 #VC-30-200K-93 (N3.2)
     INIT<040.00>
   2 #VC-35-10K-93 (N3.2)
     INIT<002.60>
   2 #VC-35-50K-93 (N3.2)
     INIT<013.00>
   2 #VC-35-100K-93 (N3.2)
     INIT<026.00>
   2 #VC-35-150K-93 (N3.2)
     INIT<039.00>
   2 #VC-35-200K-93 (N3.2)
     INIT<052.00>
   2 #VC-40-10K-93 (N3.2)
     INIT<003.40>
   2 #VC-40-50K-93 (N3.2)
     INIT<017.00>
   2 #VC-40-100K-93 (N3.2)
     INIT<034.00>
   2 #VC-40-150K-93 (N3.2)
     INIT<051.00>
   2 #VC-40-200K-93 (N3.2)
     INIT<068.00>
   2 #VC-45-10K-93 (N3.2)
     INIT<004.40>
   2 #VC-45-50K-93 (N3.2)
     INIT<022.00>
   2 #VC-45-100K-93 (N3.2)
     INIT<044.00>
   2 #VC-45-150K-93 (N3.2)
     INIT<066.00>
   2 #VC-45-200K-93 (N3.2)
     INIT<088.00>
   2 #VC-50-10K-93 (N3.2)
     INIT<006.50>
   2 #VC-50-50K-93 (N3.2)
     INIT<032.50>
   2 #VC-50-100K-93 (N3.2)
     INIT<065.00>
   2 #VC-50-150K-93 (N3.2)
     INIT<097.50>
   2 #VC-50-200K-93 (N3.2)
     INIT<130.00>
   2 #VC-55-10K-93 (N3.2)
     INIT<008.80>
   2 #VC-55-50K-93 (N3.2)
     INIT<044.00>
   2 #VC-55-100K-93 (N3.2)
     INIT<088.00>
   2 #VC-55-150K-93 (N3.2)
     INIT<132.00>
   2 #VC-55-200K-93 (N3.2)
     INIT<176.00>
   2 #VC-60-10K-93 (N3.2)
     INIT<011.25>
   2 #VC-60-50K-93 (N3.2)
     INIT<056.25>
   2 #VC-60-100K-93 (N3.2)
     INIT<112.50>
   2 #VC-60-150K-93 (N3.2)
     INIT<168.75>
   2 #VC-60-200K-93 (N3.2)
     INIT<225.00>
   2 #VC-65-10K-93 (N3.2)
     INIT<015.00>
   2 #VC-65-50K-93 (N3.2)
     INIT<075.00>
   2 #VC-65-100K-93 (N3.2)
     INIT<150.00>
   2 #VC-65-150K-93 (N3.2)
     INIT<225.00>
   2 #VC-65-200K-93 (N3.2)
     INIT<300.00>
   2 #VC-70-10K-93 (N3.2)
     INIT<022.50>
   2 #VC-70-50K-93 (N3.2)
     INIT<112.50>
   2 #VC-70-100K-93 (N3.2)
     INIT<225.00>
   2 #VC-70-150K-93 (N3.2)
     INIT<337.50>
   2 #VC-70-200K-93 (N3.2)
     INIT<450.00>
   2 #VC-75-10K-93 (N3.2)
     INIT<045.00>
   2 #VC-75-50K-93 (N3.2)
     INIT<225.50>
   2 #VC-75-100K-93 (N3.2)
     INIT<450.00>
   2 #VC-75-150K-93 (N3.2)
     INIT<675.00>
   2 #VC-75-200K-93 (N3.2)
     INIT<900.00>
/*
 1 REDEFINE #VGLI-CST /* REDEF. BEGIN : #VGLI-CST
   2 #VGLI-COST-GR (11)
     3 #VGLI-COST (N3.2/5)
/*
 1 #VGLI-COST-PER-1K-EFF-4-1-1999
   2 #VC-29 (N1.3)
     INIT<0.080>
   2 #VC-30 (N1.3)
     INIT<0.120>
   2 #VC-35 (N1.3)
     INIT<0.160>
   2 #VC-40 (N1.3)
     INIT<0.240>
   2 #VC-45 (N1.3)
     INIT<0.420>
   2 #VC-50 (N1.3)
     INIT<0.650>
   2 #VC-55 (N1.3)
     INIT<0.880>
   2 #VC-60 (N1.3)
     INIT<1.125>
   2 #VC-65 (N1.3)
     INIT<1.500>
   2 #VC-70 (N1.3)
     INIT<2.250>
   2 #VC-75 (N1.3)
     INIT<4.500>
/*
 1 REDEFINE #VGLI-COST-PER-1K-EFF-4-1-1999 /* REDEF. BEGIN : #VGLI-COST-PER
   2 #VGLI-CST-PER-1K-EFF-4-1-1999 (N1.3/11)
/*
 1 #VGLI-CST-EFF-4-1-1999
   2 #VC-29-50K-99 (N4.2)
     INIT<004.00>
   2 #VC-29-100K-99 (N4.2)
     INIT<008.00>
   2 #VC-29-150K-99 (N4.2)
     INIT<012.00>
   2 #VC-29-200K-99 (N4.2)
     INIT<016.00>
   2 #VC-29-250K-99 (N4.2)
     INIT<020.00>
   2 #VC-30-50K-99 (N4.2)
     INIT<006.00>
   2 #VC-30-100K-99 (N4.2)
     INIT<012.00>
   2 #VC-30-150K-99 (N4.2)
     INIT<018.00>
   2 #VC-30-200K-99 (N4.2)
     INIT<024.00>
   2 #VC-30-250K-99 (N4.2)
     INIT<030.00>
   2 #VC-35-50K-99 (N4.2)
     INIT<008.00>
   2 #VC-35-100K-99 (N4.2)
     INIT<016.00>
   2 #VC-35-150K-99 (N4.2)
     INIT<024.00>
   2 #VC-35-200K-99 (N4.2)
     INIT<032.00>
   2 #VC-35-250K-99 (N4.2)
     INIT<040.00>
   2 #VC-40-50K-99 (N4.2)
     INIT<012.00>
   2 #VC-40-100K-99 (N4.2)
     INIT<024.00>
   2 #VC-40-150K-99 (N4.2)
     INIT<036.00>
   2 #VC-40-200K-99 (N4.2)
     INIT<048.00>
   2 #VC-40-250K-99 (N4.2)
     INIT<060.00>
   2 #VC-45-50K-99 (N4.2)
     INIT<021.00>
   2 #VC-45-100K-99 (N4.2)
     INIT<042.00>
   2 #VC-45-150K-99 (N4.2)
     INIT<063.00>
   2 #VC-45-200K-99 (N4.2)
     INIT<084.00>
   2 #VC-45-250K-99 (N4.2)
     INIT<105.00>
   2 #VC-50-50K-99 (N4.2)
     INIT<032.50>
   2 #VC-50-100K-99 (N4.2)
     INIT<065.00>
   2 #VC-50-150K-99 (N4.2)
     INIT<097.50>
   2 #VC-50-200K-99 (N4.2)
     INIT<130.00>
   2 #VC-50-250K-99 (N4.2)
     INIT<162.00>
   2 #VC-55-50K-99 (N4.2)
     INIT<044.00>
   2 #VC-55-100K-99 (N4.2)
     INIT<088.00>
   2 #VC-55-150K-99 (N4.2)
     INIT<132.00>
   2 #VC-55-200K-99 (N4.2)
     INIT<176.00>
   2 #VC-55-250K-99 (N4.2)
     INIT<220.00>
   2 #VC-60-50K-99 (N4.2)
     INIT<056.25>
   2 #VC-60-100K-99 (N4.2)
     INIT<112.50>
   2 #VC-60-150K-99 (N4.2)
     INIT<168.75>
   2 #VC-60-200K-99 (N4.2)
     INIT<225.00>
   2 #VC-60-250K-99 (N4.2)
     INIT<281.25>
   2 #VC-65-50K-99 (N4.2)
     INIT<075.00>
   2 #VC-65-100K-99 (N4.2)
     INIT<150.00>
   2 #VC-65-150K-99 (N4.2)
     INIT<225.00>
   2 #VC-65-200K-99 (N4.2)
     INIT<300.00>
   2 #VC-65-250K-99 (N4.2)
     INIT<375.00>
   2 #VC-70-50K-99 (N4.2)
     INIT<112.50>
   2 #VC-70-100K-99 (N4.2)
     INIT<225.00>
   2 #VC-70-150K-99 (N4.2)
     INIT<337.50>
   2 #VC-70-200K-99 (N4.2)
     INIT<450.00>
   2 #VC-70-250K-99 (N4.2)
     INIT<562.50>
   2 #VC-75-50K-99 (N4.2)
     INIT<225.50>
   2 #VC-75-100K-99 (N4.2)
     INIT<450.00>
   2 #VC-75-150K-99 (N4.2)
     INIT<675.00>
   2 #VC-75-200K-99 (N4.2)
     INIT<900.00>
   2 #VC-75-250K-99 (N4.2)
     INIT<1125.50>
/*
 1 REDEFINE #VGLI-CST-EFF-4-1-1999 /* REDEF. BEGIN : #VGLI-CST-EFF-
   2 #VGLI-COST-GR-4-1-1999 (11)
     3 #VGLI-COST-EFF-4-1-1999 (N4.2/5)
/*
 1 #VGLI-COST-PER-1K-EFF-7-1-2001
   2 #VC-29 (N1.3)
     INIT<0.080>
   2 #VC-30 (N1.3)
     INIT<0.110>
   2 #VC-35 (N1.3)
     INIT<0.140>
   2 #VC-40 (N1.3)
     INIT<0.220>
   2 #VC-45 (N1.3)
     INIT<0.320>
   2 #VC-50 (N1.3)
     INIT<0.520>
   2 #VC-55 (N1.3)
     INIT<0.840>
   2 #VC-60 (N1.3)
     INIT<1.125>
   2 #VC-65 (N1.3)
     INIT<1.500>
   2 #VC-70 (N1.3)
     INIT<2.250>
   2 #VC-75 (N1.3)
     INIT<4.500>
/*
 1 REDEFINE #VGLI-COST-PER-1K-EFF-7-1-2001 /* REDEF. BEGIN : #VGLI-COST-PER
   2 #VGLI-CST-PER-1K-EFF-7-1-2001 (N1.3/11)
/*
 1 #VGLI-CST-EFF-7-1-2001
   2 #VC-29-50K-99 (N4.2)
     INIT<004.00>
   2 #VC-29-100K-99 (N4.2)
     INIT<008.00>
   2 #VC-29-150K-99 (N4.2)
     INIT<012.00>
   2 #VC-29-200K-99 (N4.2)
     INIT<016.00>
   2 #VC-29-250K-99 (N4.2)
     INIT<020.00>
   2 #VC-30-50K-99 (N4.2)
     INIT<005.50>
   2 #VC-30-100K-99 (N4.2)
     INIT<011.00>
   2 #VC-30-150K-99 (N4.2)
     INIT<016.50>
   2 #VC-30-200K-99 (N4.2)
     INIT<022.00>
   2 #VC-30-250K-99 (N4.2)
     INIT<027.50>
   2 #VC-35-50K-99 (N4.2)
     INIT<007.00>
   2 #VC-35-100K-99 (N4.2)
     INIT<014.00>
   2 #VC-35-150K-99 (N4.2)
     INIT<021.00>
   2 #VC-35-200K-99 (N4.2)
     INIT<028.00>
   2 #VC-35-250K-99 (N4.2)
     INIT<035.00>
   2 #VC-40-50K-99 (N4.2)
     INIT<011.00>
   2 #VC-40-100K-99 (N4.2)
     INIT<022.00>
   2 #VC-40-150K-99 (N4.2)
     INIT<033.00>
   2 #VC-40-200K-99 (N4.2)
     INIT<044.00>
   2 #VC-40-250K-99 (N4.2)
     INIT<055.00>
   2 #VC-45-50K-99 (N4.2)
     INIT<016.00>
   2 #VC-45-100K-99 (N4.2)
     INIT<032.00>
   2 #VC-45-150K-99 (N4.2)
     INIT<048.00>
   2 #VC-45-200K-99 (N4.2)
     INIT<064.00>
   2 #VC-45-250K-99 (N4.2)
     INIT<080.00>
   2 #VC-50-50K-99 (N4.2)
     INIT<026.00>
   2 #VC-50-100K-99 (N4.2)
     INIT<052.00>
   2 #VC-50-150K-99 (N4.2)
     INIT<078.00>
   2 #VC-50-200K-99 (N4.2)
     INIT<104.00>
   2 #VC-50-250K-99 (N4.2)
     INIT<130.50>
   2 #VC-55-50K-99 (N4.2)
     INIT<042.00>
   2 #VC-55-100K-99 (N4.2)
     INIT<084.00>
   2 #VC-55-150K-99 (N4.2)
     INIT<126.00>
   2 #VC-55-200K-99 (N4.2)
     INIT<168.00>
   2 #VC-55-250K-99 (N4.2)
     INIT<210.00>
   2 #VC-60-50K-99 (N4.2)
     INIT<056.25>
   2 #VC-60-100K-99 (N4.2)
     INIT<112.50>
   2 #VC-60-150K-99 (N4.2)
     INIT<168.75>
   2 #VC-60-200K-99 (N4.2)
     INIT<225.00>
   2 #VC-60-250K-99 (N4.2)
     INIT<281.25>
   2 #VC-65-50K-99 (N4.2)
     INIT<075.00>
   2 #VC-65-100K-99 (N4.2)
     INIT<150.00>
   2 #VC-65-150K-99 (N4.2)
     INIT<225.00>
   2 #VC-65-200K-99 (N4.2)
     INIT<300.00>
   2 #VC-65-250K-99 (N4.2)
     INIT<375.00>
   2 #VC-70-50K-99 (N4.2)
     INIT<112.50>
   2 #VC-70-100K-99 (N4.2)
     INIT<225.00>
   2 #VC-70-150K-99 (N4.2)
     INIT<337.50>
   2 #VC-70-200K-99 (N4.2)
     INIT<450.00>
   2 #VC-70-250K-99 (N4.2)
     INIT<562.50>
   2 #VC-75-50K-99 (N4.2)
     INIT<225.50>
   2 #VC-75-100K-99 (N4.2)
     INIT<450.00>
   2 #VC-75-150K-99 (N4.2)
     INIT<675.00>
   2 #VC-75-200K-99 (N4.2)
     INIT<900.00>
   2 #VC-75-250K-99 (N4.2)
     INIT<1125.50>
/*
 1 REDEFINE #VGLI-CST-EFF-7-1-2001 /* REDEF. BEGIN : #VGLI-CST-EFF-
   2 #VGLI-COST-GR-7-1-2001 (11)
     3 #VGLI-COST-EFF-7-1-2001 (N4.2/5)
/*
 1 #VGLI-COST-PER-1K-EFF-10-1-2002
   2 #VC-29 (N1.3)
     INIT<0.080>
   2 #VC-30 (N1.3)
     INIT<0.110>
   2 #VC-35 (N1.3)
     INIT<0.140>
   2 #VC-40 (N1.3)
     INIT<0.190>
   2 #VC-45 (N1.3)
     INIT<0.250>
   2 #VC-50 (N1.3)
     INIT<0.400>
   2 #VC-55 (N1.3)
     INIT<0.700>
   2 #VC-60 (N1.3)
     INIT<1.125>
   2 #VC-65 (N1.3)
     INIT<1.500>
   2 #VC-70 (N1.3)
     INIT<2.250>
   2 #VC-75 (N1.3)
     INIT<4.500>
/*
 1 REDEFINE #VGLI-COST-PER-1K-EFF-10-1-2002 /* REDEF. BEGIN : #VGLI-COST-PER
   2 #VGLI-CST-PER-1K-EFF-10-1-2002 (N1.3/11)
/*
 1 #VGLI-CST-EFF-10-1-2002
   2 #VC-29-50K-99 (N4.2)
     INIT<004.00>
   2 #VC-29-100K-99 (N4.2)
     INIT<008.00>
   2 #VC-29-200K-99 (N4.2)
     INIT<016.00>
   2 #VC-29-300K-99 (N4.2)
     INIT<024.00>
   2 #VC-29-400K-99 (N4.2)
     INIT<032.00>
   2 #VC-30-50K-99 (N4.2)
     INIT<005.50>
   2 #VC-30-100K-99 (N4.2)
     INIT<011.00>
   2 #VC-30-200K-99 (N4.2)
     INIT<022.00>
   2 #VC-30-300K-99 (N4.2)
     INIT<033.00>
   2 #VC-30-400K-99 (N4.2)
     INIT<044.00>
   2 #VC-35-50K-99 (N4.2)
     INIT<007.00>
   2 #VC-35-100K-99 (N4.2)
     INIT<014.00>
   2 #VC-35-200K-99 (N4.2)
     INIT<028.00>
   2 #VC-35-300K-99 (N4.2)
     INIT<042.00>
   2 #VC-35-400K-99 (N4.2)
     INIT<056.00>
   2 #VC-40-50K-99 (N4.2)
     INIT<009.50>
   2 #VC-40-100K-99 (N4.2)
     INIT<019.00>
   2 #VC-40-200K-99 (N4.2)
     INIT<038.00>
   2 #VC-40-300K-99 (N4.2)
     INIT<057.00>
   2 #VC-40-400K-99 (N4.2)
     INIT<076.00>
   2 #VC-45-50K-99 (N4.2)
     INIT<012.50>
   2 #VC-45-100K-99 (N4.2)
     INIT<025.00>
   2 #VC-45-200K-99 (N4.2)
     INIT<050.00>
   2 #VC-45-300K-99 (N4.2)
     INIT<075.00>
   2 #VC-45-400K-99 (N4.2)
     INIT<100.00>
   2 #VC-50-50K-99 (N4.2)
     INIT<020.00>
   2 #VC-50-100K-99 (N4.2)
     INIT<040.00>
   2 #VC-50-200K-99 (N4.2)
     INIT<080.00>
   2 #VC-50-300K-99 (N4.2)
     INIT<120.00>
   2 #VC-50-400K-99 (N4.2)
     INIT<160.00>
   2 #VC-55-50K-99 (N4.2)
     INIT<035.00>
   2 #VC-55-100K-99 (N4.2)
     INIT<070.00>
   2 #VC-55-200K-99 (N4.2)
     INIT<140.00>
   2 #VC-55-300K-99 (N4.2)
     INIT<210.00>
   2 #VC-55-400K-99 (N4.2)
     INIT<280.00>
   2 #VC-60-50K-99 (N4.2)
     INIT<056.25>
   2 #VC-60-100K-99 (N4.2)
     INIT<112.50>
   2 #VC-60-200K-99 (N4.2)
     INIT<225.00>
   2 #VC-60-300K-99 (N4.2)
     INIT<337.50>
   2 #VC-60-400K-99 (N4.2)
     INIT<450.00>
   2 #VC-65-50K-99 (N4.2)
     INIT<075.00>
   2 #VC-65-100K-99 (N4.2)
     INIT<150.00>
   2 #VC-65-200K-99 (N4.2)
     INIT<300.00>
   2 #VC-65-300K-99 (N4.2)
     INIT<450.00>
   2 #VC-65-400K-99 (N4.2)
     INIT<600.00>
   2 #VC-70-50K-99 (N4.2)
     INIT<112.50>
   2 #VC-70-100K-99 (N4.2)
     INIT<225.00>
   2 #VC-70-200K-99 (N4.2)
     INIT<450.00>
   2 #VC-70-300K-99 (N4.2)
     INIT<675.00>
   2 #VC-70-400K-99 (N4.2)
     INIT<900.00>
   2 #VC-75-50K-99 (N4.2)
     INIT<225.50>
   2 #VC-75-100K-99 (N4.2)
     INIT<450.00>
   2 #VC-75-200K-99 (N4.2)
     INIT<900.00>
   2 #VC-75-300K-99 (N4.2)
     INIT<1350.00>
   2 #VC-75-400K-99 (N4.2)
     INIT<1800.00>
/*
 1 REDEFINE #VGLI-CST-EFF-10-1-2002 /* REDEF. BEGIN : #VGLI-CST-EFF-
   2 #VGLI-COST-GR-10-1-2002 (11)
     3 #VGLI-COST-EFF-10-1-2002 (N4.2/5)
/*
 1 #ORDLIFE (A4)
   CONST<'OL'>
 1 #BASIC (A4)
   CONST<'BASC'>
 1 #P03 (A4)
   CONST<'0-3'>
 1 #P01 (A4)
   CONST<'0-1'>
 1 #SUP1 (A4)
   CONST<'SUP1'>
 1 #SUP2 (A4)
   CONST<'SUP2'>
 1 #SUP3 (A4)
   CONST<'SUP3'>
 1 #SUP4 (A4)
   CONST<'SUP4'>
 1 #P250 (A4)
   CONST<'P250'>
 1 #P200 (A4)
   CONST<'P200'>
 1 #P150 (A4)
   CONST<'P150'>
 1 #MBA-IDX (I1)
 1 #MBA-HOLD-AMTS
   2 #MBA-HOLD-AMT1 (P7)
   2 #MBA-HOLD-AMT2 (P7)
 1 #MBA-TBL-1 /* TABLE A - BASC
   2 #MBA-TBL-1-AMT1 (P7/12) CONST
     (1) <85000>
     (2) <70000>
     (3) <55000>
     (4) <45000>
     (5) <30000>
     (6) <20000>
     (7) <17500>
     (8) <15000>
     (9) <7500>
     (10) <2500>
     (11) <2500>
     (12) <2500>
   2 #MBA-TBL-1-AMT2 (P7/12) CONST
     (1) <100000>
     (2) <80000>
     (3) <65000>
     (4) <55000>
     (5) <40000>
     (6) <25000>
     (7) <15000>
     (8) <10500>
     (9) <6000>
     (10) <3000>
     (11) <3000>
     (12) <3000>
 1 #MBA-TBL-3 (P7/12) CONST /* TABLE C - 0-3(OLD VETN)
   (1) <50000>
   (2) <50000>
   (3) <40000>
   (4) <27500>
   (5) <17500>
   (6) <15000>
   (7) <10000>
   (8) <7500>
   (9) <2500>
   (10) <1500>
   (11) <1500>
   (12) <1500>
 1 #MBA-TBL-4 /* TABLE D - P250
   2 #MBA-TBL-4-AMT1 (P7/12) CONST
     (1) <212500>
     (2) <175000>
     (3) <137500>
     (4) <112500>
     (5) <75000>
     (6) <50000>
     (7) <43750>
     (8) <37500>
     (9) <7500>
     (10) <2500>
     (11) <2500>
     (12) <2500>
   2 #MBA-TBL-4-AMT2 (P7/12) CONST
     (1) <280000>
     (2) <224000>
     (3) <182000>
     (4) <146700>
     (5) <106700>
     (6) <66700>
     (7) <39550>
     (8) <27700>
     (9) <15850>
     (10) <7500>
     (11) <7500>
     (12) <7500>
 1 #MBA-TBL-5 /* TABLE E - P150
   2 #MBA-TBL-5-AMT1 (P7/12) CONST
     (1) <127500>
     (2) <105000>
     (3) <82500>
     (4) <67500>
     (5) <45000>
     (6) <30000>
     (7) <26250>
     (8) <22500>
     (9) <7500>
     (10) <2500>
     (11) <2500>
     (12) <2500>
   2 #MBA-TBL-5-AMT2 (P7/12) CONST
     (1) <160000>
     (2) <128000>
     (3) <104000>
     (4) <85600>
     (5) <62250>
     (6) <38900>
     (7) <23200>
     (8) <16250>
     (9) <9300>
     (10) <4500>
     (11) <4500>
     (12) <4500>
 1 #MBA-TBL-6 /* TABLE F - P200
   2 #MBA-TBL-6-AMT1 (P7/12) CONST
     (1) <170000>
     (2) <140000>
     (3) <110000>
     (4) <90000>
     (5) <60000>
     (6) <40000>
     (7) <35000>
     (8) <30000>
     (9) <7500>
     (10) <2500>
     (11) <2500>
     (12) <2500>
   2 #MBA-TBL-6-AMT2 (P7/12) CONST
     (1) <220000>
     (2) <176000>
     (3) <143000>
     (4) <116150>
     (5) <84450>
     (6) <52800>
     (7) <31400>
     (8) <21950>
     (9) <12550>
     (10) <6000>
     (11) <6000>
     (12) <6000>
 1 #MBA-TBL-7 (P7/3) CONST /* TABLE G - P01
   (1) <10000>
   (2) <7500>
   (3) <5000>
 1 #AFR-PCT (P1.2) /* 00%
   CONST<0.0>
 1 #AFR-IDX (I1)
 1 #AFR-TBL-1 /* TABLE A FOR AFRBA-ACTIVE DUTY
   2 #AFR-TBL-1-BASIC (P7/11) CONST
     (1) <60000>
     (2) <60000>
     (3) <60000>
     (4) <60000>
     (5) <60000>
     (6) <60000>
     (7) <60000>
     (8) <60000>
     (9) <60000>
     (10) <60000>
     (11) <60000>
   2 #AFR-TBL-1-SUPP1 (P7/11) CONST
     (1) <160000>
     (2) <140000>
     (3) <110000>
     (4) <97500>
     (5) <85000>
     (6) <77000>
     (7) <72000>
     (8) <68500>
     (9) <67000>
     (10) <63500>
     (11) <61500>
   2 #AFR-TBL-1-SUPP2 (P7/11) CONST
     (1) <260000>
     (2) <220000>
     (3) <160000>
     (4) <135000>
     (5) <110000>
     (6) <94000>
     (7) <84000>
     (8) <77000>
     (9) <74000>
     (10) <67000>
     (11) <63000>
   2 #AFR-TBL-1-SUPP3 (P7/11) CONST
     (1) <360000>
     (2) <300000>
     (3) <210000>
     (4) <172500>
     (5) <135000>
     (6) <111000>
     (7) <96000>
     (8) <85500>
     (9) <81000>
     (10) <70500>
     (11) <64500>
   2 #AFR-TBL-1-SUPP4 (P7/11) CONST
     (1) <460000>
     (2) <380000>
     (3) <260000>
     (4) <210000>
     (5) <160000>
     (6) <128000>
     (7) <108000>
     (8) <94000>
     (9) <88000>
     (10) <74000>
     (11) <66000>
   2 #AFR-TBL-1-SUPP5 (P7/11) CONST
     (1) <560000>
     (2) <460000>
     (3) <310000>
     (4) <247500>
     (5) <185000>
     (6) <145000>
     (7) <120000>
     (8) <102500>
     (9) <95000>
     (10) <77500>
     (11) <67500>
 1 #AFR-TBL-2 /* TABLE B FOR AFRBA-RETIRED
   2 #AFR-TBL-2-BASIC (P7/11) CONST
     (1) <60000>
     (2) <60000>
     (3) <60000>
     (4) <50000>
     (5) <45000>
     (6) <35000>
     (7) <21000>
     (8) <15000>
     (9) <10000>
     (10) <5000>
     (11) <2000>
   2 #AFR-TBL-2-SUPP1 (P7/11) CONST
     (1) <160000>
     (2) <140000>
     (3) <110000>
     (4) <87500>
     (5) <70000>
     (6) <52000>
     (7) <33000>
     (8) <23500>
     (9) <17000>
     (10) <8500>
     (11) <3500>
   2 #AFR-TBL-2-SUPP2 (P7/11) CONST
     (1) <260000>
     (2) <220000>
     (3) <160000>
     (4) <125000>
     (5) <95000>
     (6) <69000>
     (7) <45000>
     (8) <32000>
     (9) <24000>
     (10) <12000>
     (11) <5000>
   2 #AFR-TBL-2-SUPP3 (P7/11) CONST
     (1) <360000>
     (2) <300000>
     (3) <210000>
     (4) <162500>
     (5) <120000>
     (6) <86000>
     (7) <57000>
     (8) <40500>
     (9) <31000>
     (10) <15500>
     (11) <6500>
   2 #AFR-TBL-2-SUPP4 (P7/11) CONST
     (1) <460000>
     (2) <380000>
     (3) <260000>
     (4) <200000>
     (5) <145000>
     (6) <103000>
     (7) <69000>
     (8) <49000>
     (9) <38000>
     (10) <19000>
     (11) <8000>
   2 #AFR-TBL-2-SUPP5 (P7/11) CONST
     (1) <460000>
     (2) <460000>
     (3) <310000>
     (4) <237500>
     (5) <170000>
     (6) <120000>
     (7) <81000>
     (8) <57500>
     (9) <45000>
     (10) <22500>
     (11) <9500>
END-DEFINE
