* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION FUNCTION-CLERK-AD RETURNS (A) DYNAMIC
  DEFINE DATA
PARAMETER  
1 #USER-ID (A8)
LOCAL USING OBJLUSER
END-DEFINE
*
#USER-ID := *TRANSLATE(#USER-ID,UPPER)
FIND (1) USER-V WITH TERMINAL-ID = #USER-ID
 FUNCTION-CLERK-AD := USER-V.ACTIVE-DIRECTORY-ID
END-FIND 
END-FUNCTION
END
