* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION FUNCTION-CC-NUMBER RETURNS (A16) 
DEFINE DATA
PARAMETER
1 #ID-NUMBER     (N6)  
*
LOCAL USING OBJLCC01
*
END-DEFINE
*
FIND CC-INFO-V WITH ID-NUMBER = #ID-NUMBER
  WHERE CC-DEFAULT-IND = 'Y'
  IF NO RECORDS FOUND 
     FUNCTION-CC-NUMBER := ' '
  END-NOREC
  FUNCTION-CC-NUMBER := CC-NUMBER
END-FIND
END-FUNCTION
END
