* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION FUNCTION-CLERK-N RETURNS (A) DYNAMIC   
DEFINE DATA
PARAMETER  
1 #USER-ID (A8)
LOCAL USING OBJLUSER
END-DEFINE
*
FIND (1) USER-V WITH TERMINAL-ID = #USER-ID
 FUNCTION-CLERK-N := USER-V.COMMENTS
END-FIND 
END-FUNCTION
END
