* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION F-GET-CN RETURNS (N6)
DEFINE DATA
PARAMETER
1 #CONTACT-ID (N8)
LOCAL
1 CT-V VIEW OF A-CONTACTS
  2 ID-NUMBER
  2 CONTACT-ID
END-DEFINE
*
FIND(1) CT-V WITH CONTACT-ID = #CONTACT-ID
  F-GET-CN := ID-NUMBER
END-FIND
*
END-FUNCTION
*
END
