* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION F-GET-VALUE RETURNS (A) DYNAMIC
DEFINE DATA
PARAMETER
1 #LOOK-UP-KEY   (A7)
LOCAL USING OBJLGENT
END-DEFINE
*
FIND GEN-TABLE-V WITH SEC-KEY = #LOOK-UP-KEY
  IF NO RECORDS FOUND
    RESET F-GET-VALUE
    ESCAPE BOTTOM
  END-NOREC
  F-GET-VALUE := GEN-DESCRIPTION
  ESCAPE ROUTINE
END-FIND
*
END-FUNCTION
END
