* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION F-GET-MIL-BRANCH RETURNS (A) DYNAMIC
  DEFINE DATA
  PARAMETER
  1 #RANK-ID        (N6)
* LOCAL USING OBJLRANK
  LOCAL
  1 RANK-REF-V VIEW OF A-RANK-REFERENCE
    2 MILITARY-BRANCH
  END-DEFINE
*
RESET F-GET-MIL-BRANCH
FIND(1) RANK-REF-V WITH RANK-ID = #RANK-ID
  F-GET-MIL-BRANCH := MILITARY-BRANCH
END-FIND
*
END-FUNCTION
END
