* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION F-PAY-GRADE RETURNS (A) DYNAMIC
DEFINE DATA
PARAMETER
1 #RANK-ID       (N6)
* 
LOCAL
1 RANK-V VIEW OF A-RANK-REFERENCE 
  2 RANK-ID
  2 PAY-GRADE
END-DEFINE
*
FIND(1) RANK-V WITH RANK-ID = #RANK-ID
  IF NO RECORDS FOUND
    RESET F-PAY-GRADE
    ESCAPE ROUTINE
  END-NOREC
  F-PAY-GRADE := RANK-V.PAY-GRADE
END-FIND
END-FUNCTION
END
