* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION F-ROLE RETURNS (A) DYNAMIC
DEFINE DATA
PARAMETER
1 #LOOK-UP-KEY   (A7)
LOCAL USING OBJLGENT
LOCAL
1 #SEC-KEY      (A7)
END-DEFINE
*
FIND GEN-TABLE-V WITH SEC-KEY = #LOOK-UP-KEY
  IF NO RECORDS FOUND
    RESET F-ROLE
    ESCAPE BOTTOM
  END-NOREC
  F-ROLE := GEN-ALPHA-VALUE
  ESCAPE ROUTINE
END-FIND
*
END-FUNCTION
END
