* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION FUNCTION-USER-COMPANY RETURNS (A1) BY VALUE
*
DEFINE DATA
PARAMETER
1 #CLERK         (A3)
*
LOCAL
1 TM-V VIEW OF A-TERMINALS
 2 USER-COMPANY
*
END-DEFINE
*
FIND (1) TM-V WITH CLERK-ID = #CLERK
  MOVE TM-V.USER-COMPANY TO FUNCTION-USER-COMPANY
END-FIND
*
END-FUNCTION
*
END
