* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: FIXINSVL
*  THIS PROGRAM FIXS VARIOUS INSURANCE AMOUNTS
DEFINE DATA
LOCAL
1 STAT-V VIEW OF A-STATUS
  2 ID-NUMBER  (N6.0)
  2 DEBIT-CREDIT-AMT
  2 MODE (A1/1:5)
1 #NUMBER-WITH-AMT            (N8)
1 #NUMBER-WITH-ZERO           (N8)
1 #I    (I1)
END-DEFINE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
READ STAT-V LOGICAL BY MEMBER-KEY
*
PERFORM FIND-MODE
*
END-READ
WRITE 'NUMBER WITH ZERO--' #NUMBER-WITH-ZERO
WRITE 'NUMBER WITH AMT --' #NUMBER-WITH-AMT
DEFINE SUBROUTINE FIND-MODE
FOR #I 1 TO 5
   IF STAT-V.MODE(#I) = 'A' OR = 'Q' OR = 'S' OR = 'M'
     IF STAT-V.DEBIT-CREDIT-AMT = 0
          ADD 1 TO #NUMBER-WITH-ZERO
       ELSE
          ADD 1 TO #NUMBER-WITH-AMT
      END-IF
    ESCAPE ROUTINE
  END-IF
END-FOR
END-SUBROUTINE
*
END
