* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* G10-9TST bz 02-03-2017 
* Verify If CN has links for 9+ policies

DEFINE DATA
PARAMETER
1 #CGA-SCR-ID         (N9) BY VALUE
LOCAL
1 O9-V VIEW OF OVER-9-LINKS
  2 PRIME-CN         (N6) (EM=ZZZZZ9)
  2 C*SECONDARY-CN   (N2) 
  2 SECONDARY-CN     (N6/10)(EM=ZZZZZZ)
1 #i                 (I2)
1 v_CN               (N6)
1 ST-V VIEW OF A-STATUS
  2 ID-NUMBER
END-DEFINE
 FORMAT PS=23
 IF #CGA-SCR-ID > 999999
    FIND(1) ST-V WITH SSN = #CGA-SCR-ID
       v_CN := ID-NUMBER
    END-FIND       
 ELSE
   v_CN := #CGA-SCR-ID
 END-IF
 IF v_CN = 0 ESCAPE ROUTINE END-IF 
 FIND(1) O9-V WITH PRIME-CN = v_CN OR SECONDARY-CN = v_CN
 
  INPUT (IP=OFF AD=IO)
    04/5 '-'(27) 'ATTENTION' '-'(27) 
    05/5 '|' 69T '|'
    06/5 '|' 2x 'Special Handing. This member has' C*SECONDARY-CN(EM=Z9) 'Secondary CN numbers' 69T '|'
    07/5 '|' 2x 'for billing purposes!'                                          69T '|'
    08/5 '|' 69T '|'
    09/5 '|' 2x 'The primary (main) member number is:' PRIME-CN(AD=I)            69T '|'
    10/5 '|' 69T '|'
    11/5 '|' 2x 'The secondary numbers are :'
                 SECONDARY-CN(1) SECONDARY-CN(2) SECONDARY-CN(3) SECONDARY-CN(4) 69T '|'
    12/5 '|' 30x SECONDARY-CN(5) SECONDARY-CN(6) SECONDARY-CN(7) SECONDARY-CN(8) 69T '|'
    13/5 '|' 69T '|'
    14/5 '|' 4x 'Please remember to check all cn numbers when'                   69T '|'
    15/5 '|' 4x 'creating correspondence or issuing policies.'                   69T '|'
    16/5 '|' 4x 'The system will not automatically check both numbers'           69T '|'
    17/5 '|' 69T '|'
    18/5 '-'(27) 'ATTENTION' '-'(27) 
 END-FIND
END
