DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-1099
  2 #POLICY-NUMBER (A16)
  2 #INSURED-CONTACT-ID (N8)
  2 #OWNER-CONTACT-ID (N8)
  2 #RELATED-ID-NUMBER (N6.0)
  2 #INDEX (I2)
  2 #TYPE-1099 (A1)
  2 #INT-TYPE (A1)
  2 #AMOUNT (P9.2)
  2 #GROSS-AMOUNT (P9.2)
  2 #OWNER-SSN (N9)
END-DEFINE
