DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode R
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 CM-V VIEW OF A-COMMANDS
  2 COMMAND (A2)
  2 SECURITY-CODE (N2.0)
  2 TYPE-OF-INPUT (A1)
END-DEFINE
