* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 5
* <Natural Source Header
* PGM-ID: G3511PAD     ** FETCHED FROM G3500PAD
*
*************************************************************************
*                       MODIFICATION LOG                                *
* USER   DATE      TAG   REASON                                         *
*                                                                       *
* PAM    11092004  PM1   Indicate whether allotment changes are         *
*                        needed.                                        *
* PAM    03112005  PM2   Reset display fields for GRANKSXX              *
* DRW    03312005  DW3   Replace 'prepared by line'                     *
* PAM    06022006  PM4   Added 3rd copy of payoff refund letter         *
*                        Adjusted text of payoff refund letter          *
* YAK    01262006  YAK   Added NEWPAGE(8) to CLP letter                 *
* DRW    06082007  DW5   Added Text if member has authorized ALOT chges *
* PAM    07252007  PM6   Adjust CLP letters to policy level             *
* DRW    09272007  DW2   Delete AFSC Suffix's (DOP/RDT/TLL)             *
* YAK    12052007  YK1   Remove hardcording for interest rates          *
*                        (Read GEN-TABLE through OBJNGENT)              *
* YAK    02052008  YK2   Change code to use FUNCTION-INT-RATE           *
*                         to get rate from GEN-TABLE                    *
* DRW 06/06/2008 DW3 Add ALOT-CHG-AUTH "A" checking                     *
* YAK    02052008  YK3    Change test for CAP Pay-off letters by Policy *
*                         Services request                              *
* RSE    12102009  RE1   Don added back routines for RDT and TTL        *
*                        sometime in September 2009 for unification     *
*                        purposes.                                      *
* NGG    23062010  NG1   Migration transition                           *
* RSE    07162010  RE2   Get Formated Name from Contacts file           *
* PAM  08/23/2010  PM7   Added expanded addersses and new storage area  *
* PAM  10/21/2010  PM8   Adjusted extensions for department move        *
* vxt  11/12/2010  vt1   Change the name and rank source                *
* vxt  08/14/2011  vt2   fix the address and name for non-ins member    *
*                        for LPO-process in batch.                       *
* bz  06/09/2013  Rebranding (Search for AAFMAA) and text changes
* vxt 12/06/2013  vt3    Fix the 0937 error
* TMT 10/13/2015  TT1    Fixed 1106 error
* bz-Name-C 07/07/2017     Fine Names. Keep all capital    
*************************************************************************
*
DEFINE DATA
GLOBAL USING BCOMMGXX WITH MASTER-BLOCK.CI-BLOCK
LOCAL USING GONERLXX     /* WORK FIELDS FOR GONERCXX - ERROR ROUTINE
LOCAL USING ATHLCAPP                                                  /* PM6
LOCAL USING A-CTDATA     /* RE2
LOCAL USING ADDA0001       /* PDA for the Address    vt2
LOCAL
*
1 #LEFT   (A) DYNAMIC    /* PM7
1 #RIGHT  (A) DYNAMIC    /* PM7
1 #I      (N2)           /* PM7
1 #RESULT (A70)          /* PM7
*
* 1 #CURR-VAR-INT-RATE (P2.3) INIT <8.10>                             /* YK1
1 #CURR-VAR-INT-RATE (P2.3)
1 #INT-RT     (A6)  /* XX.XX%
1 ST-V VIEW OF A-STATUS
  2 ID-NUMBER
  2 MEMBER-CONTACT-ID      (N8)      /* RE2
  2 PROCESS-IND
  2 ALOT-CHG-AUTH
  2 ISSUE-DATE             (9)
  2 MODE                   (9)                                         /* PM6
  2 X-LOAN-AMOUNT          (9)
  2 X-INTEREST-RATE        (9)
  2 X-LOAN-AMOUNT-2        (9)
  2 X-LPO-PMT-RCVD         (9)
  2 X-LPO-PRIOR-LOAN-BAL   (9)
  2 X-LPO-PRIOR-ACC-INT    (9)
  2 X-LPO-PMT-RCVD-2       (9)
  2 X-LPO-PRIOR-LOAN-BAL-2 (9)
  2 X-LPO-PRIOR-ACC-INT-2  (9)
*
1 #INT-NEG    (L)
1 #LPO-ISS-DT     (N8/9)
1 #LPO-ISS-DT-SEL (A1/9)
1 #NUM-LPO      (P3)
1 #LPO-X        (I2)
1 #LPO-ISS-DT-DISP (A11)
1 #LPF-LPV      (A1)
1 #POL-NUM      (A16)
1 #PRIN-PMT     (N7.2)
1 #INT-PMT    (N7.2)
1 #CRED-ON-ACCT  (N7.2)
1 #FIX-VAR-LBL  (A8)
1 #ALLOT-CHANGE-A (A3)
1 #ALLOT-CHANGE (L)                                               /* PM1
1 #HOLD-SCR-COMMAND (A2)                                          /* PM1
1 #HOLD-SCR-ID      (N9)                                          /* PM1
1 #LPO-IND          (A3) INIT <'LPO'>                             /* PM6
*
1 FR-V VIEW OF A-FIRS
  2 ID-NUMBER
  2 C*DOCUMENT
*
1 NT-V VIEW OF A-NOTES
  2 NOTE-TEXT   (A60/60)
*
1 #CANCEL    (L)
1 #WORK-AMT    (P7.2)
1 #W-AMT          (A10)
1 #FORM-IND        (A3)  /* PM - 06/2000 - DALLAS PRINT
1 #INT-LEFT     (P7.2)
1 #HOLD-EDIT-INT (A9)
1 #FOUND-LPO  (L)
1 #SCR-SUFFIX     (A3)
1 REDEFINE #SCR-SUFFIX
  2 #SCR-SUFFIX-2  (A2)
  2 #SCR-SUFFIX-3  (A1)
1 #LPOTEXT3 (A24) CONST<'Enclosed is a check for'>
1 #LPOTEXT4 (A24) CONST<'interest refund due you.'>
1 #LPOTEXT5 (A30) CONST<'There is an interest refund of'>
1 #LPOTEXT6 (A08) CONST<'due you.'>
1 #LPOTEXT7 (A43) CONST<'days, this amount will simply be carried as'>
1 #LPOTEXT7A (A37) CONST<'This amount will simply be carried as'>
1 #LPOTEXT8 (A25) CONST<'a credit on your account.'>
1 #LPOTEXT9 (A15) CONST<'Interest due of'>
1 #LPOTEXT10 (A48)
  CONST<'remains. If your check is not received within 30'>
1 #LPOTEXT10A (A8) CONST<'remains.'>
1 #LPOTEXT12 (A24) CONST<'a debit on your account.'>
*
1 #LPO-LINE-A
  2 #FILL-LPO        (A5)
  2 #HEADER          (A32)
  2 #AMOUNT          (A9)
1 REDEFINE #LPO-LINE-A
  2 #LPO-LINE        (A46)
*
1 #WYYMMDD
  2 #XYY      (N2)
  2 #XMM      (N2)
  2 #XDD      (N2)
1 REDEFINE #WYYMMDD
  2 #WYYMMDD-N (N6)
*
1 #RPU-TEXT (A78/16)
1 #TEXT-A   (A52)
1 #LOAN-AMT        (P6.2)
1 #LOAN-AMT-2      (P6.2)
1 #RESTRICT-MBR-SW (A1)
1 #SUSPEND-CODE    (A1)
1 #FIRST/MID       (A25)
1 #SUFFIX          (A25)
1 #EXTRA1          (A25)
1 #EXTRA2          (A25)
1 #HOLD-EDIT-ZIP   (A10)
1 REDEFINE #HOLD-EDIT-ZIP
  2 #HOLD-ZIP-5     (A5)
  2 #HOLD-ZIP2      (A5)
*
1 #S-X     (I2)
1 #ID-NUMBER-A  (A6)
1 #TEXT    (A40/22)
1 #PROC    (A15)
1 #ERROR-MESSAGE (A65)
1 #SCR-ASS-RET-DT (A11)
1 #DATX     (A10)
1 #DATX-ESTATE (A10)
1 #AD-I     (I2)
1 #I2       (I2)
1 #I3       (I2)
1 #SEG-I    (I2)
1 #AD-FF-3  (A78)       1 #AD-FF-4  (A78)
1 #AD-FF-5  (A78)       1 #AD-FF-6  (A78)
1 #AD-ADDR-MSG  (A70/3)                             /* TT1
1 #AD-TABLE (A78/14)                                /* vt3 
1 REDEFINE #AD-TABLE
  2 #AD-FF-12 (A78)       2 #AD-FF-13 (A78)
  2 #AD-FF-14 (A78)       2 #AD-FF-15 (A78)
  2 #AD-FF-16 (A78)       2 #AD-FF-17 (A78)
  2 #AD-FF-18 (A78)       2 #AD-FF-19 (A78)
  2 #AD-FF-20 (A78)       2 #AD-FF-21 (A78)
  2 #AD-FF-22 (A78)       2 #AD-FF-23 (A78)
  2 #AD-FF-24 (A78)
1 REDEFINE #AD-TABLE
  2 #AD-TBL-OCC   (13)
    3 #AD-LAYOUT-1
      4 #AD-LST-30   (A30)
      4 #AD-LST-48   (A48)
    3 REDEFINE #AD-LAYOUT-1
      4 #AD-LST-50   (A50)
      4 #AD-LST-28   (A28)
*
1 #NO-MAILOUT           (L)
1 #FOREIGN-ADDR         (L)
*
1 #ISSUE-DATE (N8)
1 REDEFINE #ISSUE-DATE
  2 #ISS-DT-CENT (A2)
  2 #ISS-DT-YY   (A2)
  2 #ISS-DT-MM   (A2)
  2 #ISS-DT-DD   (A2)
*
1 #MODE  (A1)
1 #PAID-TO-DATE (N8)
1 REDEFINE #PAID-TO-DATE
  2 #PT-YYYY (N4)
  2 #PT-MM   (N2)
  2 REDEFINE #PT-MM
    3 #PT-MM-A (A2)
  2 #PT-DD   (N2)
1 #CLERK-ABB-PASS  (A3)
1 #INVALID   (L)
1 #CLERK-ABB-NAME-PASS (A20)
*
1 #CORR-MSG (A50) CONST<'This correspondence has been prepared for '
  -'you by:'>
*
1 #PREV-YY    (N2)
1 #DAY-LITERALS (A24) INIT <'312831303130313130313031'>
1 REDEFINE #DAY-LITERALS 2 #DAY-LIT (A2/12)
*
1 #MONTH-LITERALS (A48) INIT<'Jan Feb Mar Apr May Jun Jul Aug Sep '
  -'Oct Nov Dec '>
1 REDEFINE #MONTH-LITERALS   2 #MON-LIT (A4/12)
*
1 #F-M-L (A108) INIT<'January  February March    April    May      '
  -'June     July     August   SeptemberOctober  November December '>
1 REDEFINE #F-M-L            2 #F-MON-LIT (A9/12)
*
1 #SCR-MIL-ID              (A6)
1 #SCR-NAME-RET            (A31)
*
1 #SCR-AS-OF-LINE    (A11)
1 REDEFINE #SCR-AS-OF-LINE
  2 #SCR-AS-OF-DAY    (A2)
  2 #SCR-AS-OF-FILL   (A1)
  2 #SCR-AS-OF-MON    (A4)
  2 #SCR-AS-OF-YEAR   (N4)
*
1 #YYYYMMDD   (N8)
1 REDEFINE #YYYYMMDD
  2 #YYYY  (N4)
  2 #MM    (N2)
  2 #DD    (N2)
1 REDEFINE #YYYYMMDD
  2 #YYYY-A (A4)
  2 #MM-A   (A2)
  2 #DD-A   (A2)
*
1 #MON-X      (I2)
1 #W-YYYYMM   (N7)
1 REDEFINE #W-YYYYMM
  2 #W-0CENT  (N3)
  2 #W-YY     (N2)
  2 #W-MM     (N2)
*
1 #LAST-MON   (N8)
1 REDEFINE #LAST-MON
  2 #LAST-MON-YYYY  (N4)
  2 #LAST-MON-MM    (N2)
  2 #LAST-MON-DD    (N2)
*
1 #HOLD-DATE (N8)
1 REDEFINE #HOLD-DATE
  2 #HD-CCYY    (N4)
  2 #HD-MM      (N2)
  2 #HD-DD      (N2)
*
1 #A-X             (I2)
1 #D-X             (I2)
*
1 #FULL-RANK       (A23)
1 #EDIT-INVALID (L)
1 #RANK-LITERAL (A23)
1 #DISPL        (P2)
1 #PASS-COMMAND (A2)   INIT <'AD'>
*
1 #ID-NUM                (N6)
1 REDEFINE #ID-NUM
  2 #ID-NUM-A             (A6)
1 #HOLD-RANK-5           (A5)
1 REDEFINE #HOLD-RANK-5
  2 #HOLD-RANK           (A3)
  2 #HOLD-RANK-LST-2     (A2)
1 #HOLD-NAME             (A70)                                  /* vt1 was 25
1 #HOLD-LAST-NAME        (A25)
1 #HOLD-SSN              (N9)
1 REDEFINE #HOLD-SSN
  2 #SSN-1                (A3)
  2 #SSN-2                (A2)
  2 #SSN-3                (A4)
1 #HOLD-DEBIT-CREDIT-AMT (P7.2)
1 #HOLD-TERM-PREM-REF-DUE (P5.2)
1 #HOLD-TERM-DEBIT-CREDIT (P5.2)
1 #HOLD-ALOT-AMT         (P5.2)
*
1 #EXT-DEAR-FORMATED-NAME    (A70)                                     /* vt1 was 45
1 #FORMATED-NAME-LEFT    (A70)                                     /* vt1 was 45
1 #LAST-NAME             (A25)
1 #EXT-FORMATED-NAME     (A70)                                     /* vt1 was #FORMATED-NAME (A45)
1 #FIRST-ADDRESS         (A70)      /* PM7
1 #SECOND-ADDRESS        (A70)      /* PM7
1 #THIRD-ADDRESS         (A70)      /* PM7
1 #FORMAT-CN-CN          (A9)
1 #MIL-STATUS            (A1)
1 #MIL-SERVICE           (A3)
1 #EDS-ZIP-BAR-CODE      (A14)
1 #NUM-PDUP              (P2)
1 #PASSED-AMT            (P5.2)  /* passed from g3500pad
1 #PASSED-AMT-X          (A8)
1 #ALLOT-NUM             (A5)
1 #DOB-SP     (N8)
1 #DOM        (N8)
1 #DOD        (N8)
1 #SSN-SP     (N9)
1 #WIDOW-FLAG (A1)
1 #NUMBER-MEMBERSHIPS  (P1)
1 #PASSED-DB       (P7.2)
1 #PASSED-LOAN-INT (P7.2)
1 #PASSED-LPO-INT (P5.2)
1 #MEMO-TO-NAME     (A70)                      /* vt1
*
1 #k               (i2)                         /* vt2 \/
1 #non-ins-owner     (l)
1 #multi-owner       (l)
1 #owner-occ-9       (1:9)
  2 #owner-flag      (a1)
  2 #owner-cn        (n6/10)
  2 #OWNER-CN-BY-POL (N6)    /* 1st owners of each set of policies
  2 #OWNER-CN-SEG    (I2/9)  /* all segment of pols owned by above NMO
  2 #ISSUE-DATE-o
    (N8/9)  /* all pols owned by above non-mbr-owner
  2 #ISSUE-DATE-DISP  (A10/9)
*    beneficiary info output
  2 #BN-TYPE         (A1/2)
  2 #BN-TEXT         (A60/10)
1 #p-name            (a) Dynamic
1 stat view of a-status
  2 id-number
  2 member-contact-id
1 #ADDR-MSG          (A70/3)
1 #CN                (a6)
1 #cn-name           (a70)
1 #first-name        (a25)
1 #middle-name       (a25)
1 #last-name-f         (a25)
1 #suffix-f            (a10)
*                                                /* vt2 /\
END-DEFINE
* * * * * * * *
INCLUDE GONERCXX
* - - - - - - -
*
* INPUT #ID-NUM #HOLD-NAME #HOLD-SSN #HOLD-LAST-NAME #HOLD-RANK-5                          /* vt1
INPUT #ID-NUM #HOLD-NAME #HOLD-SSN #HOLD-LAST-NAME  #MEMO-TO-NAME                                     /* vt1
  #HOLD-DEBIT-CREDIT-AMT #HOLD-ALOT-AMT
*  #FORMATED-NAME #FIRST-ADDRESS #SECOND-ADDRESS #THIRD-ADDRESS                          /* vt1
  #EXT-FORMATED-NAME #FIRST-ADDRESS #SECOND-ADDRESS #THIRD-ADDRESS                      /* vt1
  #MIL-STATUS #MIL-SERVICE
  #MODE #PAID-TO-DATE #LOAN-AMT #LOAN-AMT-2
  #RESTRICT-MBR-SW #SUSPEND-CODE
  #EDS-ZIP-BAR-CODE #AD-FF-3 #PASSED-AMT #HOLD-TERM-PREM-REF-DUE
  #HOLD-TERM-DEBIT-CREDIT
  #ISSUE-DATE #EXT-DEAR-FORMATED-NAME #AD-ADDR-MSG (1:3)                             /* vt1
  #DOB-SP #DOM #DOD #SSN-SP #WIDOW-FLAG #NUMBER-MEMBERSHIPS
  #PASSED-DB #PASSED-LOAN-INT #PASSED-LPO-INT
*
* MOVE #FORMATED-NAME TO #FORMATED-NAME-LEFT                                          /* vt1
MOVE #EXT-FORMATED-NAME TO #FORMATED-NAME-LEFT                                        /* vt1
*
MOVE *DATN TO #YYYYMMDD
COMPRESS #MM-A #DD-A #YYYY-A INTO #DATX WITH '/'
MOVE #DATX TO #DATX-ESTATE
MOVE *DATN TO #LAST-MON
SUBTRACT 1 FROM #LAST-MON-MM
IF #LAST-MON-MM LT 1
  ADD 12 TO #LAST-MON-MM
  SUBTRACT 1 FROM #LAST-MON-YYYY
END-IF
*
MOVE #HOLD-RANK-5 TO #FULL-RANK
IF #HOLD-RANK-LST-2 = ' '
  RESET #DISPL #RANK-LITERAL #HOLD-RANK-5                         /* PM2
  CALLNAT 'GRANKSXX' #PASS-COMMAND #HOLD-RANK #MIL-SERVICE
    #EDIT-INVALID #DISPL #RANK-LITERAL #HOLD-RANK-5
  MOVE #RANK-LITERAL TO #FULL-RANK
END-IF
*
#CURR-VAR-INT-RATE := FUNCTION-INT-RATE(<'RATE5AB'>)  /* YK2
*
DECIDE FOR EVERY CONDITION
  WHEN #CGA-SCR-SUFFIX = 'DOP'                        /* NG1 added from AFSC-SVC
    PERFORM DOP-PROCESS
  WHEN #CGA-SCR-SUFFIX = 'VLT'
    PERFORM VAULT-LABEL-PROCESS
  WHEN #CGA-SCR-SUFFIX = 'GFT'
    PERFORM GIFT-LETTER-PROCESS
  WHEN #CGA-SCR-SUFFIX = 'RPU' OR = 'LPS' OR = 'LPL'
    PERFORM RPU-PROCESS
  WHEN #CGA-SCR-SUFFIX = 'BAL'
    PERFORM BAL-PROCESS
  WHEN #CGA-SCR-SUFFIX = 'DTH'
    PERFORM DTH-PROCESS
  WHEN #CGA-SCR-SUFFIX = 'RDD' OR = 'RDP' OR = 'DFL'
    PERFORM RD-PROCESS
  WHEN #CGA-SCR-SUFFIX = 'RDT' OR = 'TLL'                         /* RE1
    PERFORM RT-PROCESS                                            /* RE1
  WHEN #CGA-SCR-SUFFIX = 'RQ '
    PERFORM RQ-PROCESS
  WHEN #CGA-SCR-SUFFIX = 'LPF' OR = 'LPV' OR = 'LPB'
    PERFORM LPO-PROCESS
  WHEN #CGA-SCR-SUFFIX = 'CLP'
    PERFORM CLP-PROCESS
  WHEN NONE IGNORE
END-DECIDE
*
IF #ID-NUM = 38501 /* wants to not see info on envelope
  RESET #ID-NUM #MIL-STATUS #MIL-SERVICE
END-IF
*
IF *DEVICE = 'BATCH'
  IF #CGA-SCR-SUFFIX = 'FAL' OR = 'RFS' OR = 'RFC' OR = 'RFZ'
      OR = 'LPF' OR = 'LPV' OR = 'LPB' OR = 'CLP'
    IF NOT #CGA-SCR-SUFFIX = 'LPF' OR = 'LPV' OR ='LPB' /* write is done
      IF #CGA-SCR-SUFFIX = 'CLP'
        IF #WORK-AMT LE -5.00    /* was 0
          NEWPAGE (8)
          MOVE '** COPY **' TO #AD-FF-3                           /* PM4
          WRITE (8) NOTITLE USING FORM 'G3506FAD' /* 2nd copy     /* PM4
          NEWPAGE(8)                                              /* YAK
          WRITE (8) NOTITLE USING FORM 'G3506FAD' /* 3rd copy     /* PM4
          RESET #AD-FF-3                                          /* PM4
          NEWPAGE(8)                                              /* YAK
          WRITE (8) NOTITLE USING FORM 'G3506FAD'  /* for 6X9
*         MOVE '** COPY **' TO #AD-FF-3                           /* PM4
*         WRITE (8) NOTITLE USING FORM 'G3506FAD' /* 2nd copy     /* PM4
        ELSE
          NEWPAGE (7)
          WRITE (7) NOTITLE USING FORM 'G3506FAD'  /* for 6X9 w refund
        END-IF
      ELSE
        NEWPAGE (8)
        WRITE (8) NOTITLE USING FORM 'G3509FAD'  /* for #10
      END-IF
    END-IF
    ESCAPE ROUTINE
  END-IF
  EJECT
  WRITE NOTITLE USING FORM 'G3503FAD'
  MOVE 1 TO #CGA-SECURITY-CODE
ELSE
  IF #CGA-SCR-SUFFIX = 'RFG' OR = 'CLP'
    IF (#CGA-SCR-SUFFIX = 'CLP')
        AND NOT #CANCEL
      RESET #CGA-SCR-SUFFIX #CGA-ORIG-SUFFIX
    END-IF
*
    MOVE 'FA' TO #CGA-SCR-COMMAND
  END-IF
*
  #LEFT           := #FIRST-ADDRESS           /* PM7
  #RIGHT          := *TRIM(#AD-ADDR-MSG (1))  /* PM7
  #RESULT         := #LEFT                    /* PM7
  #I              := 70 - *LENGTH(#RIGHT)     /* PM7
  MOVE #RIGHT TO SUBSTRING(#RESULT,#I)        /* PM7
  #FIRST-ADDRESS  := #RESULT                  /* PM7
*
  #LEFT           := #SECOND-ADDRESS          /* PM7
  #RIGHT          := *TRIM (#AD-ADDR-MSG (2)) /* PM7
  #RESULT         := #LEFT                    /* PM7
  #I              := 70 - *LENGTH(#RIGHT)     /* PM7
  MOVE #RIGHT TO SUBSTRING(#RESULT,#I)        /* PM7
  #SECOND-ADDRESS := #RESULT                  /* PM7
*
  #LEFT           := #THIRD-ADDRESS           /* PM7
  #RIGHT          := *TRIM (#AD-ADDR-MSG (3)) /* PM7
  #RESULT         := #LEFT                    /* PM7
  #I              := 70 - *LENGTH(#RIGHT)     /* PM7
  MOVE #RIGHT TO SUBSTRING(#RESULT,#I)        /* PM7
  #THIRD-ADDRESS  := #RESULT                  /* PM7
*
  IF #CGA-SCR-SUFFIX = 'LPS' OR = 'LPL' OR = 'RPU'
    INPUT WITH TEXT #ERROR-MESSAGE USING MAP 'G3511MAD'
  ELSE
    IF #CGA-SCR-SUFFIX = 'VLT'
      RESET #CGA-SCR-COMMAND
        #CGA-SCR-ID
        #CGA-SCR-SUFFIX
      INPUT WITH TEXT #ERROR-MESSAGE USING MAP 'G3512MAD'
    ELSE
      IF #CGA-SCR-SUFFIX = 'RDT' OR = 'TLL'                     /* RE1
        RESET #CGA-SCR-COMMAND
          #CGA-SCR-ID
          #CGA-SCR-SUFFIX
        INPUT WITH TEXT #ERROR-MESSAGE USING MAP 'G3500MAD'
        INPUT WITH TEXT #ERROR-MESSAGE USING MAP 'G3516MAD'
      ELSE
        IF #CGA-SCR-SUFFIX = 'RDD' OR = 'RDP' OR = 'DFL'
          RESET #CGA-SCR-COMMAND
            #CGA-SCR-ID
            #CGA-SCR-SUFFIX
          INPUT WITH TEXT #ERROR-MESSAGE USING MAP 'G3500MAD'
          INPUT WITH TEXT #ERROR-MESSAGE USING MAP 'G3513MAD'
        ELSE
*
          IF NOT #CGA-SCR-SUFFIX = 'LPF' OR = 'LPV' OR = 'LPB'
            INPUT WITH TEXT #ERROR-MESSAGE USING MAP 'G3500MAD'
          END-IF
        END-IF
      END-IF
    END-IF
  END-IF
*
  IF #CGA-SCR-COMMAND NE '*'
    FETCH 'G1000PXX'
  END-IF
END-IF
*
IF *DEVICE = 'BATCH'    /* TO MAKE POSSIBLE FETCH RETURN FROM AOAP006E
  ESCAPE ROUTINE
END-IF
*
FETCH 'G1000PXX'
*
* * * * * * * * * * * * * * * *
DEFINE SUBROUTINE NSP-PROCESS
* * * * * * * * * * * * * * * *
*
MOVE #EXT-DEAR-FORMATED-NAME TO #AD-FF-12                                         /* vt1
*
COMPRESS '  The premium for your AAFMAA insurance is due on or before'
  'the date'  INTO #AD-FF-14
MOVE 'shown below.' TO #AD-FF-15
MOVE 'Please keep us informed of any change in address.' TO #AD-FF-17
MOVE '           Premium Notice' TO #AD-FF-19
MOVE 'Premium Due $'  TO #AD-FF-20
MOVE 'Due Date     '  TO #AD-FF-21
COMPRESS 'Please write CN' #CGA-ID
  ' and make check payable to AAFMAA'  INTO #AD-FF-23 LEAVING NO
*
MOVE 23 TO #I2
PERFORM CORR-MSG-FORMAT
*
END-SUBROUTINE /* (5165)
*
* * * * * * * * * * * * * * * *
DEFINE SUBROUTINE CLP-PROCESS
* * * * * * * * * * * * * * * *
*
FIND (1) ST-V WITH MEMBER-KEY = #CGA-ID-G
  IF NO RECORDS FOUND
    WRITE 'Member rec not found - CALL EDS'
    ESCAPE BOTTOM
  END-NOREC
END-FIND
*
#CAP-MEMBER-NUMBER := ST-V.ID-NUMBER                              /* PM6
#CAP-IND           := #LPO-IND                                    /* PM6
*
CALLNAT 'ATHSCAPP'                                                /* PM6
  #PDA-CAP-POLICY                                                 /* PM6
*
RESET #CANCEL #AD-FF-3 #ALLOT-CHANGE                              /* PM1
FIND (1) NT-V WITH ID-NUMBER = #CGA-ID
  FOR #I1 1 TO 60
    IF NOTE-TEXT (#I1) = MASK ('*CANCEL INSURANCE WHEN CAP LOAN IS')
      MOVE TRUE TO #CANCEL
      ESCAPE BOTTOM
    END-IF
  END-FOR
END-FIND
*
IF #CANCEL                                                        /* PM1
  MOVE 'CLC' TO #CGA-SCR-SUFFIX                                   /* PM1
ELSE                                                              /* PM1
  MOVE 'CL'  TO #CGA-SCR-SUFFIX                                   /* PM1
END-IF                                                            /* PM1
*
MOVE #CGA-SCR-ID TO #HOLD-SCR-ID                                  /* PM1
MOVE #CGA-SCR-COMMAND TO #HOLD-SCR-COMMAND                        /* PM1
FETCH RETURN 'C2800PFA'
MOVE TRUE TO #ALLOT-CHANGE                                        /* PM1
IF (#ALLOT-CHANGE)
  #ALLOT-CHANGE-A := 'YE1'
ELSE #ALLOT-CHANGE-A := 'NO1'
END-IF
IF #CGA-SCR-SUFFIX EQ 'CLC'                                       /* PM1
  RESET #ALLOT-CHANGE
  IF (#ALLOT-CHANGE)
    #ALLOT-CHANGE-A := 'YE2'
  ELSE #ALLOT-CHANGE-A := 'NO2'
  END-IF                                           /* PM1
END-IF                                                            /* PM1
MOVE 'CLP' TO #CGA-SCR-SUFFIX                                     /* PM1
MOVE #HOLD-SCR-ID TO #CGA-SCR-ID                                  /* PM1
MOVE #HOLD-SCR-COMMAND TO #CGA-SCR-COMMAND                        /* PM1
*
IF   (#HOLD-DEBIT-CREDIT-AMT LE +1.00)
    AND (#HOLD-DEBIT-CREDIT-AMT GE -1.00)
  RESET #HOLD-DEBIT-CREDIT-AMT
END-IF
*
MOVE #HOLD-DEBIT-CREDIT-AMT TO #WORK-AMT
*
IF #WORK-AMT LT 0
  ASSIGN *CURS-LINE = 3
  ASSIGN *CURS-COL = 27
  MOVE '           REFUND $' TO #AD-FF-4
  MOVE EDITED #WORK-AMT (EM=ZZZ,ZZZ.99) TO #W-AMT
  COMPRESS #AD-FF-4 #W-AMT INTO #AD-FF-4 LEAVING NO SPACE
END-IF
*
MOVE #EXT-DEAR-FORMATED-NAME TO #AD-FF-12                                      /* vt1
*
COMPRESS 'Congratulations on having paid off your Career'
  'Assistance Program loan!'  INTO #AD-FF-14
* MOVE 'Enclosed, please find your cancelled loan agreement.' TO #AD-FF-15  YK3
*
IF #CANCEL
  COMPRESS #AD-FF-15 'Per your request, we' INTO #AD-FF-15
  COMPRESS 'have cancelled your life insurance policy with us.' INTO #AD-FF-16
END-IF
*                               /* PM6 - BEGIN RESTRUCTURING
IF (#ALLOT-CHANGE)
  #ALLOT-CHANGE-A := 'YES'
ELSE #ALLOT-CHANGE-A := 'NO'
END-IF
*
#AD-I :=6
DECIDE FOR FIRST CONDITION
  WHEN (#ALLOT-CHANGE)
      AND (ST-V.MODE (#CAP-X) = 'G')
      AND (ST-V.ALOT-CHG-AUTH = 'Y' OR = 'A')     /* DW3
    COMPRESS 'Thank you for your authorization to change your allotment'
      'amount. We will' INTO #AD-TABLE (#AD-I)
    ADD +1 TO #AD-I
    COMPRESS 'be submitting the change to the DFAS payment center on your'
      'behalf.' TO #AD-TABLE (#AD-I)
    ADD +1 TO #AD-I
*
  WHEN (#ALLOT-CHANGE)
      AND (ST-V.MODE (#CAP-X) = 'G')
      AND (ST-V.ALOT-CHG-AUTH = 'N' OR = ' ')
    COMPRESS 'As a new service to members, AAFMAA CAN NOW ADJUST YOUR'
      'ALLOTMENT THROUGH' INTO #AD-TABLE (#AD-I)
    ADD +1 TO #AD-I
    COMPRESS 'DFAS ON YOUR BEHALF. Just sign the enclosed Allotment'
      'Authorization' INTO #AD-TABLE (#AD-I)
    ADD +1 TO #AD-I
    COMPRESS 'form and return it to AAFMAA. We will take care of it for you.'
      INTO #AD-TABLE (#AD-I)
    ADD +1 TO #AD-I
*
  WHEN (#ALLOT-CHANGE)
      AND (ST-V.MODE (#CAP-X) = 'G')
      AND (ST-V.ALOT-CHG-AUTH = 'S')
    COMPRESS 'Thank you for your authorization to stop your allotment'
      'amount. We will' INTO #AD-TABLE (#AD-I)
    ADD +1 TO #AD-I
    COMPRESS 'be submitting the change to the DFAS payment center on your'
      'behalf.' TO #AD-TABLE (#AD-I)
    ADD +1 TO #AD-I
*
  WHEN (ST-V.MODE (#CAP-X) = 'E')
    COMPRESS 'Your EZPay bank draft will be adjusted to debit the monthly'
      'amount needed' INTO #AD-TABLE (#AD-I)
    ADD +1 TO #AD-I
    COMPRESS 'for premiums (dues and rider, if applicable) for your'
      'insurance with us.' INTO #AD-TABLE (#AD-I)
    ADD +1 TO #AD-I
*
    IF #ALLOT-CHANGE
      DECIDE FOR FIRST CONDITION
        WHEN ST-V.ALOT-CHG-AUTH = 'Y' OR = 'A'             /* DW3
          COMPRESS 'Thank you for your authorization to change your allotment'
            'amount. We will' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'be submitting the change to the DFAS payment center on your'
            'behalf.' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
        WHEN ST-V.ALOT-CHG-AUTH = 'S'
          COMPRESS 'Thank you for your authorization to stop your allotment'
            'amount. We will' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'be submitting the change to the DFAS payment center on your'
            'behalf.' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
        WHEN ST-V.ALOT-CHG-AUTH = 'N' OR =' '
          COMPRESS 'AAFMAA CAN NOW ADJUST YOUR ALLOTMENT THROUGH DFAS ON YOUR'
            'BEHALF.  Just' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'sign the enclosed allotment authorization form and return it'
            'to AAFMAA.' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
        WHEN NONE
          IGNORE
      END-DECIDE
    END-IF
*
  WHEN (ST-V.MODE (#CAP-X) = 'M' OR ='Q')
    COMPRESS 'Your payment mode has been changed to a Quarterly Billing'
      'Notice.' INTO #AD-TABLE (#AD-I)
*
    IF #ALLOT-CHANGE
      DECIDE FOR FIRST CONDITION
        WHEN ST-V.ALOT-CHG-AUTH = 'Y' OR = 'A'        /* DW3
          COMPRESS #AD-TABLE (#AD-I) 'Thank you' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'for your authorization to change your allotment amount.'
            'We will be submitting' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'the change to the DFAS payment center on your behalf.'
            INTO #AD-TABLE (#AD-I)
        WHEN ST-V.ALOT-CHG-AUTH = 'S'
          COMPRESS #AD-TABLE (#AD-I) 'Thank you' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'for your authorization to stop your allotment amount. We'
            'will be submitting' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'the change to the DFAS payment center on your behalf.'
            INTO #AD-TABLE (#AD-I)
        WHEN ST-V.ALOT-CHG-AUTH = 'N' OR =' '
          COMPRESS #AD-TABLE (#AD-I) 'AAFMAA' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'CAN NOW ADJUST YOUR ALLOTMENT THROUGH DFAS ON YOUR BEHALF. Just'
            'sign the' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'enclosed allotment authorization form and return it'
            'to AAFMAA.' INTO #AD-TABLE (#AD-I)
        WHEN NONE
          IGNORE
      END-DECIDE
    END-IF
*
    ADD +1 TO #AD-I
*
  WHEN (ST-V.MODE (#CAP-X) = '0')
    COMPRESS 'Your credit card will be charged the monthly amount needed'
      'for premiums (dues' INTO #AD-TABLE (#AD-I)
    ADD +1 TO #AD-I
    COMPRESS 'and rider, if applicable) for your insurance with us.'
      INTO #AD-TABLE (#AD-I)
*
    IF #ALLOT-CHANGE
      DECIDE FOR FIRST CONDITION
        WHEN ST-V.ALOT-CHG-AUTH = 'Y' OR = 'A'     /* DW3
          COMPRESS #AD-TABLE (#AD-I) 'Thank you for your' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'authorization to change your allotment amount. We will be'
            'submitting the' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'change to the DFAS payment center on your behalf.'
            INTO #AD-TABLE (#AD-I)
        WHEN ST-V.ALOT-CHG-AUTH = 'S'
          COMPRESS #AD-TABLE (#AD-I) 'Thank you for your' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'authorization to stop your allotment amount. We will be'
            'submitting the' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'change to the DFAS payment center on your behalf.'
            INTO #AD-TABLE (#AD-I)
        WHEN ST-V.ALOT-CHG-AUTH = 'N' OR =' '
          COMPRESS #AD-TABLE (#AD-I) 'AAFMAA CAN NOW ADJUST' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'YOUR ALLOTMENT THROUGH DFAS ON YOUR BEHALF. Just sign the'
            'enclosed allotment' INTO #AD-TABLE (#AD-I)
          ADD +1 TO #AD-I
          COMPRESS 'authorization form and return it to AAFMAA.'
            INTO #AD-TABLE (#AD-I)
        WHEN NONE
          IGNORE
      END-DECIDE
    END-IF
*
    ADD +1 TO #AD-I
*
  WHEN NONE
    IGNORE
*   WRITE ST-V.ID-NUMBER 'No payment mode text for mode' ST-V.MODE (#CAP-X)
END-DECIDE
*
COMPUTE #I3 = #AD-I - 1
IF #AD-TABLE (#I3) NE ' '
  ADD +1 TO #AD-I
END-IF
*
COMPRESS 'If you have any questions, please contact Policy Services at'
  '1-800-336-4538 at' INTO #AD-TABLE (#AD-I)
ADD +1 TO #AD-I
* COMPRESS 'ext. 724 between 0830 and 1630 ET or email us at'  /* PM8
COMPRESS 'between 8:30am and 5:30 pm ET or email us at'   /* PM8 bz
  'policyservices@aafmaa.com.' INTO #AD-TABLE (#AD-I)
*                               /* PM6 - END RESTRUCTURING
IF #WORK-AMT LT 0
  COMPRESS 'Enclosed please find our check refunding your'
    'total account overpayment.' INTO #AD-FF-24            /* PM4
*          'overpayment.'        INTO #AD-FF-24                   /* PM4
END-IF
*
IF *DEVICE NE 'BATCH'
  MOVE 22 TO #I2
  PERFORM CORR-MSG-FORMAT
END-IF
*
END-SUBROUTINE /* (5165)
*
*********************************
DEFINE SUBROUTINE CORR-MSG-FORMAT
*********************************
*
MOVE #CGA-CLERK TO #CLERK-ABB-PASS
MOVE ' ' TO #CLERK-ABB-NAME-PASS
CALLNAT 'GCKNMSXX' #CLERK-ABB-PASS
  #INVALID
  #CLERK-ABB-NAME-PASS
*
IF *DEVICE = 'BATCH'
    AND (#I2 LT 12)
  ADD 2 TO #I2
ELSE
  MOVE 13 TO #I2
END-IF
COMPRESS #CORR-MSG #CLERK-ABB-NAME-PASS INTO #AD-TABLE (#I2)
*
END-SUBROUTINE
*
************************************
DEFINE SUBROUTINE VAULT-LABEL-PROCESS
************************************
*
FIND ST-V WITH ID-NUMBER = #ID-NUM                          /* RE2 Start
  IF F-CONTACT-INFO(<ST-V.MEMBER-CONTACT-ID,F-CONTACT-DATA>)
    IGNORE
  END-IF
END-FIND
*
**MOVE #HOLD-NAME TO #AD-FF-4
MOVE #CONT-FMTD-NAME TO #AD-FF-4                            /* RE2 End
COMPRESS ' CN:' #ID-NUM INTO #AD-FF-5
COMPRESS #SSN-1 #SSN-2 #SSN-3 INTO #AD-FF-6 WITH '-'
COMPRESS 'SSN:' #AD-FF-6 INTO #AD-FF-6
*
END-SUBROUTINE /* (0735)
*
**************************************
DEFINE SUBROUTINE GIFT-LETTER-PROCESS
**************************************
*
MOVE #EXT-DEAR-FORMATED-NAME TO #AD-FF-13                                   /* vt1
MOVE 'THANK YOU FOR HELPING YOUR ASSOCIATION BY STARTING'
  TO #AD-FF-15
MOVE 'AN ALLOTMENT.'                TO #AD-FF-16
MOVE 'ENCLOSED IS A SMALL TOKEN OF OUR APPRECIATION.'
  TO #AD-FF-18
MOVE 'SINCERELY,' TO #AD-FF-20
*
PERFORM CORR-MSG-FORMAT
MOVE #CLERK-ABB-NAME-PASS TO #AD-FF-22
MOVE 'FINANCIAL MANAGEMENT' TO #AD-FF-23
RESET #AD-FF-24
*
END-SUBROUTINE /* (0746)
*
*****************************
DEFINE SUBROUTINE RD-PROCESS
*****************************
IF #CGA-SCR-SUFFIX = 'RDP'
  MOVE '"pipelined"' TO #PROC
ELSE
  MOVE '"grandfathered"' TO #PROC
END-IF
*
PERFORM CORR-MSG-FORMAT
*
MOVE #EXT-DEAR-FORMATED-NAME TO #AD-FF-13                                  /* vt1
COMPRESS 'In response to AAFMAA"s termination of your' #PROC
  'status, member'            INTO #AD-FF-15
IF #CGA-SCR-SUFFIX = 'DFL'
/* NG1                                                                \/\/\/
  COMPRESS 'services are no longer available as part of your AAFMAA'
    'membership.'             INTO #AD-FF-16
  COMPRESS 'If you desire to continue receiving services, we invite you'
    'to join AAFMAA '         INTO #AD-FF-18
  COMPRESS 'Financial Advisors directly and receive all living and survivor'
    'services.'               INTO #AD-FF-19
  COMPRESS 'Contact AAFMAA Financial Advisors for more information on'
    'our Products and'  INTO #AD-FF-21
  ASSIGN #AD-FF-22 = 'Services.'
*  COMPRESS 'If you desire to continue receiving services, we invite you'
*           'to join AFSC '           INTO #AD-FF-18
*  COMPRESS 'directly and receive all living and survivor services for a'
*           'discounted fee of'       INTO #AD-FF-19
*  COMPRESS 'only $4.00 per month!(The discounted fee offer is valid for'
*           '30 days from the'        INTO #AD-FF-20
*  COMPRESS 'date of this letter.)'   INTO #AD-FF-21
*                                                                      /\/\/\
ELSE
  COMPRESS 'services are no longer available as part of your AAFMAA'
    'membership. These'       INTO #AD-FF-16
  COMPRESS 'services included among other things, the storage of your'
    'documents in the'        INTO #AD-FF-17
  COMPRESS 'vault, a process managed by AAFMAA Financial Advisors.'
    'Accordingly, your'       INTO #AD-FF-18
  COMPRESS 'documents are being returned for your disposition.'
    INTO #AD-FF-19
  COMPRESS 'If you desire to continue receiving services, we invite you'
    'to join AAFMAA '         INTO #AD-FF-21
  COMPRESS 'Financial Advisors' 'directly.'
    INTO #AD-FF-22
*  COMPRESS 'only $4.00 per month!(The discounted fee offer is valid for'
*    '30 days from the'        INTO #AD-FF-23
*  COMPRESS 'date of this letter.)'   INTO #AD-FF-24
END-IF
RESET #AD-FF-20 #AD-FF-23 #AD-FF-24                                /* NG1
*
* COMPRESS #CLERK-ABB-NAME-PASS ', Membership Services Department'
*  INTO #TEXT-A LEAVING NO

COMPRESS #CLERK-ABB-NAME-PASS ', AAFMAA Financial Advisors'        /* NG1
  INTO #TEXT-A LEAVING NO

END-SUBROUTINE /* (0746)
*
*****************************
DEFINE SUBROUTINE RT-PROCESS                   /* RE1
*****************************
PERFORM CORR-MSG-FORMAT
*
MOVE #EXT-DEAR-FORMATED-NAME TO #AD-FF-13                                         /* vt1
* COMPRESS 'We, the Armed Forces Services Corporation (AFSC), have been'
COMPRESS 'AAFMAA Financial Advisors have been'                            /* NG1
  'notified that you'         INTO #AD-FF-15
COMPRESS 'surrendered your AAFMAA'
  ' insurance'        INTO #AD-FF-16
IF #CGA-SCR-SUFFIX = 'TLL'
  COMPRESS 'and your AAFMAA membership.'
    INTO #AD-FF-17
  COMPRESS 'We understand that as your insurance needs change you may'
    'no longer require'       INTO #AD-FF-19
  COMPRESS 'insurance coverage. We want to ensure that you are aware'
    'that the cancellation'   INTO #AD-FF-20
  COMPRESS 'of your AAFMAA policy also cancelled your lifetime'
    'survivorship services.'  INTO #AD-FF-21
  COMPRESS 'Those lifetime survivor services are still available to you'
    'and your family'         INTO #AD-FF-22
*  COMPRESS 'by joining the Armed Forces Services Corporation.'
  COMPRESS 'by joining the AAAFMAA Financial Advisors.'                  /* NG1
    INTO #AD-FF-23
  MOVE ' ' TO #AD-FF-24
ELSE
  COMPRESS 'and your AAFMAA membership. All documents previously stored'
    'in the AAFMAA'           INTO #AD-FF-17
  COMPRESS 'vault are being returned for your disposition.'
    INTO #AD-FF-18
  COMPRESS 'We understand that as your insurance needs change you may'
    'no longer require'         INTO #AD-FF-20
  COMPRESS 'insurance coverage. We want to ensure that you are aware'
    'that the cancellation'   INTO #AD-FF-21
  COMPRESS 'of your AAFMAA policy also cancelled your lifetime'
    'survivorship services.'  INTO #AD-FF-22
  COMPRESS 'Those lifetime survivor services are still available to you'
    'and your family'         INTO #AD-FF-23
  COMPRESS 'by joining the Armed Forces Services Corporation.'
    INTO #AD-FF-24
END-IF
COMPRESS #CLERK-ABB-NAME-PASS ', Membership Services Department'
  INTO #TEXT-A LEAVING NO
END-SUBROUTINE /* (0695)
*
*****************************
DEFINE SUBROUTINE RQ-PROCESS
*****************************
*
MOVE #EXT-DEAR-FORMATED-NAME TO #AD-FF-13                                   /* vt1
COMPRESS 'In response to the AAFMAA reply card you returned,'
  'enclosed is the information'         INTO #AD-FF-15
COMPRESS 'you requested on our services.  If you have any'
  'questions, please feel free to'      INTO #AD-FF-16
COMPRESS 'call us at (800)336-4538, E-Mail at INFO@AAFMAA.COM,'
  'or visit our web-site at' INTO #AD-FF-17
MOVE     'WWW.AAFMAA.COM.'         TO #AD-FF-18
COMPRESS 'Thank you for your membership and have a'
  'great day!'                          INTO #AD-FF-19
MOVE 'Sincerely,' TO #AD-FF-21
*
PERFORM CORR-MSG-FORMAT
MOVE #CLERK-ABB-NAME-PASS TO #AD-FF-23
MOVE 'Member Services Department' TO #AD-FF-24
*
END-SUBROUTINE /* (0746)
*
**************************************
DEFINE SUBROUTINE BAL-PROCESS  /*  *** ONLY TEMPORARY 3/97
**************************************
*
IF #PT-MM = 0
  MOVE 1 TO #PT-MM
END-IF
*
MOVE #EXT-DEAR-FORMATED-NAME TO #AD-FF-13                                      /* vt1
MOVE EDITED #PASSED-AMT (EM=Z,ZZZ.99) TO #PASSED-AMT-X
COMPRESS 'To maintain your current billing cycle, please remit $'
  #PASSED-AMT-X ' to cover'  INTO #AD-FF-15
COMPRESS 'the premiums and/or dues for your additional insurance'
  'through' #F-MON-LIT (#PT-MM) #PT-YYYY      INTO #AD-FF-16
COMPRESS #AD-FF-16 '.' INTO #AD-FF-16 LEAVING NO
COMPRESS 'If payment is not received, it will be added to your next'
  'statement.'  INTO #AD-FF-17
MOVE    'If you have any questions, please call us at 1-800-336-4538.'
  TO #AD-FF-19
MOVE 'SINCERELY,' TO #AD-FF-21
*
PERFORM CORR-MSG-FORMAT
RESET #AD-FF-22
MOVE #CLERK-ABB-NAME-PASS TO #AD-FF-23
RESET #AD-FF-24
*
END-SUBROUTINE /* (0746)
*
*****************************
DEFINE SUBROUTINE RPU-PROCESS
*****************************
*
*    text below is also in c2320pci' *************
RESET #I2
ADD 1 TO #I2
MOVE #EXT-DEAR-FORMATED-NAME TO #RPU-TEXT (#I2)                               /* vt1
*
IF #CGA-SCR-SUFFIX = 'LPS' OR = 'LPL'
  ADD 1 TO #I2
  COMPRESS '  I regret to have to inform you that your life'
    'insurance with the'     TO #RPU-TEXT (#I2)
  ADD 1 TO #I2
  COMPRESS 'AAFMAA issued on'
    '_______________________________' INTO #RPU-TEXT (#I2)
*
  ADD 1 TO #I2
  COMPRESS 'lapsed on __________ due to' INTO #RPU-TEXT (#I2)
*
  IF #CGA-SCR-SUFFIX = 'LPS'
    COMPRESS #RPU-TEXT (#I2) 'non-payment of dues. As a'
      'result, your membership'    INTO #RPU-TEXT (#I2)
    ADD 1 TO #I2
    MOVE 'has also been terminated.' TO #RPU-TEXT (#I2)
  ELSE
    COMPRESS #RPU-TEXT (#I2) 'being overloaned. Your total'
      'indebtedness, (out-'  INTO #RPU-TEXT (#I2)
    ADD 1 TO #I2
    COMPRESS 'standing loan plus accrued interest to date of lapse)'
      'has exceeded the cash'   INTO #RPU-TEXT (#I2)
    ADD 1 TO #I2
    MOVE 'value of your insurance.' TO #RPU-TEXT (#I2)
    ADD 1 TO #I2
    COMPRESS '  A portion of the total indebtedness outstanding'
      'exceeded the dues you'    INTO #RPU-TEXT (#I2)
    ADD 1 TO #I2
    COMPRESS 'paid by $_________. Under present Internal'
      'Revenue regulations, this amount'  INTO #RPU-TEXT (#I2)
    ADD 1 TO #I2
    COMPRESS 'should be reported on your Federal Tax Return for'
      'the year _____ as ordinary'   INTO #RPU-TEXT (#I2)
    ADD 1 TO #I2
    COMPRESS 'income. A form 1099 reflecting this taxable income'
      'will be mailed to you in' INTO #RPU-TEXT (#I2)
    ADD 1 TO #I2
    MOVE     'January ________.' TO #RPU-TEXT (#I2)
  END-IF
*
  ADD 1 TO #I2
  COMPRESS '  If you wish to reinstate your certificate, please'
    'let us know.'                     INTO #RPU-TEXT (#I2)
  ADD 1 TO #I2
  PERFORM CORR-MSG-FORMAT
  MOVE #AD-TABLE (#I2) TO #RPU-TEXT (#I2)
  ADD 2 TO #I2
  MOVE 'CERTIFIED MAIL' TO #RPU-TEXT (#I2)
  ESCAPE ROUTINE
END-IF
*
ADD 1 TO #I2
COMPRESS '  Per your request, your AAFMAA insurance has been'
  'converted to a Reduced'       INTO #RPU-TEXT (#I2)
ADD 1 TO #I2
COMPRESS 'Paid-Up status. Your new coverage amount is $_________.'
  'This insurance was' INTO #RPU-TEXT (#I2)
ADD 1 TO #I2
MOVE 'issued on _____________________________' TO #RPU-TEXT (#I2)
*
ADD 1 TO #I2
COMPRESS ' Your total loan of $___________ was liquidated and'
  'has exceeded your'     INTO #RPU-TEXT (#I2)
ADD 1 TO #I2
COMPRESS 'premiums and/or dues paid by $__________. Under IRS'
  'regulations, this amount'  INTO #RPU-TEXT (#I2)
ADD 1 TO #I2
COMPRESS 'should be reported on your Federal Income Tax Return as'
  'ordinary income.'     INTO #RPU-TEXT (#I2)
ADD 1 TO #I2
COMPRESS 'A form 1099 will be mailed to you in ______.'
  INTO #RPU-TEXT (#I2)
*
ADD 2 TO #I2
*
COMPRESS '  Enclosed are copies of the original data sheets, the'
  'originals are attached' INTO #RPU-TEXT (#I2)
ADD 1 TO #I2
COMPRESS 'to your certificates of membership and insurance on'
  'file.'            INTO #RPU-TEXT (#I2)
ADD 2 TO #I2
PERFORM CORR-MSG-FORMAT
MOVE #AD-TABLE (#I2) TO #RPU-TEXT (#I2)
*
END-SUBROUTINE /* (0916)
*
* * * * * * * * * * * * * * *
DEFINE SUBROUTINE DTH-PROCESS
* * * * * * * * * * * * * * *
*
IF #WIDOW-FLAG NE 'Y'
  MOVE 'Member must be Deceased' TO #ERROR-MESSAGE
  ESCAPE ROUTINE
END-IF
*
COMPRESS 'To: Defense Finance Center               Recipient"s Tele'
  'copier: #216-522-6469'   INTO #AD-FF-3 LEAVING NO
COMPRESS '  P.O.Box 99191 Cleveland OH 44199-1126  From Telecopie'
  'r:        #703-875-0076'   INTO #AD-FF-4 LEAVING NO
*
MOVE #DOB-SP TO #YYYYMMDD
COMPRESS #MM #DD #YYYY INTO #AD-ADDR-MSG (1) WITH '/'
COMPRESS 'Date of Birth:' #AD-ADDR-MSG (1) INTO #AD-ADDR-MSG (1)
*
MOVE #DOM TO #YYYYMMDD
COMPRESS #MM #DD #YYYY INTO #AD-ADDR-MSG (2) WITH '/'
COMPRESS 'Date of Marriage:' #AD-ADDR-MSG (2) INTO #AD-ADDR-MSG (2)
MOVE EDITED #SSN-SP (EM=999-99-9999) TO #AD-ADDR-MSG (3)
COMPRESS 'SSAN:' #AD-ADDR-MSG (3) INTO #AD-ADDR-MSG (3)
*
* SEPARATE #HOLD-NAME INTO #LAST-NAME #FIRST/MID                                       /* vt1
*   #SUFFIX #EXTRA1 #EXTRA2 WITH DELIMITER ','                                         /* vt1
* COMPRESS 'Notification of the death of' #HOLD-RANK-5 #FIRST/MID                      /* vt1
*  #LAST-NAME #SUFFIX INTO #AD-TABLE (1)                                               /* vt1
COMPRESS 'Notification of the death of' #MEMO-TO-NAME INTO #AD-TABLE(1)              /* vt1                                                /* vt1
*
MOVE EDITED #HOLD-SSN (EM=999-99-9999) TO #AD-LST-48 (2)
COMPRESS 'SSAN:' #AD-LST-48 (2) INTO #AD-LST-48 (2)
*
MOVE #DOD TO #YYYYMMDD
COMPRESS #MM #DD #YYYY INTO #AD-LST-48 (3) WITH '/'
COMPRESS 'Date of Death:' #AD-LST-48 (3) INTO #AD-LST-48 (3)
*
COMPRESS 'We understand you will furnish forms to the widow to apply'
  'for the arrears'   INTO #AD-TABLE (5)
MOVE     'of Pay and SBP Annuity' TO #AD-TABLE (6)
*
MOVE 'From:' TO #AD-TABLE (8)
MOVE 'AAFMAA' TO #AD-TABLE (9)
MOVE 'Sincerely,' TO #AD-LST-28 (9)
PERFORM CORR-MSG-FORMAT
RESET #AD-FF-24  /* from above
MOVE '468 Sheridan Ave' TO #AD-TABLE (10)
MOVE #CLERK-ABB-NAME-PASS TO #AD-LST-28 (10)
MOVE 'Fort Myer, VA 22211-5002' TO #AD-TABLE (11)
MOVE 'AAFMAA Finacial Advisors' TO #AD-LST-28 (11)   /* NG1
*
END-SUBROUTINE /* (1014)
*
* * * * * * * * * * * * * * *
DEFINE SUBROUTINE LPO-PROCESS
* * * * * * * * * * * * * * *
*
MOVE #CGA-SCR-SUFFIX TO #SCR-SUFFIX
*
IF   (#PASSED-LPO-INT LT 5.00)
    AND (#PASSED-LPO-INT GT -5.00)
  RESET #PASSED-LPO-INT
END-IF
*
MOVE EDITED #PASSED-LPO-INT (EM=ZZZZZ.99) TO #HOLD-EDIT-INT
*
FIND (1) ST-V WITH MEMBER-KEY = #CGA-ID-G
  IF NO RECORDS FOUND
    WRITE 'Member rec not found - CALL EDS'
    ESCAPE BOTTOM
  END-NOREC
END-FIND
*
RESET #FOUND-LPO #LPO-X
FOR #I1 1 TO 9   /* hunt for 1st lpo
  IF   (#SCR-SUFFIX-3 = 'V' OR = 'B')  /* LPV
    IF  (ST-V.X-LPO-PMT-RCVD-2       (#I1) NE 0)
        OR (ST-V.X-LPO-PRIOR-LOAN-BAL-2 (#I1) NE 0)
        OR (ST-V.X-LPO-PRIOR-ACC-INT-2  (#I1) NE 0)
      MOVE TRUE TO #FOUND-LPO
      ADD 1 TO #NUM-LPO
      MOVE #I1 TO #LPO-X
      MOVE ST-V.ISSUE-DATE (#I1) TO #LPO-ISS-DT (#I1)
      MOVE 'V' TO #LPF-LPV
      MOVE 'Variable' TO #FIX-VAR-LBL
    END-IF
  END-IF
*
  IF   (#SCR-SUFFIX-3 = 'F' OR = 'B')  /* LPF
    IF  (ST-V.X-LPO-PMT-RCVD         (#I1) NE 0)
        OR (ST-V.X-LPO-PRIOR-LOAN-BAL   (#I1) NE 0)
        OR (ST-V.X-LPO-PRIOR-ACC-INT    (#I1) NE 0)
      MOVE TRUE TO #FOUND-LPO
      ADD 1 TO #NUM-LPO
      MOVE #I1 TO #LPO-X
      MOVE ST-V.ISSUE-DATE (#I1) TO #LPO-ISS-DT (#I1)
      MOVE 'F' TO #LPF-LPV
      MOVE 'Fixed' TO #FIX-VAR-LBL
    END-IF
  END-IF
END-FOR
*
IF   (#NUM-LPO = 0)
    AND (*DEVICE NE 'BATCH')
  MOVE '*' TO #CGA-SCR-COMMAND
  INPUT TEXT 'NO LP? records found Press enter' USING MAP 'G1000MXX'
*
  IF #CGA-SCR-COMMAND = '*'
    MOVE 'AD' TO #CGA-SCR-COMMAND
  END-IF
*
  IF #CGA-SCR-SUFFIX = 'LPF'
    MOVE 'LPV' TO #CGA-SCR-SUFFIX
  ELSE
    MOVE 'LPF' TO #CGA-SCR-SUFFIX
  END-IF
  FETCH 'G1000PXX'
END-IF
*
IF #NUM-LPO = 1
  MOVE #LPO-X TO #I1
  perform Find-owner                          /* vt2
  PERFORM PROCESS-LPOS
ELSE
  IF *DEVICE = 'BATCH'
    FOR #I1 1 TO 9
      IF #LPO-ISS-DT (#I1) NE 0
        MOVE 'X' TO #LPO-ISS-DT-SEL (#I1)
      END-IF
    END-FOR
  ELSE
    MOVE '*' TO #CGA-SCR-COMMAND
    INPUT MARK *#LPO-ISS-DT-SEL (1) USING MAP 'G3514MAD'
*
    IF #CGA-SCR-COMMAND NE '*'
      FETCH 'G1000PXX'
    END-IF
  END-IF
*
  FOR #I3 1 TO 9
    IF   (#LPO-ISS-DT-SEL (#I3) NE ' ')
        AND (#LPO-ISS-DT (#I3) NE 0)
      IF   (#SCR-SUFFIX-3 = 'F' OR = 'B')  /* LPF
          AND ((ST-V.X-LPO-PMT-RCVD       (#I3) NE 0)
          OR  (ST-V.X-LPO-PRIOR-LOAN-BAL (#I3) NE 0)
          OR  (ST-V.X-LPO-PRIOR-ACC-INT  (#I3) NE 0))
        MOVE 'F' TO #LPF-LPV
        MOVE #I3 TO #LPO-X
        MOVE #I3 TO #I1
        PERFORM PROCESS-LPOS
      END-IF
*
      IF   (#SCR-SUFFIX-3 = 'V' OR = 'B')  /* LPV
          AND ((ST-V.X-LPO-PMT-RCVD-2       (#I3) NE 0)
          OR  (ST-V.X-LPO-PRIOR-LOAN-BAL-2 (#I3) NE 0)
          OR  (ST-V.X-LPO-PRIOR-ACC-INT-2  (#I3) NE 0))
        MOVE 'V' TO #LPF-LPV
        MOVE #I3 TO #LPO-X
        MOVE #I3 TO #I1
        PERFORM PROCESS-LPOS
      END-IF
    END-IF
  END-FOR
END-IF
*
MOVE 'AD' TO #CGA-SCR-COMMAND
*
END-SUBROUTINE /* (1066)
*
* * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE DO-LPX-SCREEN
* * * * * * * * * * * * * * * * *
*
IF *DEVICE = 'BATCH'
  NEWPAGE (8)                                                /* YAK
  WRITE (8) NOTITLE USING FORM 'G3509FAD'  /* for #10
ELSE
  INPUT WITH TEXT #ERROR-MESSAGE USING MAP 'G3500MAD'
*
  IF #CGA-SCR-COMMAND NE '*'
    FETCH 'G1000PXX'
  END-IF
END-IF
*
END-SUBROUTINE
*
* * * * * * * * * * * * * * * *
DEFINE SUBROUTINE PROCESS-LPOS
* * * * * * * * * * * * * * * *
*
CALLNAT 'GPLNMSXX' #POL-NUM ST-V.ID-NUMBER #I1
*
RESET #FOUND-LPO #AD-TABLE (1:13)
IF #LPF-LPV = 'V'
  MOVE 'Variable' TO #FIX-VAR-LBL
  MOVE TRUE TO #FOUND-LPO
  MOVE EDITED #CURR-VAR-INT-RATE (EM=ZZ.99) TO #INT-RT
  MOVE ST-V.ISSUE-DATE (#I1) TO #YYYYMMDD
  COMPRESS #MM-A #DD-A #YYYY-A INTO #LPO-ISS-DT-DISP WITH '/'
  COMPRESS #LPO-ISS-DT-DISP '.'INTO #LPO-ISS-DT-DISP LEAVING NO
  MOVE EDITED ST-V.X-LPO-PMT-RCVD-2 (#I1) (EM=ZZ,ZZZ.99) TO #AMOUNT
  COMPRESS 'Thank you for your payment of $' #AMOUNT ' towards your o'
    'utstanding variable'  INTO #AD-FF-12 LEAVING NO
  COMPRESS 'loan on your AAFMAA policy' #POL-NUM 'issued'
    #LPO-ISS-DT-DISP INTO #AD-FF-13
*
  IF X-LOAN-AMOUNT-2 (#I1) NE 0
    COMPUTE #INT-LEFT = X-LPO-PRIOR-ACC-INT-2 (#I1)
      - X-LPO-PMT-RCVD-2 (#I1)
*
    MOVE 5 TO #I2
    IF #INT-LEFT GT 0
      MOVE EDITED #INT-LEFT (EM=ZZ,ZZZ.99) TO #AMOUNT
      COMPRESS 'The remaining interest on your loan is $'
        #AMOUNT '.'  INTO #AD-FF-15 LEAVING NO
      ADD 1 TO #I2
    END-IF
*
    PERFORM DO-BOTTOM-OF-LPX
*
    COMPRESS 'This correspondence has been prepared by the Policy'
      'Services Team.' INTO #AD-FF-24     /* DW3
*   MOVE 13 TO #I2                          /* DW3
*   PERFORM CORR-MSG-FORMAT
    PERFORM DO-LPX-SCREEN
  ELSE
    COMPUTE #INT-LEFT = X-LPO-PRIOR-LOAN-BAL-2 (#I1)
      + X-LPO-PRIOR-ACC-INT-2 (#I1)
      - X-LPO-PMT-RCVD-2 (#I1)
    IF   (#INT-LEFT LT 5.00) AND (#INT-LEFT GT -5.00)
      RESET #PASSED-LPO-INT
    ELSE
      COMPUTE #PASSED-LPO-INT = X-LPO-PRIOR-LOAN-BAL-2 (#I1)
        + X-LPO-PRIOR-ACC-INT-2 (#I1) - X-LPO-PMT-RCVD-2 (#I1)
      MOVE EDITED #PASSED-LPO-INT (EM=ZZZZZ.99) TO #HOLD-EDIT-INT
    END-IF
*
    PERFORM DO-BOTTOM-OF-LPX
*
    COMPRESS 'This correspondence has been prepared by the Policy'
      'Services Team.' INTO #AD-FF-24     /* DW3
*   MOVE 13 TO #I2
*   PERFORM CORR-MSG-FORMAT
    PERFORM DO-LPX-SCREEN
  END-IF
END-IF
*
IF #LPF-LPV = 'F'
  MOVE TRUE TO #FOUND-LPO
  MOVE EDITED X-INTEREST-RATE (#I1) (EM=ZZ.99) TO #INT-RT
  MOVE ST-V.ISSUE-DATE (#I1) TO #YYYYMMDD
  COMPRESS #MM-A #DD-A #YYYY-A INTO #LPO-ISS-DT-DISP WITH '/'
  COMPRESS #LPO-ISS-DT-DISP '.'INTO #LPO-ISS-DT-DISP LEAVING NO
  MOVE EDITED ST-V.X-LPO-PMT-RCVD (#I1) (EM=ZZ,ZZZ.99) TO #AMOUNT
  COMPRESS 'Thank you for your payment of $' #AMOUNT ' towards your o'
    'utstanding fixed'  INTO #AD-FF-12 LEAVING NO
  COMPRESS 'loan on your AAFMAA policy' #POL-NUM 'issued'
    #LPO-ISS-DT-DISP INTO #AD-FF-13
*
  IF X-LOAN-AMOUNT (#I1) NE 0
    COMPUTE #INT-LEFT = X-LPO-PRIOR-ACC-INT (#I1)
      - X-LPO-PMT-RCVD (#I1)
    MOVE 5 TO #I2
*
    IF #INT-LEFT GT 0
      MOVE EDITED #INT-LEFT (EM=ZZ,ZZZ.99) TO #AMOUNT
      COMPRESS 'The remaining interest on your loan is $'
        #AMOUNT '.'  INTO #AD-FF-15 LEAVING NO
      ADD 1 TO #I2
    END-IF
*
    PERFORM DO-BOTTOM-OF-LPX
*
    COMPRESS 'This correspondence has been prepared by the Policy'
      'Services Team.' INTO #AD-FF-24     /* DW3
*   MOVE 13 TO #I2
*   PERFORM CORR-MSG-FORMAT
    PERFORM DO-LPX-SCREEN
  ELSE
    COMPUTE #INT-LEFT = X-LPO-PRIOR-LOAN-BAL (#I1)
      + X-LPO-PRIOR-ACC-INT (#I1)
      - X-LPO-PMT-RCVD (#I1)
    IF   (#INT-LEFT LT 5.00) AND (#INT-LEFT GT -5.00)
      RESET #PASSED-LPO-INT
    ELSE
      COMPUTE #PASSED-LPO-INT = X-LPO-PRIOR-LOAN-BAL (#I1)
        + X-LPO-PRIOR-ACC-INT (#I1) - X-LPO-PMT-RCVD (#I1)
      MOVE EDITED #PASSED-LPO-INT (EM=ZZZZZ.99) TO #HOLD-EDIT-INT
    END-IF
*
    PERFORM DO-BOTTOM-OF-LPX
*
    COMPRESS 'This correspondence has been prepared by the Policy'
      'Services Team.' INTO #AD-FF-24     /* DW3
*   MOVE 13 TO #I2
*   PERFORM CORR-MSG-FORMAT
    PERFORM DO-LPX-SCREEN
  END-IF
END-IF
*
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE DO-BOTTOM-OF-LPX
* * * * * * * * * * * * * * * * * *
IF #FOUND-LPO
  COMPRESS #INT-RT '%' INTO #INT-RT LEAVING NO
  IF  ((#SCR-SUFFIX-3 = 'V') AND (X-LOAN-AMOUNT-2 (#I1) NE 0))
      OR ((#SCR-SUFFIX-3 = 'F') AND (X-LOAN-AMOUNT   (#I1) NE 0))
    COMPRESS 'Annual interest accrues daily at a' #INT-RT #FIX-VAR-LBL
      'interest rate and is based' INTO #AD-FF-16
    MOVE   'on your current loan principal.' TO #AD-FF-17
  ELSE
    IF #PASSED-LPO-INT LT 0
*     COMPRESS 'There is an credit of $' #HOLD-EDIT-INT
*                                            INTO #AD-FF-14 LEAVING NO
*     COMPRESS #AD-FF-14 'due you.'
*                                INTO #AD-FF-14
      IGNORE
    ELSE
      IF   (#PASSED-LPO-INT LT 5.00)
          AND (#PASSED-LPO-INT GT 0)
        COMPRESS 'Interest due of $' #HOLD-EDIT-INT
          INTO #AD-FF-14 LEAVING NO
        COMPRESS #AD-FF-14 'remains. If your check is not received'
          'within 30'               INTO #AD-FF-14
        COMPRESS 'days, this amount will simply be carried as a debit'
          'on your account.'              INTO #AD-FF-15
      ELSE
        IF #PASSED-LPO-INT GE 5.00
          COMPRESS 'Interest due of $' #HOLD-EDIT-INT
            INTO #AD-FF-14 LEAVING NO
          COMPRESS #AD-FF-14 'remains.'      INTO #AD-FF-14
          COMPRESS 'Please remit the amount to fully pay off your loan'
            'account.'                       INTO #AD-FF-15
        END-IF
      END-IF
    END-IF
  END-IF
*
  MOVE 'The breakdown of your payment is as follows:' TO #AD-FF-18
  RESET #INT-NEG
  IF #LPF-LPV = 'V'
    MOVE 'Prior Principal Loan Balance   $' TO #HEADER
    MOVE EDITED X-LPO-PRIOR-LOAN-BAL-2 (#I1) (EM=ZZ,ZZZ.99) TO #AMOUNT
    MOVE #LPO-LINE TO #AD-FF-19
*
    IF X-LPO-PMT-RCVD-2 (#I1) GT X-LPO-PRIOR-ACC-INT-2 (#I1)
      IF X-LPO-PRIOR-ACC-INT-2 (#I1) LT 0
        MOVE TRUE TO #INT-NEG
        MOVE X-LPO-PMT-RCVD-2 (#I1) TO #PRIN-PMT
        MOVE X-LPO-PRIOR-ACC-INT-2 (#I1) TO #INT-PMT
      ELSE
        COMPUTE #PRIN-PMT = X-LPO-PMT-RCVD-2      (#I1)
          - X-LPO-PRIOR-ACC-INT-2 (#I1)
        MOVE X-LPO-PRIOR-ACC-INT-2 (#I1) TO #INT-PMT
      END-IF
    ELSE
      RESET #PRIN-PMT
      MOVE X-LPO-PMT-RCVD-2 (#I1) TO  #INT-PMT
    END-IF
*
    RESET #CRED-ON-ACCT
    IF #PRIN-PMT GT X-LPO-PRIOR-LOAN-BAL-2 (#I1)
      COMPUTE #CRED-ON-ACCT = #PRIN-PMT - X-LPO-PRIOR-LOAN-BAL-2 (#I1)
      MOVE X-LPO-PRIOR-LOAN-BAL-2 (#I1) TO #PRIN-PMT
    END-IF
*
    MOVE 'Loan Principal Payment         $' TO #HEADER
    MOVE EDITED #PRIN-PMT (EM=ZZ,ZZZ.99) TO #AMOUNT
    MOVE #LPO-LINE TO #AD-FF-20
*
    IF #INT-NEG
      MOVE 'Accrued Interest Credit        $' TO #HEADER
    ELSE
      MOVE 'Accrued Interest Payment       $' TO #HEADER
    END-IF
*
    IF #INT-PMT LT 0
      MOVE EDITED #INT-PMT (EM=-Z,ZZZ.99) TO #AMOUNT
    ELSE
      MOVE EDITED #INT-PMT (EM=ZZ,ZZZ.99) TO #AMOUNT
    END-IF
    MOVE #LPO-LINE TO #AD-FF-21
*
    MOVE 'Remaining Loan Principal       $' TO #HEADER
    MOVE EDITED X-LOAN-AMOUNT-2 (#I1) (EM=ZZ,ZZZ.99) TO #AMOUNT
    MOVE #LPO-LINE TO #AD-FF-22
  ELSE    /*LPF
    MOVE 'Prior Principal Loan Balance   $' TO #HEADER
    MOVE EDITED X-LPO-PRIOR-LOAN-BAL (#I1) (EM=ZZ,ZZZ.99) TO #AMOUNT
    MOVE #LPO-LINE TO #AD-FF-19
*
    IF X-LPO-PMT-RCVD (#I1) GT X-LPO-PRIOR-ACC-INT (#I1)
      IF X-LPO-PRIOR-ACC-INT (#I1) LT 0
        MOVE TRUE TO #INT-NEG
        MOVE X-LPO-PMT-RCVD (#I1) TO #PRIN-PMT
        MOVE X-LPO-PRIOR-ACC-INT (#I1) TO #INT-PMT
      ELSE
        COMPUTE #PRIN-PMT = X-LPO-PMT-RCVD      (#I1)
          - X-LPO-PRIOR-ACC-INT (#I1)
        MOVE X-LPO-PRIOR-ACC-INT (#I1) TO #INT-PMT
      END-IF
    ELSE
      RESET #PRIN-PMT
      MOVE X-LPO-PMT-RCVD (#I1) TO #INT-PMT
    END-IF
*
    RESET #CRED-ON-ACCT
    IF #PRIN-PMT GT X-LPO-PRIOR-LOAN-BAL (#I1)
      COMPUTE #CRED-ON-ACCT = #PRIN-PMT - X-LPO-PRIOR-LOAN-BAL (#I1)
      MOVE X-LPO-PRIOR-LOAN-BAL (#I1) TO #PRIN-PMT
    END-IF
*
    MOVE 'Loan Principal Payment         $' TO #HEADER
    MOVE EDITED #PRIN-PMT (EM=ZZ,ZZZ.99) TO #AMOUNT
    MOVE #LPO-LINE TO #AD-FF-20
*
    IF #INT-NEG
      MOVE 'Accrued Interest Credit        $' TO #HEADER
    ELSE
      MOVE 'Accrued Interest Payment       $' TO #HEADER
    END-IF
*
    IF #INT-PMT LT 0
      MOVE EDITED #INT-PMT (EM=-Z,ZZZ.99) TO #AMOUNT
    ELSE
      MOVE EDITED #INT-PMT (EM=ZZ,ZZZ.99) TO #AMOUNT
    END-IF
    MOVE #LPO-LINE TO #AD-FF-21
*
    MOVE 'Remaining Loan Principal       $' TO #HEADER
    MOVE EDITED X-LOAN-AMOUNT (#I1) (EM=ZZ,ZZZ.99) TO #AMOUNT
    MOVE #LPO-LINE TO #AD-FF-22
  END-IF
*
  IF #CRED-ON-ACCT NE 0
    MOVE 'Credit on Account              $' TO #HEADER
    MOVE EDITED #CRED-ON-ACCT (EM=ZZ,ZZZ.99) TO #AMOUNT
    MOVE #LPO-LINE TO #AD-FF-23
  ELSE
    IF  ((#SCR-SUFFIX-3 = 'V') AND (X-LOAN-AMOUNT-2 (#I1) = 0))
        OR ((#SCR-SUFFIX-3 = 'F') AND (X-LOAN-AMOUNT   (#I1) = 0))
      MOVE 'The loan has been paid in full.' TO #AD-FF-23
    END-IF
  END-IF
* IF #PASSED-LPO-INT NE 0   /* removed 5/14/2004 ALB
*   IF #PASSED-LPO-INT LT 0
*     MOVE 'Credit Balance                 $' TO #HEADER
*   ELSE
*     IF #PASSED-LPO-INT GT +5.00
*       MOVE 'Balance Due                    $' TO #HEADER
*     ELSE
*       MOVE 'Carried as Debit               $' TO #HEADER
*     END-IF
*   END-IF
*
*   MOVE EDITED #PASSED-LPO-INT (EM=ZZ,ZZZ.99) TO #AMOUNT
*   MOVE #LPO-LINE TO #AD-FF-23
* END-IF
ELSE
  MOVE 'Thank you for the check in payment of '-
    'your outstanding loan.' TO #AD-FF-12
*
  IF #PASSED-LPO-INT < -5.00
    COMPRESS #LPOTEXT3 #HOLD-EDIT-INT #LPOTEXT4 INTO #AD-FF-13
  ELSE
    IF #PASSED-LPO-INT < 0
      COMPRESS #LPOTEXT5 #HOLD-EDIT-INT #LPOTEXT6 INTO #AD-FF-13
      COMPRESS #LPOTEXT7A #LPOTEXT8 INTO #AD-FF-14
    ELSE
      IF #PASSED-LPO-INT < 5.00
        COMPRESS #LPOTEXT9 #HOLD-EDIT-INT #LPOTEXT10    INTO #AD-FF-13
        COMPRESS #LPOTEXT7 #LPOTEXT12                   INTO #AD-FF-14
      ELSE
        COMPRESS #LPOTEXT9 #HOLD-EDIT-INT #LPOTEXT10A INTO #AD-FF-13
        MOVE 'Please remit the amount to fully pay'-
          ' off your loan account.' TO #AD-FF-14
      END-IF
    END-IF
  END-IF
END-IF
*
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * *   NG1 added from AFSC-SVC
DEFINE SUBROUTINE DOP-PROCESS
* * * * * * * * * * * * * * * * *
*
PERFORM CORR-MSG-FORMAT
RESET #AD-TABLE (13)
MOVE 'Your change of rank has been noted on our records.'-
  ' Please advise us of' TO #AD-FF-14
MOVE 'your date of promotion.' TO #AD-FF-15
MOVE 'Thank you.' TO #AD-FF-17
COMPRESS #CLERK-ABB-NAME-PASS INTO #AD-FF-19
MOVE 'AAFMAA Financial Advisors' TO #AD-FF-20
*
END-SUBROUTINE /* (0678)
*
*****************
define subroutine find-owner                               /* vt2 \/
*****************
*
if *device = 'BATCH'
  callnat'Gownrsxx' #id-num #non-ins-owner #multi-owner #owner-occ-9(*)
  for #k 1 9
    if #k = #i1
      if #owner-cn(#k,1) ne #id-num
        move #id-num to #cn
        move #ext-formated-name to #cn-name
        #cn-name:=
          FUNCTION-FRM-NAME(<st-v.member-contact-id,#FIRST-NAME,#MIDDLE-NAME,#LAST-NAME-f,#SUFFIX-f>)
*
        compress 'For' #cn-name into #addr-msg(1)
        compress 'With CN' #id-num into #addr-msg (2)
*
        move #owner-cn (#k,1) to #id-num
        find stat with stat.id-number= #id-num
          move '!LETTER' to #p-name                           /* bz-Name-C
          CALLNAT 'GPRS0CNT' stat.MEMBER-CONTACT-ID #p-name
          move #p-name to  #EXT-FORMATED-NAME
*
          reset #pda-address
          move stat.member-contact-id to #add-contact-id
          move 'P' to #add-type
          callnat 'addn0001'  #pda-address
          #first-address  := #add-line-1
          #second-address := #add-line-2
          #third-address  := #add-line-3
*
          #LEFT           := #FIRST-ADDRESS
          #RIGHT          := *TRIM(#ADDR-MSG (1))
          #RESULT         := #LEFT
          #I              := 70 - *LENGTH(#RIGHT)
          MOVE #RIGHT TO SUBSTRING(#RESULT,#I)
          #FIRST-ADDRESS  := #RESULT
*
          #LEFT           := #SECOND-ADDRESS
          #RIGHT          := *TRIM (#ADDR-MSG (2))
          #RESULT         := #LEFT
          #I              := 70 - *LENGTH(#RIGHT)
          MOVE #RIGHT TO SUBSTRING(#RESULT,#I)
          #SECOND-ADDRESS := #RESULT
*
          reset #id-num
        end-find
      end-if
    end-if
  end-for
end-if
*
end-subroutine
*
END
