* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: G4102PMS  ** NEW month-end file stats **
*******************************************
*                       MODIFICATION LOG
* USER DATE     TAG  REASON
* DRW  03162005 DW1  Accum Ins in Force Total & remove Other Total
* DRW  04126005 DW2  ADD AL ACCUMS & TOTALS
* PAM  08312005 PM3  Expanded Current Plan Total field from P5 to P7
* DRW 08/23/2008 DW4 Generations Plus statistics
* PAM 12/30/2011 PM5 Expanded Current Lives Total field from P5 to P7
* RSE 11/08/2012 RE1 Screen modifications for LT II Annual Renewable Requirements
*                    Added new plans (LT II AR & EZ Term (EZ))
*******************************************
*
* MODIFICATIONS:
*
DEFINE DATA
GLOBAL USING BCOMMGXX WITH MASTER-BLOCK
LOCAL USING GONERLXX        /* WORK FIELDS FOR 'GONERCXX'
LOCAL
1 #DATN-DISP  (A11)
1 MS-V VIEW OF A-MBRSHIP-STATS
 2 M-E-INS-BY-FACE  (8,4)
 2 M-E-INS-BY-FACE-CAPS (8)
 2 M-E-PLANS-BY-FACE (8, 4)
 2 M-E-PLANS-BY-FACE-CAPS (8)
 2 M-E-PLANS-BY-TYPE (14, 4)    /* DW2   Was 11/4    DW4  RE1 was 12
 2 M-E-PLANS-BY-TYPE-CAPS (14)  /* DW2   Was 11      DW4  RE1 was 12
 2 M-E-PU-PLANS-BY-TYPE (9, 4)  /* DW2   Was 8       DW4
 2 M-E-PP-PLANS-BY-MODE (3, 4)
 2 M-E-INS-BY-AGE (10, 4)
*
 2 M-E-DB-BY-TYPE (14, 4)       /* DW2   Was 10      DW4   RE1 Was 12
 2 M-E-FSO-BY-STAT (3)
 2 M-E-FSO-BY-RANK (3)
 2 M-E-FSO-BY-SEX  (2)
 2 M-E-FSO-BY-AGE  (8)
 2 M-E-FSO-BY-SERV (9)
*
 2 ME-PAID-DB
 2 ME-ETI-DB
 2 ME-INS-IN-FORCE
*
 2 ME-INS-ONLY-BY-PLAN    (14) /*(OL/30/20/7P/FLX/NSP/RT/LT/VT/AL/???/GPL) DW2 DW4   RE1 was  12 LT2AR, EZ added
 2 ME-FBR-BY-SVC          (3)   /* (A/F/ALL ELSE)
 2 ME-FBR-BY-RANK         (3)   /* (OFF/NCO/WO)
 2 ME-FBR-BY-OWNER        (2)   /* (MBR/SPS)
*
 2 EMP-INS-BY-FACE      (8, 3)
 2 EMP-PLANS-BY-FACE    (8, 3)
 2 EMP-PLANS-BY-TYPE    (11, 3)   /* DW2
*
1 #SCR-M-E-DB-BY-TYPE           (N12/14, 4)                /* DW4    RE1 from 12 to 14 
1 REDEFINE #SCR-M-E-DB-BY-TYPE
 2 #SCR-M-E-DB-BY-TYPE-1        (N12/14, 4)                /* DW4    OL 
1 REDEFINE #SCR-M-E-DB-BY-TYPE
 2 #SCR-M-E-DB-BY-TYPE-2        (N12/14, 4)                /* DW4    RT
1 REDEFINE #SCR-M-E-DB-BY-TYPE
 2 #SCR-M-E-DB-BY-TYPE-3        (N12/14, 4)                /* DW4    NMT
1 REDEFINE #SCR-M-E-DB-BY-TYPE
 2 #SCR-M-E-DB-BY-TYPE-4        (N12/14, 4)                /* DW4    LT
1 REDEFINE #SCR-M-E-DB-BY-TYPE
 2 #SCR-M-E-DB-BY-TYPE-5        (N12/14, 4)                /* DW4    LT2
1 REDEFINE #SCR-M-E-DB-BY-TYPE
 2 #SCR-M-E-DB-BY-TYPE-6        (N12/14, 4)                /* DW4    LT2AR
1 REDEFINE #SCR-M-E-DB-BY-TYPE
 2 #SCR-M-E-DB-BY-TYPE-7        (N12/14, 4)                /* DW4    AL
1 REDEFINE #SCR-M-E-DB-BY-TYPE
 2 #SCR-M-E-DB-BY-TYPE-8        (N12/14, 4)                /* DW4    GPL
1 REDEFINE #SCR-M-E-DB-BY-TYPE
 2 #SCR-M-E-DB-BY-TYPE-9        (N12/14, 4)                /* DW4    SO
*
1 #SCR-M-E-DB-BY-TYPE-1-5       (N12/4)                    /* RE1 
*
1 #M-E-DB-BY-TYPE-TOT (P11.2/14)   /* DW2    DW4           RE1 from 12 to 14 
1 REDEFINE #M-E-DB-BY-TYPE-TOT
 2 #M-E-DB-BY-TYPE-TOT-1  (P11.2/14)
1 REDEFINE #M-E-DB-BY-TYPE-TOT
 2 #M-E-DB-BY-TYPE-TOT-2  (P11.2/14)
1 REDEFINE #M-E-DB-BY-TYPE-TOT
 2 #M-E-DB-BY-TYPE-TOT-3  (P11.2/14)
1 REDEFINE #M-E-DB-BY-TYPE-TOT
 2 #M-E-DB-BY-TYPE-TOT-4  (P11.2/14)
1 REDEFINE #M-E-DB-BY-TYPE-TOT
 2 #M-E-DB-BY-TYPE-TOT-5  (P11.2/14)
1 REDEFINE #M-E-DB-BY-TYPE-TOT
 2 #M-E-DB-BY-TYPE-TOT-6  (P11.2/14)
1 REDEFINE #M-E-DB-BY-TYPE-TOT
 2 #M-E-DB-BY-TYPE-TOT-7  (P11.2/14)
1 REDEFINE #M-E-DB-BY-TYPE-TOT
 2 #M-E-DB-BY-TYPE-TOT-8  (P11.2/14)
1 REDEFINE #M-E-DB-BY-TYPE-TOT
 2 #M-E-DB-BY-TYPE-TOT-9  (P11.2/14)
*
1 #M-E-DB-BY-TYPE-TOT-1-5 (P11.2)   /* RE1
*
1 #SCR-M-E-PLANS-BY-TYPE   (N7/14, 4)      /* RE1 was 12                     /* DW4
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE
 2 #SCR-M-E-PLANS-BY-TYPE-1  (N7/14, 4)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE
 2 #SCR-M-E-PLANS-BY-TYPE-2  (N7/14, 4)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE
 2 #SCR-M-E-PLANS-BY-TYPE-3  (N7/14, 4)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE
 2 #SCR-M-E-PLANS-BY-TYPE-4  (N7/14, 4)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE
 2 #SCR-M-E-PLANS-BY-TYPE-5  (N7/14, 4)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE
 2 #SCR-M-E-PLANS-BY-TYPE-6  (N7/14, 4)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE
 2 #SCR-M-E-PLANS-BY-TYPE-7  (N7/14, 4)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE
 2 #SCR-M-E-PLANS-BY-TYPE-8  (N7/14, 4)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE
 2 #SCR-M-E-PLANS-BY-TYPE-9  (N7/14, 4)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE
 2 #SCR-M-E-PLANS-BY-TYPE-10 (N7/14, 4)
*
1 #SCR-M-E-PLANS-BY-TYPE-1-5-A (N7)         /* RE1 OL/30P/20P/7P/FLEX (MBR)
1 #SCR-M-E-PLANS-BY-TYPE-1-5-B (N7/3)       /* RE1 OL/30P/20P/7P/FLEX (SPS,KIDS,GKIDS)
* 
1 #SCR-ME-INS-ONLY-BY-PLAN    (N7/14)       /* DW4   RE1 was 12
1 REDEFINE #SCR-ME-INS-ONLY-BY-PLAN
 2 #SCR-ME-INS-ONLY-BY-PLAN-1 (N7/14)
1 REDEFINE #SCR-ME-INS-ONLY-BY-PLAN
 2 #SCR-ME-INS-ONLY-BY-PLAN-2 (N7/14)
1 REDEFINE #SCR-ME-INS-ONLY-BY-PLAN
 2 #SCR-ME-INS-ONLY-BY-PLAN-3 (N7/14)
1 REDEFINE #SCR-ME-INS-ONLY-BY-PLAN
 2 #SCR-ME-INS-ONLY-BY-PLAN-4 (N7/14)
1 REDEFINE #SCR-ME-INS-ONLY-BY-PLAN
 2 #SCR-ME-INS-ONLY-BY-PLAN-5 (N7/14)
1 REDEFINE #SCR-ME-INS-ONLY-BY-PLAN
 2 #SCR-ME-INS-ONLY-BY-PLAN-6 (N7/14)
1 REDEFINE #SCR-ME-INS-ONLY-BY-PLAN
 2 #SCR-ME-INS-ONLY-BY-PLAN-7 (N7/14)
*
1 #SCR-ME-INS-ONLY-BY-PLAN-1-5(N7)          /* RE1
*
1 #SCR-M-E-PU-PLANS-BY-TYPE   (N7/9, 4)     /* DW4
1 REDEFINE #SCR-M-E-PU-PLANS-BY-TYPE 
 2 #SCR-M-E-PU-PLANS-BY-TYPE-1 (N7/9, 4)
1 REDEFINE #SCR-M-E-PU-PLANS-BY-TYPE
 2 #SCR-M-E-PU-PLANS-BY-TYPE-2 (N7/9, 4)
* 
1 #SCR-M-E-PLANS-BY-TYPE-CAPS (N7/14)      /* DW4   RE1 was 12
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE-CAPS
 2 #SCR-M-E-PLANS-BY-TYPE-CAPS-1  (N7/14)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE-CAPS
 2 #SCR-M-E-PLANS-BY-TYPE-CAPS-2  (N7/14)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE-CAPS
 2 #SCR-M-E-PLANS-BY-TYPE-CAPS-3  (N7/14)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE-CAPS
 2 #SCR-M-E-PLANS-BY-TYPE-CAPS-4  (N7/14)
1 REDEFINE #SCR-M-E-PLANS-BY-TYPE-CAPS
 2 #SCR-M-E-PLANS-BY-TYPE-CAPS-5  (N7/14)
*
1 #SCR-M-E-PLANS-BY-TYPE-CAPS-1-5 (N7)      /* DW4
*
1 #SCR-TOT-INS-ONLY        (P5)
1 #SCR-TOT-INS-ONLY-2      (P5)    /* RE1
1 #SCR-TOT-FBR             (P5)
1 #SCR-PAID-UP-DB          (P11)
1 #SCR-ETI-DB              (P11)
1 #SCR-INS-IN-FORCE        (P12)
1 #SCR-LST-YR-INS-IN-FORCE (P12)
1 #M-E-INS-BY-FACE-TOT  (P7/8)
1 #M-E-INS-BY-INS-TOT   (P7/4)
1 #M-E-INS-BY-FACE-CAPS-TOT (P7)
1 #M-E-INS-BY-FACE-TOT-TOT (P7)
*
1 #M-E-PLANS-BY-FACE-TOT  (P7/8)
1 #M-E-PLANS-BY-PLANS-TOT   (P7/4)
1 #M-E-PLANS-BY-FACE-CAPS-TOT (P7)
1 #M-E-PLANS-BY-FACE-TOT-TOT (P7)
*
1 #M-E-PLANS-BY-TYPE-TOT-1-5  (P7)   /* RE1
1 #M-E-PLANS-BY-TYPE-TOT  (P7/14)   /* DW2    DW4   RE1 was 12
1 #M-E-PLANS-BY-PLANS-T-TOT   (P7/4)
1 #M-E-PLANS-BY-PLANS-T-TOT-2 (P7/4) /* RE1
1 #M-E-PLANS-BY-TYPE-CAPS-TOT (P7)
1 #M-E-PLANS-BY-TYPE-CAPS-TOT-2 (P7)  /* RE1
1 #M-E-PLANS-BY-TYPE-TOT-TOT (P7)
1 #M-E-PLANS-BY-TYPE-TOT-TOT-2 (P7)   /* RE1
*
1 #M-E-PU-PLANS-BY-TYPE-TOT  (P7/9)   /* DW2   DW4
1 #M-E-PU-PLANS-BY-PLANS-TOT   (P7/4)
1 #M-E-PU-PLANS-BY-TYPE-TOT-TOT (P7)
*
1 #M-E-PP-PLANS-BY-MODE-TOT  (P7/3)
1 #M-E-PP-PLANS-BY-PLANS-TOT   (P7/4)
1 #M-E-PP-PLANS-BY-MODE-TOT-TOT (P7)
*
1 #M-E-INS-BY-AGE-TOT  (P7/10)
1 #M-E-INS-BY-PLANS-A-TOT   (P7/4)
1 #M-E-INS-BY-AGE-TOT-TOT (P7)
*
1 #M-E-DB-BY-TYPE-T-TOT (P11.2/4)
1 #M-E-DB-BY-TYPE-T-TOT-1-5 (P11.2/4)  /* RE1 OL/30P/20P/7P/FLX
*
1 #M-E-DB-BY-TYPE-TOT-TOT (P11.2)
1 #M-E-DB-BY-TYPE-TOT-TOT-1-5 (P11.2)  /* RE1 OL/30P/20P/7P/FLX  
1 #M-E-DB-BY-TYPE-TOT-TOT-TOT (P11.2)   /* DW1
1 #LST-YR-DB-BY-TYPE-TOT-TOT-TOT (P11.2)   /* DW1
1 #M-E-TOT-FSO            (P7)
1 #M-E-TOT-SO             (P7)
1 #M-E-TOT-FSO-SO         (P7)
*
1 #EMP-INS-BY-FACE-TOT    (P3/3)
1 #EMP-PLANS-BY-FACE-TOT  (P3/3)
*
1 #DATN-YYYYMMDD      (N8)
1 REDEFINE #DATN-YYYYMMDD
 2 #DATN-YYYYMM       (N6)
 2 #DATN-DD           (N2)
1 REDEFINE #DATN-YYYYMMDD
 2 #DATN-YYYY-A       (A4)
 2 #DATN-MM           (N2)
 2 #DATN-DD-A         (A2)
*
1 #WORK-YYYYMM        (N6)
1 REDEFINE #WORK-YYYYMM
 2 #WORK-YYYY         (N4)
 2 #WORK-MM           (N2)
*
1 #YYYYMMDD           (N8)
1 REDEFINE #YYYYMMDD
 2 #YYYYMM            (N6)
 2 REDEFINE #YYYYMM
  3 #YYYY             (N4)
  3 #MM               (N2)
 2 #DD                (N2)
*
1 #W-YYYYMM    (N6)
1 REDEFINE #W-YYYYMM
 2 #W-YYYY  (N4)
 2 #W-MM    (N2)
*
1 #SCR-CURR-DD               (N2)
1 #SCR-CURR-MONTH            (A3)
1 #SCR-CURR-MM               (N2)
1 #SCR-CURR-YEAR             (N4)
1 REDEFINE #SCR-CURR-YEAR
 2 #SCR-CURR-CENT            (N2)
 2 #SCR-CURR-YY              (N2)
1 #SCR-LAST-MONTH            (A3)
1 #SCR-LAST-MM               (N2)
1 #SCR-LAST-MONTH-LAST-YEAR  (N4)
1 #SCR-NEXT-MONTH            (A3)
1 #SCR-NEXT-MONTH-YEAR       (N4)
1 #SCR-LAST-YEAR             (N4)
*
1 #I1     (I2)
1 #TEXT   (A75)
*
1 #MONTH-G (A48)
           INIT <'Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec '>
1 REDEFINE #MONTH-G
 2 #MONTH-OCC     (12)
  3 #MONTH        (A3)
  3 #FILL         (A1)
*
1 #CURR-MONTH  (L)
1 #SCR-CURR-LINE (A78)
1 #SCR-NET-GAIN-MBRS   (P5)
1 #SCR-NET-GAIN-SG     (P5)
1 #SCR-NET-GAIN-PLANS  (P5)
1 #LAST-ME-MM          (N2)
1 #LAST-ME-MONTH       (A3)
1 #LAST-ME-YYYY        (N4)
1 #CURR-MBRS           (P5)
1 #CURR-S-G            (P5)
1 #CURR-LIVES          (P7) /* PM5
1 #CURR-PLANS          (P7) /* PM3
*
*****************************************************
1 #ME-EMP-INS-BY-INS-TOT       (P3/3)
1 #ME-EMP-PLANS-BY-PLANS-TOT   (P3/3)
1 #ME-EMP-PLANS-BY-PLANS-T-TOT (P3/3)
*****************************************************
END-DEFINE
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
INCLUDE GONERCXX            /* NATURAL ERROR ROUTINE
*
INPUT #YYYYMM
  #SCR-NET-GAIN-MBRS
  #SCR-NET-GAIN-SG
  #SCR-NET-GAIN-PLANS
MOVE *DATN TO #DATN-YYYYMMDD
COMPRESS #DATN-DD-A #MONTH (#DATN-MM) #DATN-YYYY-A INTO #DATN-DISP
*
MOVE TRUE TO #CURR-MONTH
IF  (#DATN-YYYYMM NE #YYYYMM)    /* NOT CURRENT MONTH
  RESET #CURR-MONTH
  ADD 1 TO #MM
  IF #MM GT 12
    MOVE 1 TO #MM
    ADD 1 TO #YYYY
  END-IF
END-IF
*
MOVE #YYYY TO #SCR-CURR-YEAR
MOVE #MM   TO #SCR-CURR-MM
MOVE #MONTH (#MM) TO #SCR-CURR-MONTH
MOVE #YYYY TO #SCR-LAST-YEAR
*
IF #MM = 1
  SUBTRACT 2 FROM #SCR-LAST-YEAR
ELSE
  SUBTRACT 1 FROM #SCR-LAST-YEAR
END-IF
*
MOVE #SCR-CURR-YEAR TO #LAST-ME-YYYY
COMPUTE #LAST-ME-MM = #SCR-CURR-MM - 1
IF #LAST-ME-MM LT 1
  MOVE 12 TO #LAST-ME-MM
  SUBTRACT 1 FROM #LAST-ME-YYYY
END-IF
MOVE #MONTH (#LAST-ME-MM) TO #LAST-ME-MONTH
*
* * * * * GET LAST YEARS STATISTICS RECORD * * * * *
*
MOVE #YYYYMM TO #W-YYYYMM
SUBTRACT 1 FROM #W-YYYY
*
FIND (1) MS-V WITH MONTH-KEY = #W-YYYYMM
*  MOVE ROUNDED ME-INS-IN-FORCE TO #SCR-LST-YR-INS-IN-FORCE
  ADD M-E-DB-BY-TYPE (*, *)   TO #LST-YR-DB-BY-TYPE-TOT-TOT-TOT  /* DW1
END-FIND
*
* * * * * GET CURRENT YEARS STATISTICS RECORD * * * * *
*
FIND (1) MS-V WITH MONTH-KEY = #YYYYMM
  MOVE M-E-DB-BY-TYPE         (*, *) TO #SCR-M-E-DB-BY-TYPE         (*, *)
  FOR #I1 1 TO 4                                                             /* RE1
    ADD M-E-DB-BY-TYPE        (1:5, #I1) TO #SCR-M-E-DB-BY-TYPE-1-5 (#I1)    /* RE1
  END-FOR                                                                    /* RE1
  MOVE M-E-PLANS-BY-TYPE      (*, *) TO #SCR-M-E-PLANS-BY-TYPE      (*, *)
  ADD M-E-PLANS-BY-TYPE       (1:5, 1) TO #SCR-M-E-PLANS-BY-TYPE-1-5-A          /* RE1
  FOR #I1 2 TO 4                                                                /* RE1
    ADD M-E-PLANS-BY-TYPE     (1:5, #I1) TO #SCR-M-E-PLANS-BY-TYPE-1-5-B (#I1 - 1)  /* RE1
  END-FOR                                                                       /* RE1
  MOVE ME-INS-ONLY-BY-PLAN    (*)    TO #SCR-ME-INS-ONLY-BY-PLAN    (*)
  ADD ME-INS-ONLY-BY-PLAN     (1:5)  TO #SCR-ME-INS-ONLY-BY-PLAN-1-5         /* RE1
  MOVE M-E-PLANS-BY-TYPE-CAPS (*)    TO #SCR-M-E-PLANS-BY-TYPE-CAPS (*)
  ADD M-E-PLANS-BY-TYPE-CAPS  (1:5)  TO #SCR-M-E-PLANS-BY-TYPE-CAPS-1-5      /* RE1
  MOVE M-E-PU-PLANS-BY-TYPE   (*, *) TO #SCR-M-E-PU-PLANS-BY-TYPE   (*, *)
*
  MOVE ROUNDED ME-INS-IN-FORCE TO #SCR-INS-IN-FORCE
  MOVE ROUNDED ME-PAID-DB      TO #SCR-PAID-UP-DB
  MOVE ROUNDED ME-ETI-DB       TO #SCR-ETI-DB
*
  FOR #I1 1 TO 8
    ADD M-E-INS-BY-FACE   (#I1, *) TO #M-E-INS-BY-FACE-TOT (#I1)
    ADD M-E-PLANS-BY-FACE (#I1, *) TO #M-E-PLANS-BY-FACE-TOT (#I1)
  END-FOR
*
  FOR #I1 1 TO 4
    ADD M-E-INS-BY-FACE   (*, #I1) TO #M-E-INS-BY-INS-TOT   (#I1)
    ADD M-E-PLANS-BY-FACE (*, #I1) TO #M-E-PLANS-BY-PLANS-TOT (#I1)
  END-FOR
*
  ADD #M-E-INS-BY-FACE-TOT (*) TO #M-E-INS-BY-FACE-TOT-TOT
  ADD #M-E-PLANS-BY-PLANS-TOT (*) TO #M-E-PLANS-BY-FACE-TOT-TOT
  ADD M-E-INS-BY-FACE-CAPS (*) TO #M-E-INS-BY-FACE-CAPS-TOT
  ADD M-E-PLANS-BY-FACE-CAPS (*) TO #M-E-PLANS-BY-FACE-CAPS-TOT
*
  FOR #I1 1 TO 14   /* DW2     Was 11      DW4    RE1 was 12
    ADD M-E-PLANS-BY-TYPE (#I1, *) TO #M-E-PLANS-BY-TYPE-TOT (#I1)
  END-FOR
  ADD #M-E-PLANS-BY-TYPE-TOT (1:5) TO #M-E-PLANS-BY-TYPE-TOT-1-5        /* RE1
*
  FOR #I1 1 TO 4
    ADD M-E-PLANS-BY-TYPE (*, #I1) TO #M-E-PLANS-BY-PLANS-T-TOT (#I1)
  END-FOR
*
  FOR #I1 1 TO 4                                                         /* RE1
    ADD M-E-PLANS-BY-TYPE (1:5, #I1) TO #M-E-PLANS-BY-PLANS-T-TOT-2 (#I1)  /* RE1
  END-FOR                                                                /* RE1
*
  ADD #M-E-PLANS-BY-TYPE-TOT (*) TO #M-E-PLANS-BY-TYPE-TOT-TOT
  ADD #M-E-PLANS-BY-TYPE-TOT (1:5) TO #M-E-PLANS-BY-TYPE-TOT-TOT-2  /* RE1
  ADD M-E-PLANS-BY-TYPE-CAPS (*) TO #M-E-PLANS-BY-TYPE-CAPS-TOT
  ADD M-E-PLANS-BY-TYPE-CAPS (1:5) TO #M-E-PLANS-BY-TYPE-CAPS-TOT-2   /* RE1
*
  FOR #I1 1 TO 9  /* DW2    Was 8    DW4
    ADD M-E-PU-PLANS-BY-TYPE (#I1, *) TO #M-E-PU-PLANS-BY-TYPE-TOT (#I1)
  END-FOR
*
  FOR #I1 1 TO 4
    ADD M-E-PU-PLANS-BY-TYPE (*, #I1) TO #M-E-PU-PLANS-BY-PLANS-TOT(#I1)
  END-FOR
*
  ADD #M-E-PU-PLANS-BY-TYPE-TOT (*) TO #M-E-PU-PLANS-BY-TYPE-TOT-TOT
*
  FOR #I1 1 TO 3
    ADD M-E-PP-PLANS-BY-MODE (#I1, *) TO #M-E-PP-PLANS-BY-MODE-TOT (#I1)
  END-FOR
*
  FOR #I1 1 TO 4
    ADD M-E-PP-PLANS-BY-MODE (*, #I1) TO #M-E-PP-PLANS-BY-PLANS-TOT(#I1)
  END-FOR
*
  ADD #M-E-PP-PLANS-BY-MODE-TOT (*) TO #M-E-PP-PLANS-BY-MODE-TOT-TOT
*
  FOR #I1 1 TO 10
    ADD M-E-INS-BY-AGE (#I1, *) TO #M-E-INS-BY-AGE-TOT (#I1)
  END-FOR
*
  FOR #I1 1 TO 4
    ADD M-E-INS-BY-AGE (*, #I1) TO #M-E-INS-BY-PLANS-A-TOT(#I1)
  END-FOR
*
  ADD #M-E-INS-BY-AGE-TOT (*) TO #M-E-INS-BY-AGE-TOT-TOT
*
  FOR #I1 1 TO 14   /* DW2               /* DW4    RE1 was 12                     
    ADD M-E-DB-BY-TYPE (#I1, *) TO #M-E-DB-BY-TYPE-TOT (#I1)
  END-FOR
  ADD #M-E-DB-BY-TYPE-TOT (1:5) TO #M-E-DB-BY-TYPE-TOT-1-5               /* RE1 OL/30P/20P/7P/FLEX
*
  FOR #I1 1 TO 4
    ADD M-E-DB-BY-TYPE (*, #I1) TO #M-E-DB-BY-TYPE-T-TOT(#I1)           
    ADD M-E-DB-BY-TYPE (1:5, #I1) TO #M-E-DB-BY-TYPE-T-TOT-1-5(#I1)      /* RE1 OL/30P/20P/7P/FLEX       
  END-FOR
*
  ADD M-E-DB-BY-TYPE (1:7, *) TO #M-E-DB-BY-TYPE-TOT-TOT /* not SO             
  ADD M-E-DB-BY-TYPE (9:10,*) TO #M-E-DB-BY-TYPE-TOT-TOT /* lt2/AL DW2         
*  ADD M-E-DB-BY-TYPE (12,*) TO #M-E-DB-BY-TYPE-TOT-TOT   /* GPL        DW4    RE1
  ADD M-E-DB-BY-TYPE (12:14,*) TO #M-E-DB-BY-TYPE-TOT-TOT   /* GPL             RE1 NMT/LT2AR
  ADD M-E-DB-BY-TYPE (1:5, *) TO #M-E-DB-BY-TYPE-TOT-TOT-1-5 /* RE1          
  ADD M-E-DB-BY-TYPE (*, *)   TO #M-E-DB-BY-TYPE-TOT-TOT-TOT  /* DW1          RE1
  ADD M-E-FSO-BY-SEX (1:2) TO #M-E-TOT-FSO
  COMPUTE #M-E-TOT-FSO-SO = M-E-DB-BY-TYPE (8, 1) / 1000
  COMPUTE #M-E-TOT-SO = #M-E-TOT-FSO-SO - #M-E-TOT-FSO
*
  FOR #I1 1 TO 14   /* DW2          DW4         RE1 was 12
    ADD ME-INS-ONLY-BY-PLAN (#I1) TO #SCR-TOT-INS-ONLY
  END-FOR
*
  FOR #I1 1 TO 5   /* DW2          DW4                     /* RE1
    ADD ME-INS-ONLY-BY-PLAN (#I1) TO #SCR-TOT-INS-ONLY-2   /* RE1
  END-FOR                                                  /* RE1
*
  FOR #I1 1 TO 3
    ADD ME-FBR-BY-SVC (#I1) TO #SCR-TOT-FBR
    ADD EMP-INS-BY-FACE   (*,#I1) TO #EMP-INS-BY-FACE-TOT (#I1)
    ADD EMP-PLANS-BY-FACE (*,#I1) TO #EMP-PLANS-BY-FACE-TOT (#I1)
  END-FOR
END-FIND
*
COMPUTE #CURR-MBRS  = #M-E-INS-BY-INS-TOT (1) + #SCR-NET-GAIN-MBRS
COMPUTE #CURR-S-G   = #M-E-INS-BY-INS-TOT (2:4) + #SCR-NET-GAIN-SG
COMPUTE #CURR-LIVES = #CURR-MBRS + #CURR-S-G
COMPUTE #CURR-PLANS = #M-E-PLANS-BY-FACE-TOT-TOT + #SCR-NET-GAIN-PLANS
IF #CURR-MONTH
  COMPRESS '***** CURRENT MBRS=' #CURR-MBRS 'SPS-GEN=' #CURR-S-G
           'LIVES=' #CURR-LIVES 'PLANS=' #CURR-PLANS
                         INTO #SCR-CURR-LINE
END-IF
*
MOVE '*' TO #CGA-SCR-COMMAND
MOVE 'Press ENTER for more file stats' TO #TEXT
INPUT TEXT #TEXT USING MAP 'G4130MMS'  /* ins by face & plans by face
*
IF #CGA-SCR-COMMAND NE '*'
  FETCH 'G1000PXX'
END-IF
*
INPUT TEXT #TEXT USING MAP 'G4134MMS'  /* db by type & DB TOTS
*
IF #CGA-SCR-COMMAND NE '*'
  FETCH 'G1000PXX'
END-IF
*
INPUT TEXT #TEXT USING MAP 'G4156MMS'  /* db for whole life & DB TOTS   /* RE1 START
*
IF #CGA-SCR-COMMAND NE '*'
  FETCH 'G1000PXX'
END-IF                                                                  /* RE1 END
*
INPUT TEXT #TEXT USING MAP 'G4131MMS'  /* plans by type & by mode
*
IF #CGA-SCR-COMMAND NE '*'
  FETCH 'G1000PXX'
END-IF
*
INPUT TEXT #TEXT USING MAP 'G4157MMS'  /* plans by type & by mode       /* RE1 START
*
IF #CGA-SCR-COMMAND NE '*'
  FETCH 'G1000PXX'
END-IF                                                                  /* RE1 END
*
INPUT TEXT #TEXT USING MAP 'G4132MMS'  /*  pu plans by type
*
IF #CGA-SCR-COMMAND NE '*'
  FETCH 'G1000PXX'
END-IF
*
INPUT TEXT #TEXT USING MAP 'G413AMMS'  /*  Employee Stats
*
IF #CGA-SCR-COMMAND NE '*'
  FETCH 'G1000PXX'
END-IF
*
* INPUT TEXT #TEXT USING MAP 'G4139MMS'  /*  FBR STATS
*
* IF #CGA-SCR-COMMAND NE '*'
*   FETCH 'G1000PXX'
* END-IF
*
INPUT TEXT #TEXT USING MAP 'G4135MMS'  /*  FSO STATS
*
IF #CGA-SCR-COMMAND NE '*'
  FETCH 'G1000PXX'
END-IF
*
MOVE 'MS' TO #CGA-SCR-COMMAND
RESET #TEXT
*
INPUT TEXT #TEXT USING MAP 'G4133MMS'  /* PU PLANS BY AGE
*
FETCH 'G1000PXX'
END
