DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
 1 #YLT (N3.2/1:4)
   CONST
   <17,39,18,23>
 1 #NLT (N3.2/4)
   CONST
   <17,49,18,23>
 1 #YRT (N3.2/4)
   CONST
   <17,69,18,23>
 1 #NRT (N3.2/4)
   CONST
   <17,69,18,23>
 1 #NW5 (N3.2/4)
   CONST
   <18,80,18,23>
 1 #NW6 (N3.2/4)
   CONST
   <18,79,18,23>
 1 #NW7 (N3.2/4)
   CONST
   <18,78,18,23>
 1 #NW8 (N3.2/4)
   CONST
   <18,77,18,23>
 1 #NW9 (N3.2/4)
   CONST
   <18,76,18,23>
 1 #NW10 (N3.2/4)
   CONST
   <18,75,18,23>
 1 #NW11 (N3.2/4)
   CONST
   <18,74,18,23>
 1 #NW12 (N3.2/4)
   CONST
   <18,73,18,23>
 1 #NW13 (N3.2/4)
   CONST
   <18,72,18,23>
 1 #NW14 (N3.2/4)
   CONST
   <18,71,18,23>
 1 #NW15 (N3.2/4)
   CONST
   <18,70,18,23>
 1 #NW16 (N3.2/4)
   CONST
   <18,69,18,23>
 1 #NW17 (N3.2/4)
   CONST
   <18,68,18,23>
 1 #NW18 (N3.2/4)
   CONST
   <18,67,18,23>
 1 #NW19 (N3.2/4)
   CONST
   <18,66,18,23>
 1 #NW20 (N3.2/4)
   CONST
   <18,65,18,23>
 1 #NW21 (N3.2/4)
   CONST
   <18,64,18,23>
 1 #NW22 (N3.2/4)
   CONST
   <18,63,18,23>
 1 #NW23 (N3.2/4)
   CONST
   <18,62,18,23>
 1 #NW24 (N3.2/4)
   CONST
   <18,61,18,23>
 1 #NW25 (N3.2/4)
   CONST
   <18,60,18,23>
 1 #NW26 (N3.2/4)
   CONST
   <18,59,18,23>
 1 #NW27 (N3.2/4)
   CONST
   <18,58,18,23>
 1 #NW28 (N3.2/4)
   CONST
   <18,57,18,23>
 1 #NW29 (N3.2/4)
   CONST
   <18,56,18,23>
 1 #NW30 (N3.2/4)
   CONST
   <18,55,18,23>
 1 #YV5 (N3.2/4)
   CONST
   <18,80,18,23>
 1 #YV6 (N3.2/4)
   CONST
   <18,79,18,23>
 1 #YV7 (N3.2/4)
   CONST
   <18,78,18,23>
 1 #YV8 (N3.2/4)
   CONST
   <18,77,18,23>
 1 #YV9 (N3.2/4)
   CONST
   <18,76,18,23>
 1 #YV10 (N3.2/4)
   CONST
   <18,75,18,23>
 1 #YV11 (N3.2/4)
   CONST
   <18,74,18,23>
 1 #YV12 (N3.2/4)
   CONST
   <18,73,18,23>
 1 #YV13 (N3.2/4)
   CONST
   <18,72,18,23>
 1 #YV14 (N3.2/4)
   CONST
   <18,71,18,23>
 1 #YV15 (N3.2/4)
   CONST
   <18,70,18,23>
 1 #YV16 (N3.2/4)
   CONST
   <18,69,18,23>
 1 #YV17 (N3.2/4)
   CONST
   <18,68,18,23>
 1 #YV18 (N3.2/4)
   CONST
   <18,67,18,23>
 1 #YV19 (N3.2/4)
   CONST
   <18,66,18,23>
 1 #YV20 (N3.2/4)
   CONST
   <18,65,18,23>
 1 #YV21 (N3.2/4)
   CONST
   <18,64,18,23>
 1 #YV22 (N3.2/4)
   CONST
   <18,63,18,23>
 1 #YV23 (N3.2/4)
   CONST
   <18,62,18,23>
 1 #YV24 (N3.2/4)
   CONST
   <18,61,18,23>
 1 #YV25 (N3.2/4)
   CONST
   <18,60,18,23>
 1 #YV26 (N3.2/4)
   CONST
   <18,59,18,23>
 1 #YV27 (N3.2/4)
   CONST
   <18,58,18,23>
 1 #YV28 (N3.2/4)
   CONST
   <18,57,18,23>
 1 #YV29 (N3.2/4)
   CONST
   <18,56,18,23>
 1 #YV30 (N3.2/4)
   CONST
   <18,55,18,23>
 1 #NV5 (N3.2/4)
   CONST
   <18,80,18,23>
 1 #NV6 (N3.2/4)
   CONST
   <18,79,18,23>
 1 #NV7 (N3.2/4)
   CONST
   <18,78,18,23>
 1 #NV8 (N3.2/4)
   CONST
   <18,77,18,23>
 1 #NV9 (N3.2/4)
   CONST
   <18,76,18,23>
 1 #NV10 (N3.2/4)
   CONST
   <18,75,18,23>
 1 #NV11 (N3.2/4)
   CONST
   <18,74,18,23>
 1 #NV12 (N3.2/4)
   CONST
   <18,73,18,23>
 1 #NV13 (N3.2/4)
   CONST
   <18,72,18,23>
 1 #NV14 (N3.2/4)
   CONST
   <18,71,18,23>
 1 #NV15 (N3.2/4)
   CONST
   <18,70,18,23>
 1 #NV16 (N3.2/4)
   CONST
   <18,69,18,23>
 1 #NV17 (N3.2/4)
   CONST
   <18,68,18,23>
 1 #NV18 (N3.2/4)
   CONST
   <18,67,18,23>
 1 #NV19 (N3.2/4)
   CONST
   <18,66,18,23>
 1 #NV20 (N3.2/4)
   CONST
   <18,65,18,23>
 1 #NV21 (N3.2/4)
   CONST
   <18,64,18,23>
 1 #NV22 (N3.2/4)
   CONST
   <18,63,18,23>
 1 #NV23 (N3.2/4)
   CONST
   <18,62,18,23>
 1 #NV24 (N3.2/4)
   CONST
   <18,61,18,23>
 1 #NV25 (N3.2/4)
   CONST
   <18,60,18,23>
 1 #NV26 (N3.2/4)
   CONST
   <18,59,18,23>
 1 #NV27 (N3.2/4)
   CONST
   <18,58,18,23>
 1 #NV28 (N3.2/4)
   CONST
   <18,57,18,23>
 1 #NV29 (N3.2/4)
   CONST
   <18,56,18,23>
 1 #NV30 (N3.2/4)
   CONST
   <18,55,18,23>
 1 #YU5 (N3.2/4)
   CONST
   <18,80,18,23>
 1 #YU6 (N3.2/4)
   CONST
   <18,79,18,23>
 1 #YU7 (N3.2/4)
   CONST
   <18,78,18,23>
 1 #YU8 (N3.2/4)
   CONST
   <18,77,18,23>
 1 #YU9 (N3.2/4)
   CONST
   <18,76,18,23>
 1 #YU10 (N3.2/4)
   CONST
   <18,75,18,23>
 1 #YU11 (N3.2/4)
   CONST
   <18,74,18,23>
 1 #YU12 (N3.2/4)
   CONST
   <18,73,18,23>
 1 #YU13 (N3.2/4)
   CONST
   <18,72,18,23>
 1 #YU14 (N3.2/4)
   CONST
   <18,71,18,23>
 1 #YU15 (N3.2/4)
   CONST
   <18,70,18,23>
 1 #YU16 (N3.2/4)
   CONST
   <18,69,18,23>
 1 #YU17 (N3.2/4)
   CONST
   <18,68,18,23>
 1 #YU18 (N3.2/4)
   CONST
   <18,67,18,23>
 1 #YU19 (N3.2/4)
   CONST
   <18,66,18,23>
 1 #YU20 (N3.2/4)
   CONST
   <18,65,18,23>
 1 #YU21 (N3.2/4)
   CONST
   <18,64,18,23>
 1 #YU22 (N3.2/4)
   CONST
   <18,63,18,23>
 1 #YU23 (N3.2/4)
   CONST
   <18,62,18,23>
 1 #YU24 (N3.2/4)
   CONST
   <18,61,18,23>
 1 #YU25 (N3.2/4)
   CONST
   <18,60,18,23>
 1 #YU26 (N3.2/4)
   CONST
   <18,59,18,23>
 1 #YU27 (N3.2/4)
   CONST
   <18,58,18,23>
 1 #YU28 (N3.2/4)
   CONST
   <18,57,18,23>
 1 #YU29 (N3.2/4)
   CONST
   <18,56,18,23>
 1 #YU30 (N3.2/4)
   CONST
   <18,55,18,23>
 1 #NU5 (N3.2/4)
   CONST
   <18,80,18,23>
 1 #NU6 (N3.2/4)
   CONST
   <18,79,18,23>
 1 #NU7 (N3.2/4)
   CONST
   <18,78,18,23>
 1 #NU8 (N3.2/4)
   CONST
   <18,77,18,23>
 1 #NU9 (N3.2/4)
   CONST
   <18,76,18,23>
 1 #NU10 (N3.2/4)
   CONST
   <18,75,18,23>
 1 #NU11 (N3.2/4)
   CONST
   <18,74,18,23>
 1 #NU12 (N3.2/4)
   CONST
   <18,73,18,23>
 1 #NU13 (N3.2/4)
   CONST
   <18,72,18,23>
 1 #NU14 (N3.2/4)
   CONST
   <18,71,18,23>
 1 #NU15 (N3.2/4)
   CONST
   <18,70,18,23>
 1 #NU16 (N3.2/4)
   CONST
   <18,69,18,23>
 1 #NU17 (N3.2/4)
   CONST
   <18,68,18,23>
 1 #NU18 (N3.2/4)
   CONST
   <18,67,18,23>
 1 #NU19 (N3.2/4)
   CONST
   <18,66,18,23>
 1 #NU20 (N3.2/4)
   CONST
   <18,65,18,23>
 1 #NU21 (N3.2/4)
   CONST
   <18,64,18,23>
 1 #NU22 (N3.2/4)
   CONST
   <18,63,18,23>
 1 #NU23 (N3.2/4)
   CONST
   <18,62,18,23>
 1 #NU24 (N3.2/4)
   CONST
   <18,61,18,23>
 1 #NU25 (N3.2/4)
   CONST
   <18,60,18,23>
 1 #NU26 (N3.2/4)
   CONST
   <18,59,18,23>
 1 #NU27 (N3.2/4)
   CONST
   <18,58,18,23>
 1 #NU28 (N3.2/4)
   CONST
   <18,57,18,23>
 1 #NU29 (N3.2/4)
   CONST
   <18,56,18,23>
 1 #NU30 (N3.2/4)
   CONST
   <18,55,18,23>
 1 #YGPL (N3.2/4)
   CONST
   <0,12,0,12>
 1 #NGPL (N3.2/4)
   CONST
   <0,12,0,12>
 1 #YGP2 (N3.2/4)
   CONST
   <0,14,0,14>
 1 #NGP2 (N3.2/4)
   CONST
   <0,14,0,14>
 1 #YOL (N3.2/4)
   CONST
   <0,80,0.5,23>
 1 #Y30P (N3.2/4)
   CONST
   <0,69,0.5,23>
 1 #Y20P (N3.2/4)
   CONST
   <0,69,0.5,23>
 1 #Y7P (N3.2/4)
   CONST
   <0,69,0.5,23>
 1 #YSP (N3.2/4)
   CONST
   <0,80,0.5,23>
 1 #NOL (N3.2/4)
   CONST
   <0,80,0.5,23>
 1 #N30P (N3.2/4)
   CONST
   <0,69,0.5,23>
 1 #N20P (N3.2/4)
   CONST
   <0,69,0.5,23>
 1 #N7P (N3.2/4)
   CONST
   <0,69,0.5,23>
 1 #NSP (N3.2/4)
   CONST
   <0,80,0.5,23>
 1 #YEZ (N3.2/1:4)
   CONST
   <45,74,45,74>
 1 #SEZ (N3.2/1:4)
   CONST
   <45,74,45,74>
END-DEFINE
