* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: GATSTSXX    AT STATUS (OLD ACTION-FLAG) PROCESSING
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* PAM    06232004  PM1     Made application status code of 'A' invalid *
*                          to prevent users from accidently changing   *
*                          the status to approved.                     *
*                                                                      *
* PAM    02072005  PM2     Added new status 'SD' to indicate currently *
*                          in Sales Department.                        *
* DRW    06032005  DW4     Use Status not description for RQSTED       *
* DRW  05/02/2008  DW7     Chg description of U4 & U5                  *
* bz   09/15206    bz-MIB  MIB Porj Add PU and UU
* bz   04/18/2017  bz-HD-3492 /Multiple changes for AT status (see ticket)
* bz-RX  10/03/2017  RX Request
************************************************************************
*
DEFINE DATA
PARAMETER
1 #ACT-FLAG      (A2)
1 #ACT-FLAG-DESC (A40)
1 #INVALID       (L)
1 #ERR-MSG       (A60)
*
LOCAL
*
1 #STATUS-TBL    
*  Sales
 2 #NT-01 (A43) INIT <'M7-Fax In                                  '>
 2 #NT-02 (A43) INIT <'S7-To Applications                         '>
 2 #NT-03 (A43) INIT <'SD-Sales Department                        '>
*  Applications
 2 #NT-04 (A43) INIT <'PR-Processing Review                       '>
 2 #NT-05 (A43) INIT <'PM-Medical Reqd from Applicant             '>
 2 #NT-06 (A43) INIT <'PU-MIB Check and RX Requests               '>
 2 #NT-07 (A43) INIT <'PO-Other Info Reqd from Applicant          '>
 2 #NT-08 (A43) INIT <'P1-To M/U - Portamedic                     '>
 2 #NT-09 (A43) INIT <'P2-To M/U - Review                         '>
 2 #NT-10 (A43) INIT <'PB-Pending IDV Check                       '>
 2 #NT-11 (A43) INIT <'PV-Pending IDV requirements from applicant '>
 2 #NT-12 (A43) INIT <'R1-App 1st attempt                         '>
 2 #NT-13 (A43) INIT <'R2-App 2nd attempt                         '>
 2 #NT-14 (A43) INIT <'R3-App 3rd attempt                         '>
*  Underwriting
 2 #NT-15 (A43) INIT <'U1-Under Med/Underwriting Review           '>
 2 #NT-16 (A43) INIT <'U2-Requested Additional Med Info           '>
 2 #NT-17 (A43) INIT <'U3-Ordered Paramed                         '>
 2 #NT-18 (A43) INIT <'U4-Med Info to Fasano                      '>
 2 #NT-19 (A43) INIT <'U5-Req Medical Records                     '>
 2 #NT-20 (A43) INIT <'U6-Approved to App Team Lead               '>
 2 #NT-21 (A43) INIT <'UA-Rated Premiums Class 1                  '>
 2 #NT-22 (A43) INIT <'UB-Rated Premiums Class 2                  '>
 2 #NT-23 (A43) INIT <'UC-Rated Premiums Class 3                  '>
 2 #NT-24 (A43) INIT <'UU-MIB Coding                              '>
*  Withdrawals
 2 #NT-25 (A43) INIT <'W1-Withdrawn, addnl med info not recd      '>
 2 #NT-26 (A43) INIT <'W2-Withdrawn,no contact by Medical Examiner'>
 2 #NT-27 (A43) INIT <'W3-Withdrawn, per Applicant                '>
 2 #NT-28 (A43) INIT <'W4-Withdrawn, due to Medical Reasons       '>
 2 #NT-29 (A43) INIT <'W5-Withdrawn, ineligible for product or CAP'>
 2 #NT-30 (A43) INIT <'WR-Withdraw, missing basic requirements    '>
 2 #NT-31 (A43) INIT <'WU-Withdrawn,ineligible for AAFMAA or error'>
*  Approved
 2 #NT-32 (A43) INIT <'PA-Pending Approval                        '>
 2 #NT-33 (A43) INIT <'A -Approved                                '>
1 REDEFINE #STATUS-TBL
 2 #ST-NOTS-OCC    (33)       /* must match above                                     
  3 #ST-NOTE-STATUS (A2)
  3 #ST-NOTE-X1     (A1)
  3 #ST-NOTE-DESC   (A40)
*
1 #NUM-STS    (N3) INIT <33>  /* must match above
*
1 #I1    (I2)
1 #ADMIN  (L)
1 #USER-DATE (A15)
1 REDEFINE #USER-DATE
 2 #USER-DATE-USER  (A4)
 2 #USER-DATE-DATE  (A11)
1 #TEXT      (A75)
1 #APPL-FND     (L)
1 #NO-NOTES     (L)
1 #NOTES-CHGED  (L)
1 #ISN          (P8)
*
1 #YYYYMMDD (N8)
1 REDEFINE #YYYYMMDD
 2 #YYYY     (A4)
 2 #MM       (A2)
 2 #DD       (A2)
1 REDEFINE #YYYYMMDD
 2 #YYYY-N   (N4)
 2 #MM-N     (N2)
 2 #DD-N     (N2)
1 REDEFINE #YYYYMMDD
 2 #YYYYMMDD-A (A8)
*
END-DEFINE
************************************************************************
*
RESET #INVALID #ACT-FLAG-DESC #ERR-MSG
*
FOR #I1 1 TO #NUM-STS
  IF #ST-NOTE-STATUS (#I1) = #ACT-FLAG
    MOVE #ST-NOTE-DESC (#I1) TO #ACT-FLAG-DESC
    IF #ACT-FLAG = 'A'                                            /* PM1
      MOVE TRUE  TO #INVALID                                      /* PM1
    END-IF                                                        /* PM1
    ESCAPE BOTTOM
  END-IF
END-FOR
*
IF #ACT-FLAG-DESC = ' '
  IF #ACT-FLAG = 'M?'
    MOVE 'To get appl new AT"s must be "M?"' TO #ACT-FLAG-DESC
  ELSE
    MOVE 'Invalid Status' TO #ACT-FLAG-DESC
  END-IF
  MOVE TRUE TO #INVALID
  ESCAPE ROUTINE
END-IF
*
IF #ACT-FLAG = MASK ('M')    /* DW4
  COMPRESS #ACT-FLAG-DESC '-APP rqstd' INTO #ACT-FLAG-DESC
END-IF
*
END
