DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-BANK
  2 #BANK-ID-NUMBER (N6.0)
  2 #BANKRUPT (A1)
END-DEFINE
