DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #EDS-SECURITY-CODE
  2 #E99 (N2)
    INIT<99>
1 #SERVICES-SECURITY-CODES
  2 #S01 (N2)
    INIT<01>
  2 #S02 (N2)
    INIT<02>
  2 #S97 (N2)
    INIT<97>
1 #SERVICES (A1)
  INIT<'S'>
1 #INSURANCE (A1)
  INIT<'I'>
1 #BOTH (A1)
  INIT<'B'>
1 #GRANDFATHERED (A1)
  INIT<'G'>
1 #BLANK (A1)
  INIT<' '>
1 #SERVICES-AT-FLAG (A1)
  INIT<'V'>
END-DEFINE
