* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PGM-ID: GCTPPSXX   Compute TPP (TOT PREMIUMS PAID)
* TMT 06/16/2014   TT1  Contact Normalization - DOB and Sex
DEFINE DATA
PARAMETER
1 #ID-NUMBER    (N6)
1 REDEFINE #ID-NUMBER
 2 #ID-NUMBER-A (A6)
1 #IFL          (I2)
1 #TPP          (P7.2)  /* calculated TPP
*
LOCAL
*
1 ST-V VIEW OF A-STATUS
 2 INTRO-FLAG
 2 X-FIRST-PLACE-FEE (9)
 2 X-BILL-ADJUST     (9)
 2 MEMBER-CONTACT-ID                     /* TT1
*  2 DATE-OF-BIRTH                       /* TT1
 2 PAY-STATUS        (9)
 2 ANNUAL-PREM       (9)
 2 TOT-PREMIUMS-PAID (9)
 2 PAID-TO-DATE      (9)
 2 ISSUE-DATE        (9)
 2 MODE              (9)
 2 PLAN              (9)
 2 MONTH-ALLOC-AMT   (9)
 2 COST-BASIS        (9)
*
1 #I1          (I2)
1 #I2          (I2)
1 #YYYYMMDD  (N8)
1 REDEFINE #YYYYMMDD
 2 #YYYYMM (N6)
 2 REDEFINE #YYYYMM
  3 #YYYY   (N4)
  3 #MM     (N2)
 2 #DD     (N2)
1 REDEFINE #YYYYMMDD
 2 #YYYY-A (A4)
 2 #MM-A   (A2)
 2 #DD-A   (A2)
1 REDEFINE #YYYYMMDD
 2 #YYYYMMDD-A (A8)
*
* BELOW for CALC-PREMS-PAID
1 #PP-DATE-OF-BIRTH  (N8)
1 #PP-ANNUAL-PREM    (N5.2)
1 #PP-PAY-STATUS     (A2)
1 #PP-TOT-PREMIUMS-PAID (N7.2)
1 #PP-PAID-TO-DATE   (N8)
1 #PP-ISSUE-DATE     (N8)
1 #PP-MODE           (A1)
1 #PP-PLAN           (A3)
1 #PP-COST-BASIS      (N7.2)
1 #PP-MONTH-ALLOC-AMT (N7.2)       /*TT1
1 #PP-INTRO-FLAG     (A1)
1 #PP-FIRST-PLACE-FEE (N7.2)
1 #PREMS-PAID       (P7.2)
1 #SUB-PREMS-PAID   (P7.2)
1 #PP-BADJ          (P5.2)
* ABOVE for CALC-PREMS-PAID
1 DATE-OF-BIRTH     (N8.0)         /* TT1
*
END-DEFINE
*
FIND (1) ST-V WITH MEMBER-KEY = #ID-NUMBER-A
END-FIND
*
RESET #PREMS-PAID DATE-OF-BIRTH                                     /* TT1
DATE-OF-BIRTH     :=   GET-DATE-OF-BIRTH(<ST-V.MEMBER-CONTACT-ID>)  /* TT1
*
MOVE DATE-OF-BIRTH            TO #PP-DATE-OF-BIRTH
MOVE ANNUAL-PREM       (#IFL) TO #PP-ANNUAL-PREM
MOVE PAY-STATUS        (#IFL) TO #PP-PAY-STATUS
MOVE TOT-PREMIUMS-PAID (#IFL) TO #PP-TOT-PREMIUMS-PAID
MOVE PAID-TO-DATE      (#IFL) TO #PP-PAID-TO-DATE
MOVE ISSUE-DATE        (#IFL) TO #PP-ISSUE-DATE
MOVE MODE              (#IFL) TO #PP-MODE
MOVE PLAN              (#IFL) TO #PP-PLAN
MOVE COST-BASIS        (#IFL) TO #PP-COST-BASIS
MOVE MONTH-ALLOC-AMT   (#IFL) TO #PP-MONTH-ALLOC-AMT
MOVE INTRO-FLAG               TO #PP-INTRO-FLAG
MOVE X-FIRST-PLACE-FEE (#IFL) TO #PP-FIRST-PLACE-FEE
MOVE X-BILL-ADJUST     (#IFL) TO #PP-BADJ
*
CALLNAT 'GPRPDSCO'
  #PP-DATE-OF-BIRTH
  #PP-ANNUAL-PREM
  #PP-PAY-STATUS
  #PP-TOT-PREMIUMS-PAID
  #PP-PAID-TO-DATE
  #PP-ISSUE-DATE
  #PP-MODE
  #PP-PLAN
  #PP-COST-BASIS
  #PP-MONTH-ALLOC-AMT
  #PP-INTRO-FLAG
  #PP-FIRST-PLACE-FEE
  #PREMS-PAID
  #SUB-PREMS-PAID
  #PP-BADJ
*
MOVE #PREMS-PAID TO #TPP
*
END
