DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-GDATESXX
  2 #TO-DATE (N8)
  2 #FROM-DATE (N8)
  2 #RETURN-CALC (N8)
  2 REDEFINE #RETURN-CALC /* BEGIN REDEFINE: #RETURN-CAL
    3 #RETURN-CALC-A (A8)
  2 #REQUEST (A1)
END-DEFINE
