* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* CALLNAT 'GDCCNXXX'                 /* NG1
*
**************************************************************************
*        MODIFICATION LOG
**************************************************************************
* USER   DATE      TAG  REASON
* RSE  06/24/2010  RE1  Add Birth Cert Code and SSN
DEFINE DATA
PARAMETER
1 #CONTACT-ID         (N8)
1 #DEPN-CONTACT-ID    (N8)
1 #DEP-NAME           (A25)
1 #DEP-DOB            (A8)
1 #DEP-ROLE           (A1)
1 #DEP-BIRTH-CD       (A1)   /* RE1
1 #DEP-SSN            (N9)   /* RE1
LOCAL
1 CONTACT VIEW OF A-CONTACTS
  2 FIRST-NAME                        (A25)
  2 MIDDLE-NAME                       (A25)
  2 LAST-NAME                         (A25)
  2 SUFFIX                            (A10)
  2 DATE-OF-BIRTH                     (N8)
  2 BIRTH-CERT-CODE                   (A1)
  2 SSN                               (N9)
1 CNT-REL VIEW OF A-CONTACT-RELATIONSHIPS
  2 CONTACT-1-ID                      (N8.0) /* D
  2 ROLE-1-CD                         (A1)
  2 CONTACT-2-ID                      (N8.0) /* D
  2 ROLE-2-CD                         (A1)

END-DEFINE

FIND CONTACT WITH CONTACT-ID = #DEPN-CONTACT-ID
  #DEP-NAME := FUNCTION-DISP-CT-NAME (<FIRST-NAME,MIDDLE-NAME,LAST-NAME,SUFFIX>)
  ASSIGN #DEP-DOB = DATE-OF-BIRTH
  ASSIGN #DEP-BIRTH-CD = BIRTH-CERT-CODE  /* RE1
  ASSIGN #DEP-SSN = SSN                   /* RE1
END-FIND

FIND CNT-REL WITH CONTACT-1-ID = #CONTACT-ID
    AND CONTACT-2-ID = #DEPN-CONTACT-ID
    ASSIGN #DEP-ROLE = ROLE-2-CD
END-FIND
END
