DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*     * Access general file table
1 #PDA-GENERAL-FILE
  2 #GEN-FILE-KEY (A3)
  2 #GEN-SUB-KEY (A1)
  2 #GEN-SECURITY-CODE (N2.0)
  2 #GEN-VALUE-TABLE (1:5)
    3 #GEN-CHARACTER (A50)
    3 #GEN-VALUE (N9.2)
    3 #GEN-DESCRIPTION (A75)
  2 #GEN-KEY-FOUND (L)
END-DEFINE
