* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Program ID GET-MR
* 
DEFINE FUNCTION GET-MR RETURNS (N7.2) BY VALUE
  DEFINE DATA
  PARAMETER
  1 #SVC-MEMBER-ID  (N6)
  1 #SVC-PLAN       (A3)
  LOCAL
  1 CONTACT VIEW OF A-CONTACTS
  END-DEFINE
*
RESET GET-MR
*
END-FUNCTION
END
