* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* GET DB ID
DEFINE FUNCTION GET_DBN  RETURNS (N5) BY VALUE
DEFINE DATA
LOCAL
1 USR1040L
     2 FUNCTION         (A01) INIT <'G'>
     2 UDB-PARM         (N05) (EM=999)
     2 RESPONSE         (I04)  
END-DEFINE
  CALLNAT 'USR1040N' USR1040L
  GET_DBN := UDB-PARM
END-FUNCTION
END
