* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
**************************************
* getacc reg info
*
* vxt 02/01/2011
**************************************
*
define data local
1 ar-h VIEW OF A-ACCOUNTING-REGISTER
  2 TRANSACTION-DATN
1 ACCOUNT VIEW OF A-ACCOUNTING-REGISTER
  2 ACCTTX
    3 ID-NUMBER (N6)
    3 TRANSACTION-DATN (P9)
    3 TRANSACTION-TIMN (P7)
    3 TXN-CODE (A4)
    3 SEQUENCE-NUM (N1)
    3 NAME (A25)
    3 TXN-ACCT-NUMBER (N3)
    3 ACCT-DATE (N8)
    3 DATE-LAST-ACCT-UPDATE (N8)
    3 DEBIT-AMOUNT (P7.2)
    3 CREDIT-AMOUNT (P7.2)
    3 DESCRIPTION (A20)
    3 MESSAGE-CODE (A1)
    3 AALP-FLAG (A1)
    3 CLERK-ID (A3)
    3 TERMINAL-ID (A8)
  2 POLICY-NUMBER  (a16)
  2 CASH-CODE (A1)
  2 PROCESS-IND (A1)
  2 USER-COMPANY (A1)
  2 month-end
  2 c*sungard-info
  2 SUNGARD-INFO (1:15)
    3 SG-CATEGORY-1 (A2)
    3 SG-CATEGORY-2 (A2)
    3 SG-AMOUNT (N6.2)
*  2 CLERK-DATE-KEY (A8)
*

local
1 #datn (p8)
1 #id-number (n6)
1 #amount (p7.2)
1 #found  (l)
1 #cnt  (p7)
1 #tot-amt  (n11.2)
*
end-define
*

read  account with   account.transaction-datn = 20131217
  if account.clerk-id = 'EDS'    and account.transaction-timn = 815212 
      and  account.cash-code = 'N'
 add account.credit-amount to #tot-amt
       display (1)   account.id-number account.txn-code account.credit-amount account.cash-code account.transaction-timn
     
  end-if
  at end of data
    write 'total' #tot-amt
  end-enddata
end-read
end
