DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-GET-MBR
  2 #MEMBER-ID (N9.0)
  2 #ISN (P8.0)
END-DEFINE
