* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
**************************************************************************
* SUBPROGRAM-ID: GFUNCSXX
* DESCRIPTION: PF4 FUNCTION - View/Update/Add/Delete Contact Notes/Addresses
**************************************************************************
*        MODIFICATION LOG
**************************************************************************
* USER   DATE      TAG  REASON
* RSE  08/17/2010  None Creation
**************************************************************************
*
DEFINE DATA
PARAMETER
1 #CID          (N8)
1 #ID-NUMBER    (N6)
1 #UPDATE       (L)
1 #FUNCTION     (A1) /* N - Notes   A - Address
LOCAL
1 ADDR-REL-V VIEW OF A-ADDRESS-RELATIONSHIP
  2 CONTACT-ID
  2 ADDRESS-POOL-ID
*
1 #FUNC-SEL     (A1)
1 #SEARCH       (L)
END-DEFINE
*
DEFINE WINDOW Connect
  SIZE 13 * 35
  BASE 6/5
  FRAMED ON POSITION SYMBOL AUTO
*
SET WINDOW 'Connect'
INPUT WINDOW='Connect' USING MAP 'C2237MCB'
*
IF *PF-KEY = 'PF3'
  SET WINDOW OFF
  ESCAPE ROUTINE
END-IF
*
IF #FUNC-SEL = ' '
  REINPUT 'Enter selection'
    MARK 1
END-IF
*
IF NOT (#FUNC-SEL = '1' OR = '2')
  REINPUT 'Invalid selection'
    MARK 1
END-IF
*
IF #FUNC-SEL = '1'
  IF #ID-NUMBER > 0
    REINPUT 'Pls use NS/NU for this Contact.'
      MARK 1
  END-IF
  CALLNAT 'GUPNTSXX' #CID #UPDATE
  MOVE 'N' TO #FUNCTION
END-IF
*
IF #FUNC-SEL = '2'
  MOVE TRUE TO #SEARCH
  FETCH RETURN 'C2203PCG' #ID-NUMBER #CID #SEARCH
*  FIND ADDR-REL-V WITH CONTACT-ID = #CID
*    IF NO RECORD FOUND
*      REINPUT 'Address record not found.'
*    END-NOREC
*    CALLNAT 'ADDRN002' #CID ADDRESS-POOL-ID
*  END-FIND
END-IF
*
END
