* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PGM-ID: GGRANSXX
*  SUBPROGRAM TO DEVELOP text describing member
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* M O D I F I C A T I O N   L O G
*
* DRW 09/21/2009 DW1 Unification Changes PROCESS-IND CHAMGES
* RSE 01/12/2010 RE1 Change 'AFFL' to 'AFA'
* RSE 07/09/2010 RE2 Display Plan for AFA clients
* NGG 07/19/2010 NG1 Call subprogram instead of function
* TMT 03/17/2014 TT1 MemberShip Expansion Project
* vxt 05/05/2015 vt1 /Ticket 3509/
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*
DEFINE DATA
PARAMETER
1 #ID-NUMBER      (N6)
1 #PROCESS-IND    (A1)
1 #INTRO-FLAG     (A1)
1 #MIL-SERVICE    (A3)
1 #DOD            (N8)
1 #NUM-MEMBERSHIPS(P1)
1 #FST-PLAN       (A3)
1 #TEXT           (A40)
*
LOCAL  USING A-IFAFFL   /* PDA used with FUNCTION F-if-AFFL     /* DW1
LOCAL
1 #ACTIVE-WIDOW-CLIENT  (L)
1 #PLAN           (A3)
1 #STATUS-D        (A) DYNAMIC
1 #STATUS          (A1)
*
END-DEFINE
*
* #HAS-ACTIVE-AFFL-PLANS Used

CALLNAT 'PLAN-AFA' #ID-NUMBER F-IF-AFFL-DATA /* NG1

* IF F-IF-AFFL(<#ID-NUMBER,F-IF-AFFL-DATA>)  /* TEST AFFL Conditions  DW1
*  IGNORE
* END-IF
*
RESET #TEXT
IF #PROCESS-IND = 'S'  /* AFA client
  IF #NUM-MEMBERSHIPS = 0                     /* DW1
* *    IF GET-SVC-PLAN-BY-CN(<#ID-NUMBER>) NE ' '                 /* RE2 Start
*     #PLAN := GET-SVC-PLAN-BY-CN(<#ID-NUMBER>)(1)
*     #STATUS-D := GET-SVC-PLAN-BY-CN(<#ID-NUMBER>)(2)
*     #STATUS   := SUBSTRING(#STATUS-D, 1, 1)
*     #TEXT := FUNCTION-APPL-SOURCE(<#PLAN>)
*     IF #TEXT = ' ' THEN
*       COMPRESS '*AM and SB ' INTO #TEXT LEAVING NO
*     ELSE
*       COMPRESS '*AM and SB (' #TEXT ')' INTO #TEXT LEAVING NO    /* TT1
*     END-IF
  #TEXT := '*Service only'
  ELSE
    MOVE '*AM and SB/AAFM Client' TO #TEXT  /* Combo CLient   RE1       /* TT1
  END-IF
*
*   IF   (NOT #HAS-ACTIVE-AFFL-PLANS)
*       AND (#DOD = 0)
*     IF #STATUS = 'P'
*       COMPRESS #TEXT '-Pending Approval' INTO #TEXT
*     ELSE
*       IF #STATUS = 'F'
*         COMPRESS #TEXT '-FP Received' INTO #TEXT
*       ELSE
*         COMPRESS #TEXT '- AM&SB Inactive' INTO #TEXT       /* RE1       /* TT1
*       END-IF
*     END-IF
*   END-IF
*
  IF   (#NUM-MEMBERSHIPS = 0)
      AND (#DOD = 0)
      AND NOT AFFL-ONLY-CLIENT(<#ID-NUMBER>)  /* RE1 BYPASS AFA ONLY CLIENTS
    COMPRESS #TEXT '- AAFM Inactive' INTO #TEXT
  END-IF
ELSE                                                /* DW1
  IF #PROCESS-IND = 'C'
    MOVE '*Non-Insured' TO #TEXT
*
    IF #INTRO-FLAG = 'A'
      COMPRESS #TEXT '-Pending Approval' INTO #TEXT
    END-IF
*    
    If #intro-flag = 'W'                                     /* vt1 \/
    compress #text '-Application Withdrawn' into #text
    end-if                                                   /* vt1 /\
*    
    ESCAPE ROUTINE
  END-IF
*
  IF #PROCESS-IND = 'E'
    MOVE '*Employee' TO #TEXT
    ESCAPE ROUTINE
  END-IF
*
  IF   (#PROCESS-IND = 'I' OR = 'O' OR = 'D')
      OR ((#PROCESS-IND = 'G') AND (#INTRO-FLAG = 'S' OR = 'K' OR = 'G'))
      OR (#ID-NUMBER = 22204) /* temp as per BMG till i do CA de-gr him again
    IF #INTRO-FLAG = 'S' OR = 'K' OR = 'G'
      MOVE '*INS-ONLY' TO #TEXT
    ELSE
      IF #MIL-SERVICE = 'EMP'  /* employee
        MOVE '*INS-ONLY AAFMAA EMPLOYEE' TO #TEXT
      ELSE
        MOVE '*INS-PLUS' TO #TEXT
      END-IF
    END-IF
*
    IF #PROCESS-IND = 'O'
      COMPRESS #TEXT '-OPTED-OUT' INTO #TEXT
    END-IF
*
    IF #PROCESS-IND = 'D'
      IF #ID-NUMBER GE 106030
        MOVE '*DE-PIPELINED' TO #TEXT
      ELSE
        MOVE '*C/C to INS-PLUS' TO #TEXT
      END-IF
    END-IF
  ELSE
    IF #ID-NUMBER GE 106030
      MOVE '*PIPELINED' TO #TEXT
    ELSE
      MOVE '*GRANDFATHERED' TO #TEXT
    END-IF
  END-IF
*
  IF   (#NUM-MEMBERSHIPS = 0)
      AND (#DOD = 0)
    COMPRESS #TEXT '- AAFM Inactive' INTO #TEXT
  END-IF
END-IF
*
IF #DOD NE 0
  COMPRESS #TEXT '- Deceased' INTO #TEXT
END-IF
*
END
