* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
PARAMETER
1  p_CN          (N6)
1  p_POLN        (A16)
1  p_SG_1        (A2)
1  p_ACCN        (A4)  /* return parm, blank if error
1  P_DSCR        (A25)
LOCAL
1 ST-V VIEW OF A-STATUS
  2 ID-NUMBER
  2 C*ACTIVE-SEGMENTS
  2 PLAN (9)             
*  
1 #k        (I2)  
1 v_POLN    (A16)
1 v_PLAN    (A3)
1 p_DECR    (A25)
END-DEFINE


FIND ST-V WITH ID-NUMBER = P_CN
  IF NO RECORD FOUND 
     p_ACCN := ' '
     ESCAPE ROUTINE
  END-NOREC
     
  FOR #k = 1 TO C*ACTIVE-SEGMENTS
    CALLNAT 'GPLNMSXX' v_POLN P_CN #k
    IF v_POLN = p_POLN
      MOVE PLAN(#k) TO v_Plan
      ESCAPE BOTTOM
    END-IF
  END-FOR
END-FIND   

IF FUNCTION-TERM-POLICY(<v_Plan>)
  DECIDE ON FIRST VALUE OF v_Plan
    VALUE 'LT'
      IF p_SG_1 = '1Y'
        p_ACCN := 4021
        p_DECR := 'FIRST YEAR PREMIUMS-LT1'
      ELSE
        IF p_SG_1 = 'RN'
          p_ACCN := 4031
          p_DECR := 'RENEWALS-LT'
        END-IF
      END-IF
    VALUE 'RT'
      IF p_SG_1 = '1Y'
        p_ACCN := 4023
        p_DECR := 'FIRST YEAR PREMIUMS-RT'
      ELSE
        IF p_SG_1 = 'RN'
          p_ACCN := 4033
          p_DECR := 'RENEWALS-RT'
        END-IF
      END-IF
    VALUE 'EZ'
      IF p_SG_1 = '1Y'
        p_ACCN := 4024
        p_DECR := 'FIRST YEAR PREMIUMS-EZT'
      ELSE
        IF p_SG_1 = 'RN'
          p_ACCN := 4034
          p_DECR := 'RENEWALS-EZT'
        END-IF
      END-IF
    NONE VALUE
      IF p_SG_1 = '1Y'
        p_ACCN := 4022
        p_DECR := 'FIRST YEAR PREMIUMS-LT2'
      ELSE
        IF p_SG_1 = 'RN'
          p_ACCN := 4032
          p_DECR := 'RENEWALS-LT2'
        END-IF
      END-IF
  END-DECIDE
ELSE
  IF VAWL-TRUE(<v_Plan>)
      OR (v_Plan = MASK(NN'F')) OR ( v_Plan = MASK(N'P'))
    IF p_SG_1 = '1Y'
      p_ACCN := 4026
      p_DECR := 'FIRST YEAR PREMIUMS-WL'
    ELSE
      IF p_SG_1 = 'RN'
        p_ACCN := 4036
        p_DECR := 'RENEWALS-WL'
      END-IF
    END-IF
  ELSE
    DECIDE ON FIRST VALUE OF v_Plan
      VALUE 'GPL' , 'GP2'
        IF p_SG_1 = '1Y'
          p_ACCN := 4025
          p_DECR := 'FIRST YEAR PREMIUMS-GPL GP2'
        ELSE
          IF p_SG_1 = 'RN'
            p_ACCN := 4035
            p_DECR := 'RENEWALS-GPL GP2'
          END-IF
        END-IF
      VALUE 'AL'
        IF p_SG_1 = '1Y'
          p_ACCN := 4028
          p_DECR := 'FIRST YEAR PREMIUMS-AL'
        END-IF
      VALUE 'SO'
        IF p_SG_1 = 'SO'
          p_ACCN := 4112
          p_DECR := 'SERVICE ONLY'
        END-IF
      NONE VALUE
        IGNORE
    END-DECIDE
  END-IF
END-IF
*
IF p_SG_1  = 'SP'
  p_ACCN := 4027
  p_DECR := 'FIRST YEAR PREMIUMS-WLSP'
END-IF

END
