* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: GMECCSXX - MEC calcs  (also in C1602SCO)
*
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* PAM    04152004  PM1     Changed 1035 exchange and lump sum fields   *
*                          to 2 decimal places per Rick Browett.       *
*                                                                      *
* PAM    02102005  PM2     Increased #LUMP-PMT to 6.2 from 5.2.        *
*                          Changed notes accordingly.                  *
*                                                                      *
* DRW 05/13/2008 DW3 Add check for NS note for 'is a MEC since the orig..'
* DRW 08/30/2008 DW4 Add Gen Plus Processing
* YAK 10/17/2012 YK1 Use function to identify Level Term II plans
* NGG 02/08/2016 NG1 VAWL - change factors for version 4               *
************************************************************************
*
DEFINE DATA
PARAMETER
1 #ID-NUMBER      (N6)
1 #SUFFIX         (A3)
1 #PLAN           (A3)
1 REDEFINE #PLAN
 2 #PLAN-A1       (A1)
1 #ISS-DATE       (N8)
1 #PD-TO-DATE     (N8)
1 #PD-UP-DATE     (N8)
1 #ISS-AGE        (A2)
1 REDEFINE #ISS-AGE
 2 #ISS-AGE-N     (N2)
1 #ANN-PREM       (P5.2)
1 #SMOKER-FLAG    (A1)
1 #FACE-AMT       (P7.2)
1 #DURATION       (P3)
1 #PAY-STATUS     (A2)
1 #VW-TOT-PREMS-PAID (P7.2) /* from vw
1 #TOT-PREMS-PAID  (P7.2)   /* calculated tpp
*
1 #MAX-7-PAY      (P6.2)
1 #MEC-PREMS-PAID-TO-DATE (P7.2)
1 #EXCEEDS-MEC    (P7.2)
1 #1035-NX        (A60)
1 #1035-EXCH-AMT  (P6.2)
1 #LUMP-PMT  (P6.2)                                               /* PM2
*
LOCAL
*
1 #FULL-YR-ANN-PREMS  (P6.2)
1 #FORCED-MEC (L)
1 #DUR       (P3)
1 #TPP       (P7.2)
1 #AGE-X     (I2)
1 #1035-ADJ  (P0.6)
1 #MAX-7-PAY-DIFF (P7.2)     /*TT1
1 #PP-PREMS-PAID  (P6.2)     
1 #PREM-6-6  (P6.6)
*
* 1 #MAX-7-PAY-NON-SM    /* ALSO IN C1602SCO
*  2 #N00 (A48) INIT <'01033-01037-01067-01100-01134-01170-01209-01251-'>
*  2 #N08 (A48) INIT <'01295-01342-01392-01444-01497-01551-01605-01660-'>
*  2 #N16 (A48) INIT <'01714-01770-01826-01884-01944-02007-02073-02142-'>
*  2 #N24 (A48) INIT <'02215-02293-02374-02460-02551-02645-02745-02848-'>
*  2 #N32 (A48) INIT <'02957-03070-03187-03310-03437-03569-03706-03848-'>
*  2 #N40 (A48) INIT <'03995-04147-04307-04468-04637-04811-04991-05178-'>
*  2 #N48 (A48) INIT <'05370-05570-05777-05991-06212-06440-06675-06917-'>
*  2 #N56 (A48) INIT <'07167-07424-07689-07964-08248-08542-08847-09162-'>
*  2 #N64 (A48) INIT <'09487-09822-10168-10528-10904-11301-11719-12156-'>
* 1 REDEFINE #MAX-7-PAY-NON-SM
*  2 #7-PA-OCC-NS (72)
*   3 #7-PA-MAX-PRM-NS   (N4.1)
*   3 #7-PA-MAX-PRM-NS-X (A1)
* *
* 1 #MAX-7-PAY-SMOKER
*  2 #S00 (A48) INIT <'01256-01271-01312-01356-01402-01451-01502-01558-'>
*  2 #S08 (A48) INIT <'01616-01678-01743-01811-01882-01954-02028-02100-'>
*  2 #S16 (A48) INIT <'02170-02239-02310-02383-02457-02535-02616-02701-'>
*  2 #S24 (A48) INIT <'02791-02887-02988-03094-03206-03323-03446-03574-'>
*  2 #S32 (A48) INIT <'03708-03847-03991-04141-04297-04458-04625-04797-'>
*  2 #S40 (A48) INIT <'04974-05157-05344-05536-05734-05936-06144-06357-'>
*  2 #S48 (A48) INIT <'06577-06804-07037-07278-07525-07779-08039-08304-'>
*  2 #S56 (A48) INIT <'08575-08852-09138-09433-09740-10058-10387-10726-'>
*  2 #S64 (A48) INIT <'11074-11429-11794-12172-12565-12981-13422-13890-'>
* 1 REDEFINE #MAX-7-PAY-SMOKER
*  2 #7-PA-OCC-SM (72)
*   3 #7-PA-MAX-PRM-SM   (N4.1)
*   3 #7-PA-MAX-PRM-SM-X (A1)
* *
* 1 #1035-ADJ-NON-SM
*  2 #N00 (A49) INIT <'163071-162840-162823-162806-162786-162767-162753-'>
*  2 #N07 (A49) INIT <'162747-162754-162775-162812-162863-162924-162986-'>
*  2 #N14 (A49) INIT <'163042-163088-163122-163142-163153-163153-163144-'>
*  2 #N21 (A49) INIT <'163130-163113-163096-163080-163068-163062-163062-'>
*  2 #N28 (A49) INIT <'163067-163078-163095-163118-163146-163181-163224-'>
*  2 #N35 (A49) INIT <'163273-163331-163395-163467-163548-163635-163732-'>
*  2 #N42 (A49) INIT <'163837-163951-164077-164214-164365-164531-164717-'>
*  2 #N49 (A49) INIT <'164928-165169-165444-165752-166095-166475-166891-'>
*  2 #N56 (A49) INIT <'167349-167857-168427-169069-169793-170609-171522-'>
*  2 #N63 (A49) INIT <'172535-173647-174869-176220-177721-179411-181333-'>
*  2 #N70 (A14) INIT <'183522-185555-'>
* 1 REDEFINE #1035-ADJ-NON-SM
*  2 #1035-ADJ-OCC-NS (72)
*   3 #1035-ADJ-NS   (N0.6)
*   3 #1035-ADJ-NS-X (A1)
* *
* 1 #1035-ADJ-SMOKER
*  2 #N00 (A49) INIT <'163071-162840-162823-162806-162786-162767-162753-'>
*  2 #N07 (A49) INIT <'162747-162754-162779-162827-162901-162995-163105-'>
*  2 #N14 (A49) INIT <'163223-163317-163377-163416-163439-163448-163442-'>
*  2 #N21 (A49) INIT <'163427-163405-163383-163363-163350-163348-163356-'>
*  2 #N28 (A49) INIT <'163376-163406-163447-163496-163558-163633-163722-'>
*  2 #N35 (A49) INIT <'163827-163951-164093-164254-164434-164633-164850-'>
*  2 #N42 (A49) INIT <'165084-165335-165606-165896-166209-166551-166931-'>
*  2 #N49 (A49) INIT <'167354-167829-168359-168944-169583-170267-170998-'>
*  2 #N56 (A49) INIT <'171780-172627-173555-174587-175744-177031-178448-'>
*  2 #N63 (A49) INIT <'179985-181629-183378-185244-187262-189480-191955-'>
*  2 #N70 (A14) INIT <'194735-196666-'>
* 1 REDEFINE #1035-ADJ-SMOKER
*  2 #1035-ADJ-OCC-NS (72)
*   3 #1035-ADJ-SM   (N0.6)
*   3 #1035-ADJ-SM-X (A1)
* *
1 NT-V VIEW OF A-NOTES
 2 NOTE-DATE     (60)
 2 NOTE-CLERK-ID (60)
 2 NOTE-TEXT     (60)
 2 REDEFINE NOTE-TEXT
  3 NOTE-TXT-OCC  (60)              /* DW3
   4 NT-TXT-pol-iss     (A10)
   4 NT-TXT-pol-iss-mm  (A2)
   4 NT-TXT-fil-1       (A1)
   4 NT-TXT-pol-iss-dd  (A2)
   4 NT-TXT-FIL-2       (A1)
   4 NT-TXT-pol-iss-yyyy (A4)
   4 NT-TXT-fil-3       (A1)
   4 NT-TXT-is-a-mec    (A39)          /* END DW3
 2 REDEFINE NOTE-TEXT
  3 NOTE-TEXT-OCC  (60)
   4 NT-TXT-LBL         (A12)
   4 NT-TXT-1035-THOUS  (A2)
   4 NT-TXT-1035-COMMA  (A1)
   4 NT-TXT-1035-HUNDR  (A3)
   4 NT-TEXT-FILL-1     (A8)
   4 NT-TXT-1035-MM     (A2)
   4 NT-TXT-1035-FILL1  (A1)
   4 NT-TXT-1035-DD     (A2)
   4 NT-TXT-1035-FILL2  (A1)
   4 NT-TXT-1035-YYYY   (A4)
   4 NT-TXT-FILL-2      (A1)
   4 NT-TXT-PLUS        (A6)
   4 NT-TXT-LUMP-THOUS  (A2)
   4 NT-TXT-LUMP-COMMA  (A1)
   4 NT-TXT-LUMP-HUNDR  (A3)
   4 NT-TXT-FILL-3      (A11)
 2 REDEFINE NOTE-TEXT   /* to handle zzz,zzz as 1035 amt
  3 NOTE-TEXT-OCC-3  (60)
   4 NT-TXT-LBL-3         (A12)
   4 NT-TXT-1035-THOUS-3  (A3)
   4 NT-TXT-1035-COMMA-3  (A1)
   4 NT-TXT-1035-HUNDR-3  (A3)
   4 NT-TEXT-FILL-1-3     (A8)
   4 NT-TXT-1035-MM-3     (A2)
   4 NT-TXT-1035-FILL1-3  (A1)
   4 NT-TXT-1035-DD-3     (A2)
   4 NT-TXT-1035-FILL2-3  (A1)
   4 NT-TXT-1035-YYYY-3   (A4)
   4 NT-TXT-FILL-2-3      (A1)
   4 NT-TXT-PLUS-3        (A6)
   4 NT-TXT-LUMP-THOUS-3  (A2)
   4 NT-TXT-LUMP-COMMA-3  (A1)
   4 NT-TXT-LUMP-HUNDR-3  (A3)
   4 NT-TXT-FILL-3-3      (A10)
 2 REDEFINE NOTE-TEXT   /* to handle zzz,zzz.99 as 1035 amt       /* PM1
  3 NOTE-TEXT-OCC-4  (60)                                         /* PM1
   4 NT-TXT-LBL-4         (A12)                                   /* PM1
   4 NT-TXT-1035-THOUS-4  (A3)                                    /* PM1
   4 NT-TXT-1035-COMMA-4  (A1)                                    /* PM1
   4 NT-TXT-1035-HUNDR-4  (A3)                                    /* PM1
   4 NT-TXT-1035-POINT-4  (A1)                                    /* PM1
   4 NT-TXT-1035-CENTS-4  (A2)                                    /* PM1
   4 NT-TEXT-FILL-1-4     (A8)                                    /* PM1
   4 NT-TXT-1035-MM-4     (A2)                                    /* PM1
   4 NT-TXT-1035-FILL1-4  (A1)                                    /* PM1
   4 NT-TXT-1035-DD-4     (A2)                                    /* PM1
   4 NT-TXT-1035-FILL2-4  (A1)                                    /* PM1
   4 NT-TXT-1035-YYYY-4   (A4)                                    /* PM1
   4 NT-TXT-FILL-2-4      (A1)                                    /* PM1
   4 NT-TXT-PLUS-4        (A6)                                    /* PM1
   4 NT-TXT-LUMP-STUFF-4  (A13)                                   /* PM2
   4 REDEFINE NT-TXT-LUMP-STUFF-4                                 /* PM2
    5 NT-TXT-LUMP-THOUS-4  (A2)                                   /* PM1
    5 NT-TXT-LUMP-COMMA-4  (A1)                                   /* PM1
    5 NT-TXT-LUMP-HUNDR-4  (A3)                                   /* PM1
    5 NT-TXT-LUMP-POINT-4  (A1)                                   /* PM1
    5 NT-TXT-LUMP-CENTS-4  (A2)                                   /* PM1
    5 NT-TXT-FILL-3-4      (A4)                                   /* PM1
   4 REDEFINE NT-TXT-LUMP-STUFF-4                                 /* PM2
    5 NT-TXT-LUMP-THOUS-5  (A3)                                   /* PM2
    5 NT-TXT-LUMP-COMMA-5  (A1)                                   /* PM2
    5 NT-TXT-LUMP-HUNDR-5  (A3)                                   /* PM2
    5 NT-TXT-LUMP-POINT-5  (A1)                                   /* PM2
    5 NT-TXT-LUMP-CENTS-5  (A2)                                   /* PM2
    5 NT-TXT-FILL-3-5      (A3)                                   /* PM2
 2 REDEFINE NOTE-TEXT
  3 NOTE-TEXT-OCC-FLEX (60)
   4 NT-TXT-LBL-FLEX    (A11)
   4 NT-TXT-FLEX-THOUS  (A2)
   4 NT-TXT-FLEX-COMMA  (A1)
   4 NT-TXT-FLEX-HUNDR  (A3)
   4 NT-TEXT-FILL-4     (A8)
   4 NT-TXT-FLEX-MM     (A2)
   4 NT-TXT-FLEX-FILL1  (A1)
   4 NT-TXT-FLEX-DD     (A2)
   4 NT-TXT-FLEX-FILL2  (A1)
   4 NT-TXT-FLEX-YYYY   (A4)
   4 NT-TXT-FILL-5      (A25)
 2 REDEFINE NOTE-TEXT                                             /* PM1
  3 NOTE-TEXT-OCC-FLEX-2 (60)                                     /* PM1
   4 NT-TXT-LBL-FLEX-2    (A11)                                   /* PM1
   4 NT-TXT-FLEX-THOUS-2  (A2)                                    /* PM1
   4 NT-TXT-FLEX-COMMA-2  (A1)                                    /* PM1
   4 NT-TXT-FLEX-HUNDR-2  (A3)                                    /* PM1
   4 NT-TXT-FLEX-POINT-2  (A1)                                    /* PM1
   4 NT-TXT-FLEX-CENTS-2  (A2)                                    /* PM1
   4 NT-TEXT-FILL-4-2     (A8)                                    /* PM1
   4 NT-TXT-FLEX-MM-2     (A2)                                    /* PM1
   4 NT-TXT-FLEX-FILL1-2  (A1)                                    /* PM1
   4 NT-TXT-FLEX-DD-2     (A2)                                    /* PM1
   4 NT-TXT-FLEX-FILL2-2  (A1)                                    /* PM1
   4 NT-TXT-FLEX-YYYY-2   (A4)                                    /* PM1
   4 NT-TXT-FILL-5-2      (A22)                                   /* PM1
 2 REDEFINE NOTE-TEXT                                             /* PM2
  3 NOTE-TEXT-OCC-FLEX-3 (60)                                     /* PM2
   4 NT-TXT-LBL-FLEX-3    (A11)                                   /* PM2
   4 NT-TXT-FLEX-THOUS-3  (A3)                                    /* PM2
   4 NT-TXT-FLEX-COMMA-3  (A1)                                    /* PM2
   4 NT-TXT-FLEX-HUNDR-3  (A3)                                    /* PM2
   4 NT-TXT-FLEX-POINT-3  (A1)                                    /* PM2
   4 NT-TXT-FLEX-CENTS-3  (A2)                                    /* PM2
   4 NT-TEXT-FILL-4-3     (A8)                                    /* PM2
   4 NT-TXT-FLEX-MM-3     (A2)                                    /* PM2
   4 NT-TXT-FLEX-FILL1-3  (A1)                                    /* PM2
   4 NT-TXT-FLEX-DD-3     (A2)                                    /* PM2
   4 NT-TXT-FLEX-FILL2-3  (A1)                                    /* PM2
   4 NT-TXT-FLEX-YYYY-3   (A4)                                    /* PM2
   4 NT-TXT-FILL-5-3      (A21)                                   /* PM2
*
1 #NT-1035     (N5)
1 REDEFINE #NT-1035
 2 #NT-1035-THOUS  (A2)
 2 #NT-1035-HUNDR  (A3)
1 REDEFINE #NT-1035
 2 #NT-1035-X   (A1/5)
*
1 #NT-1035-3   (N6)
1 REDEFINE #NT-1035-3
 2 #NT-1035-THOUS-3(A3)
 2 #NT-1035-HUNDR-3(A3)
1 REDEFINE #NT-1035-3
 2 #NT-1035-X-3 (A1/6)
*
1 #NT-1035-4   (N6.2)                                             /* PM1
1 REDEFINE #NT-1035-4                                             /* PM1
 2 #NT-1035-THOUS-4(A3)                                           /* PM1
 2 #NT-1035-HUNDR-4(A3)                                           /* PM1
 2 #NT-1035-CENTS-4(A2)                                           /* PM1
1 REDEFINE #NT-1035-4                                             /* PM1
 2 #NT-1035-X-4 (A1/8)                                            /* PM1
*
1 #NT-LUMP     (N5)
1 REDEFINE #NT-LUMP
 2 #NT-LUMP-THOUS  (A2)
 2 #NT-LUMP-HUNDR  (A3)
1 REDEFINE #NT-LUMP
 2 #NT-LUMP-X   (A1/5)
*
1 #NT-LUMP-4   (N5.2)                                             /* PM1
1 REDEFINE #NT-LUMP-4                                             /* PM1
 2 #NT-LUMP-THOUS-4  (A2)                                         /* PM1
 2 #NT-LUMP-HUNDR-4  (A3)                                         /* PM1
 2 #NT-LUMP-CENTS-4  (A2)                                         /* PM1
1 REDEFINE #NT-LUMP-4                                             /* PM1
 2 #NT-LUMP-X-4   (A1/7)                                          /* PM1
*
1 #NT-LUMP-5   (N6.2)                                             /* PM2
1 REDEFINE #NT-LUMP-5                                             /* PM2
 2 #NT-LUMP-THOUS-5  (A3)                                         /* PM2
 2 #NT-LUMP-HUNDR-5  (A3)                                         /* PM2
 2 #NT-LUMP-CENTS-5  (A2)                                         /* PM2
1 REDEFINE #NT-LUMP-5                                             /* PM2
 2 #NT-LUMP-X-5   (A1/8)                                          /* PM2
*
1 #COUNTERS
 2 J       (I2)
 2 #I2     (I2)
 2 #I3     (I2)
*
1 #YYYYMMDD     (N8)
1 REDEFINE #YYYYMMDD
 2 #YYYY    (N4)
 2 #MM      (N2)
 2 #DD      (N2)
1 REDEFINE #YYYYMMDD
 2 #YYYYMMDD-A (A8)
1 REDEFINE #YYYYMMDD
 2 #YYYYMM  (N6)
*
1 #nt-iss-dt           (n8)       /* DW3
1 redefine #nt-iss-dt
 2 #nt-iss-dt-a    (a8)
1 #found-nt-MEC-orig   (l)
*
1 #VERSION  (A1)
1 ST-V VIEW OF A-STATUS
  2 MEMBER-CONTACT-ID (N8)
  2 C*ACTIVE-SEGMENTS (I2)
  2 ISSUE-DATE (9)
  2 VERSION    (9)
1 #GENDER (A1)
1 X       (P7.6)
1 Y       (P7.6)
END-DEFINE
*
FORMAT  LS=133 PS=76
*   WRITE 'top of GMECCSXX' #ID-NUMBER #ISS-DATE #PAY-STATUS #PLAN
*         'tpp=' #TOT-PREMS-PAID '#ANN-PREM=' #ANN-PREM
*
RESET #1035-EXCH-AMT #LUMP-PMT #1035-NX #EXCEEDS-MEC #MAX-7-PAY
*
IF #SUFFIX = '135'   /* get 1035 note info only
  PERFORM CHECK-NOTE
  ESCAPE ROUTINE
END-IF
*
IF  (#ISS-DATE LE 19880620)
 OR (#PAY-STATUS = '45')                        /* RPU
* OR (#PLAN = 'LT' OR = 'RT' OR = 'SO' or = 'GPL')       /* DW4
 OR (#PLAN = 'SO' or = 'GPL' or = 'GP2')                   /* TT1  /* YK1
* OR ((#PLAN-A1 GE 'U') AND (#PLAN-A1 LE 'Z'))   /* LTII /* YK1
 OR FUNCTION-TERM-POLICY(<#PLAN>)                        /* YK1
 OR ((#PAY-STATUS = '48')                       /* PUAP after 7th year
      AND ((#PD-UP-DATE - #ISS-DATE GE 70000)))
  ESCAPE ROUTINE
END-IF
*
PERFORM CHECK-NOTE
*
IF #DURATION = 0
  MOVE 1 TO #DUR
ELSE
  MOVE #DURATION TO #DUR /* curr duration
END-IF
MOVE #TOT-PREMS-PAID TO #TPP /* current tot prems paid
*
IF #PAY-STATUS = '47'
  RESET #ANN-PREM
END-IF
*
IF #PAY-STATUS = '47'   /* PUSP
  MOVE 1 TO #DUR /* MEC as of 1st year
ELSE
  IF #PAY-STATUS GT '40'   /* other paid up
    MOVE #PD-UP-DATE TO #YYYYMMDD
    SUBTRACT #ISS-DATE FROM #YYYYMMDD
    IF #MM GT 0  /* bump to next dur if not paid up in same month
      ADD 1 TO #YYYY
    END-IF
*
    MOVE #YYYY TO #DUR  /* MEC as of paid-up date
  ELSE    /* still prem paying paying
    IF (#1035-EXCH-AMT NE 0) OR (#LUMP-PMT NE 0) /* Flex w init pmt
      MOVE 1 TO #DUR   /* MEC as of if year 1 when init pmt made
      COMPUTE #TPP = #VW-TOT-PREMS-PAID + #ANN-PREM /* Init + 1 year
    ELSE
      COMPUTE #FULL-YR-ANN-PREMS = #ANN-PREM * #DUR
*
*     DISPLAY #FULL-YR-ANN-PREMS #TPP #VW-TOT-PREMS-PAID
      IF   (#FULL-YR-ANN-PREMS GT #TPP)   /* use full years prems
       AND (#VW-TOT-PREMS-PAID GE 0) /* and conv adj is not in #tpp
        MOVE #FULL-YR-ANN-PREMS TO #TPP
      END-IF
    END-IF
  END-IF
END-IF
*  WRITE 'Gmeccsxx tpp=' #TPP
*
*                                 NG1   \/\/\/
* COMPUTE #AGE-X = #ISS-AGE-N + 1
*
* IF #AGE-X GT 72
*   MOVE 72 TO #AGE-X
* END-IF
* IF #SMOKER-FLAG = 'S'
*   MOVE  #1035-ADJ-SM (#AGE-X) TO #1035-ADJ
*   COMPUTE #PREM-6-6 = (#7-PA-MAX-PRM-SM (#AGE-X)
*    * (#FACE-AMT / 10000)) * #DUR
*   MOVE ROUNDED #PREM-6-6 TO #MAX-7-PAY
* ELSE
*   MOVE  #1035-ADJ-NS (#AGE-X) TO #1035-ADJ
*   COMPUTE #PREM-6-6 = (#7-PA-MAX-PRM-NS (#AGE-X)
*    * (#FACE-AMT / 10000)) * #DUR
*   MOVE ROUNDED #PREM-6-6 TO #MAX-7-PAY
* END-IF
* *
* COMPUTE #MEC-PREMS-PAID-TO-DATE =
*  (#1035-EXCH-AMT * #1035-ADJ) + #TPP
*    - #1035-EXCH-AMT /* back it out since it is already in tot-prms-paid
FIND ST-V WITH ID-NUMBER = #ID-NUMBER
  #GENDER := GET-GENDER (< ST-V.MEMBER-CONTACT-ID >)
  FOR J 1 TO C*ACTIVE-SEGMENTS
    IF ST-V.ISSUE-DATE (J) = #ISS-DATE
        #VERSION := ST-V.VERSION (J)
      ESCAPE BOTTOM
    END-IF
  END-FOR
END-FIND
#AGE-X := #ISS-AGE-N
Y := Get1035Adj (< #AGE-X,#SMOKER-FLAG,#GENDER,#VERSION>)
X := Get7Pay (< #AGE-X,#SMOKER-FLAG,#GENDER,#VERSION >)
COMPUTE #PREM-6-6 = X * (#FACE-AMT / 10000) * #DUR
MOVE ROUNDED #PREM-6-6 TO #MAX-7-PAY
**COMPUTE ROUNDED #MAX-7-PAY = X * (#FACE-AMT / 10000) * #DUR
COMPUTE #MEC-PREMS-PAID-TO-DATE =
 (#1035-EXCH-AMT * Y) + #TPP
   - #1035-EXCH-AMT /* back it out since it is already in tot-prms-paid
COMPUTE #MAX-7-PAY-DIFF = #MEC-PREMS-PAID-TO-DATE - #MAX-7-PAY
*                                   NG1  /\/\/\
IF #MAX-7-PAY-DIFF GT 0
  MOVE #MAX-7-PAY-DIFF TO #EXCEEDS-MEC
ELSE
  RESET #EXCEEDS-MEC
END-IF
*
IF #FORCED-MEC
  MOVE 999999.99 TO #EXCEEDS-MEC #MAX-7-PAY-DIFF
END-IF
*
if #found-nt-MEC-orig /* Is a 1035 MEC since it was originally a MEC  /* DW3
  MOVE 999999.99 TO #EXCEEDS-MEC #MAX-7-PAY-DIFF
end-if
*
* IF #MAX-7-PAY-DIFF GT 0
* WRITE 'GMECCSXX' #ID-NUMBER
*  #ISS-DATE
*  #PLAN
*  'ANN-PRM=' #ANN-PREM
*  'MX-7-PA=' #MAX-7-PAY
*  'dif=' #MAX-7-PAY-DIFF
*  'paid todt=' #MEC-PREMS-PAID-TO-DATE
*  'BEFORE TOT-PREMS-PAID' #TPP
*  '1035-exch-amt=' #1035-EXCH-AMT
*  '1035-adj%=' #1035-ADJ
*  'pa-st=' #PAY-STATUS
*  'IS-AG=' #ISS-AGE
*  'DUR=' #DUR
*  'sm=' #SMOKER-FLAG
*  'fac=' #FACE-AMT
*  'exceeds-mec' #EXCEEDS-MEC
* END-IF
*
* * * * * * * * * * * * * * *
DEFINE SUBROUTINE CHECK-NOTE
* * * * * * * * * * * * * * *
*
FIND (1) NT-V WITH ID-NUMBER = #ID-NUMBER
  FOR #I2 1 TO 60
    if   (nt-txt-is-a-mec (#i2) = mask ('is a MEC since the orig pol'))
     and (nt-txt-pol-iss (#i2) = '* POL ISS ')
      compress nt-txt-pol-iss-yyyy (#i2) nt-txt-pol-iss-mm (#i2)
           nt-txt-pol-iss-dd (#i2) into #nt-iss-dt-a leaving no
      if #nt-iss-dt = #iss-date
        move true to #found-nt-MEC-orig
*        write #id-number 'was a MEC prior'
      end-if
    end-if
*
    IF NT-TXT-LBL (#I2) = '*1035 EXCH $'
      IF NT-TXT-1035-COMMA (#I2) = ','  /* old layout
        COMPRESS NT-TXT-1035-YYYY (#I2) NT-TXT-1035-MM (#I2)
               NT-TXT-1035-DD   (#I2) INTO #YYYYMMDD-A LEAVING NO
*       WRITE #ID-NUMBER '1035-date' #YYYYMMDD
        IF  (#YYYYMMDD-A NE MASK (YYYYMMDD))
         OR (#YYYYMMDD NE #ISS-DATE)
          ESCAPE TOP
        END-IF
*
        MOVE NOTE-TEXT (#I2) TO #1035-NX
        MOVE NT-TXT-1035-THOUS (#I2) TO #NT-1035-THOUS
        MOVE NT-TXT-1035-HUNDR (#I2) TO #NT-1035-HUNDR
        FOR #I3 1 TO 5
          IF #NT-1035-X (#I3) = ' '
            MOVE '0' TO #NT-1035-X (#I3)
          END-IF
        END-FOR
*
        IF #NT-1035 = MASK (NNNNN)
          MOVE #NT-1035 TO #1035-EXCH-AMT
        END-IF
*
        IF NT-TXT-PLUS (#I2) = 'PLUS $'
          MOVE NT-TXT-LUMP-THOUS (#I2) TO #NT-LUMP-THOUS
          MOVE NT-TXT-LUMP-HUNDR (#I2) TO #NT-LUMP-HUNDR
          FOR #I3 1 TO 5
            IF #NT-LUMP-X (#I3) = ' '
              MOVE '0' TO #NT-LUMP-X (#I3)
            END-IF
          END-FOR
*
          IF #NT-LUMP = MASK (NNNNN)
            MOVE #NT-LUMP TO #LUMP-PMT
          END-IF
        END-IF
      ELSE
        IF NT-TXT-1035-POINT-4 (#I2) = '.' /* new zzz,zzz.99 format  PM1
          COMPRESS NT-TXT-1035-YYYY-4 (#I2) NT-TXT-1035-MM-4 (#I2)
                   NT-TXT-1035-DD-4   (#I2) INTO #YYYYMMDD-A LEAVING NO
*         WRITE #ID-NUMBER '1035-date' #YYYYMMDD                  /* PM1
          IF  (#YYYYMMDD-A NE MASK (YYYYMMDD))                    /* PM1
           OR (#YYYYMMDD NE #ISS-DATE)                            /* PM1
            ESCAPE TOP                                            /* PM1
          END-IF                                                  /* PM1
*
          MOVE NOTE-TEXT (#I2) TO #1035-NX                        /* PM1
          MOVE NT-TXT-1035-THOUS-4 (#I2) TO #NT-1035-THOUS-4      /* PM1
          MOVE NT-TXT-1035-HUNDR-4 (#I2) TO #NT-1035-HUNDR-4      /* PM1
          MOVE NT-TXT-1035-CENTS-4 (#I2) TO #NT-1035-CENTS-4      /* PM1
          FOR #I3 1 TO 8                                          /* PM1
            IF #NT-1035-X-4 (#I3) = ' '                           /* PM1
              MOVE '0' TO #NT-1035-X-4 (#I3)                      /* PM1
            END-IF                                                /* PM1
          END-FOR                                                 /* PM1
*
          IF #NT-1035-4 = MASK (NNNNNNNN)                         /* PM1
            MOVE #NT-1035-4 TO #1035-EXCH-AMT                     /* PM1
          END-IF                                                  /* PM1
*
          IF NT-TXT-PLUS-4 (#I2) = 'PLUS $'                       /* PM1
            IF NT-TXT-LUMP-POINT-4 (#I2) = '.' /* zz,zz9.99       /* PM2
              MOVE NT-TXT-LUMP-THOUS-4 (#I2) TO #NT-LUMP-THOUS-4  /* PM1
              MOVE NT-TXT-LUMP-HUNDR-4 (#I2) TO #NT-LUMP-HUNDR-4  /* PM1
              MOVE NT-TXT-LUMP-CENTS-4 (#I2) TO #NT-LUMP-CENTS-4  /* PM1
              FOR #I3 1 TO 7                                      /* PM1
                IF #NT-LUMP-X-4 (#I3) = ' '                       /* PM1
                  MOVE '0' TO #NT-LUMP-X-4 (#I3)                  /* PM1
                END-IF                                            /* PM1
              END-FOR                                             /* PM1
*
              IF #NT-LUMP-4 = MASK (NNNNNNN)                      /* PM1
                MOVE #NT-LUMP-4 TO #LUMP-PMT                      /* PM1
              END-IF                                              /* PM1
            ELSE                                                  /* PM2
              MOVE NT-TXT-LUMP-THOUS-5 (#I2) TO #NT-LUMP-THOUS-5  /* PM2
              MOVE NT-TXT-LUMP-HUNDR-5 (#I2) TO #NT-LUMP-HUNDR-5  /* PM2
              MOVE NT-TXT-LUMP-CENTS-5 (#I2) TO #NT-LUMP-CENTS-5  /* PM2
              FOR #I3 1 TO 8                                      /* PM2
                IF #NT-LUMP-X-5 (#I3) = ' '                       /* PM2
                  MOVE '0' TO #NT-LUMP-X-5 (#I3)                  /* PM2
                END-IF                                            /* PM2
              END-FOR                                             /* PM2
*
              IF #NT-LUMP-5 = MASK (NNNNNNNN)                     /* PM2
                MOVE #NT-LUMP-5 TO #LUMP-PMT                      /* PM2
              END-IF                                              /* PM2
            END-IF                                                /* PM2
          END-IF                                                  /* PM1
        ELSE   /* old zzz,zzz layout
          COMPRESS NT-TXT-1035-YYYY-3 (#I2) NT-TXT-1035-MM-3 (#I2)
                 NT-TXT-1035-DD-3   (#I2) INTO #YYYYMMDD-A LEAVING NO
*         WRITE #ID-NUMBER '1035-date' #YYYYMMDD
          IF  (#YYYYMMDD-A NE MASK (YYYYMMDD))
           OR (#YYYYMMDD NE #ISS-DATE)
            ESCAPE TOP
          END-IF
*
          MOVE NOTE-TEXT (#I2) TO #1035-NX
          MOVE NT-TXT-1035-THOUS-3 (#I2) TO #NT-1035-THOUS-3
          MOVE NT-TXT-1035-HUNDR-3 (#I2) TO #NT-1035-HUNDR-3
          FOR #I3 1 TO 6
            IF #NT-1035-X-3 (#I3) = ' '
              MOVE '0' TO #NT-1035-X-3 (#I3)
            END-IF
          END-FOR
*
          IF #NT-1035-3 = MASK (NNNNNN)
            MOVE #NT-1035-3 TO #1035-EXCH-AMT
          END-IF
*
          IF NT-TXT-PLUS-3 (#I2) = 'PLUS $'
            MOVE NT-TXT-LUMP-THOUS-3 (#I2) TO #NT-LUMP-THOUS
            MOVE NT-TXT-LUMP-HUNDR-3 (#I2) TO #NT-LUMP-HUNDR
            FOR #I3 1 TO 5
              IF #NT-LUMP-X (#I3) = ' '
                MOVE '0' TO #NT-LUMP-X (#I3)
              END-IF
            END-FOR
*
            IF #NT-LUMP = MASK (NNNNN)
              MOVE #NT-LUMP TO #LUMP-PMT
            END-IF
          END-IF
        END-IF
      END-IF                                                      /* PM1
    END-IF
*
    IF NT-TXT-LBL-FLEX (#I2) = '*FLEX AMT $'
      IF NT-TXT-FLEX-POINT-2 (#I2) = '.'   /* new ZZ,ZZZ.99 format   PM1
        COMPRESS NT-TXT-FLEX-YYYY-2 (#I2) NT-TXT-FLEX-MM-2 (#I2)  /* PM1
                 NT-TXT-FLEX-DD-2   (#I2) INTO #YYYYMMDD-A LEAVING NO
*       WRITE #ID-NUMBER 'flex-date' #YYYYMMDD                    /* PM1
        IF  (#YYYYMMDD-A NE MASK (YYYYMMDD))                      /* PM1
         OR (#YYYYMMDD NE #ISS-DATE)                              /* PM1
          ESCAPE TOP                                              /* PM1
        END-IF                                                    /* PM1
*
        MOVE NOTE-TEXT (#I2) TO #1035-NX                          /* PM1
        MOVE NT-TXT-FLEX-THOUS-2 (#I2) TO #NT-LUMP-THOUS-4        /* PM1
        MOVE NT-TXT-FLEX-HUNDR-2 (#I2) TO #NT-LUMP-HUNDR-4        /* PM1
        MOVE NT-TXT-FLEX-CENTS-2 (#I2) TO #NT-LUMP-CENTS-4        /* PM1
        FOR #I3 1 TO 7                                            /* PM1
          IF #NT-LUMP-X-4 (#I3) = ' '                             /* PM1
            MOVE '0' TO #NT-LUMP-X-4 (#I3)                        /* PM1
          END-IF                                                  /* PM1
        END-FOR                                                   /* PM1
*
        IF #NT-LUMP-4 = MASK (NNNNNNN)                            /* PM1
          MOVE #NT-LUMP-4 TO #LUMP-PMT                            /* PM1
        END-IF                                                    /* PM1
      ELSE                                                        /* PM1
        IF NT-TXT-FLEX-POINT-3 (#I2) = '.'   /* new zzz,zzz.99    /* PM2
          COMPRESS NT-TXT-FLEX-YYYY-3 (#I2) NT-TXT-FLEX-MM-3 (#I2)/* PM2
                   NT-TXT-FLEX-DD-3   (#I2) INTO #YYYYMMDD-A LEAVING NO
*         WRITE #ID-NUMBER 'flex-date' #YYYYMMDD                  /* PM2
          IF  (#YYYYMMDD-A NE MASK (YYYYMMDD))                    /* PM2
           OR (#YYYYMMDD NE #ISS-DATE)                            /* PM2
            ESCAPE TOP                                            /* PM2
          END-IF                                                  /* PM2
*
          MOVE NOTE-TEXT (#I2) TO #1035-NX                        /* PM2
          MOVE NT-TXT-FLEX-THOUS-3 (#I2) TO #NT-LUMP-THOUS-5      /* PM2
          MOVE NT-TXT-FLEX-HUNDR-3 (#I2) TO #NT-LUMP-HUNDR-5      /* PM2
          MOVE NT-TXT-FLEX-CENTS-3 (#I2) TO #NT-LUMP-CENTS-5      /* PM2
          FOR #I3 1 TO 8                                          /* PM2
            IF #NT-LUMP-X-5 (#I3) = ' '                           /* PM2
              MOVE '0' TO #NT-LUMP-X-5 (#I3)                      /* PM2
            END-IF                                                /* PM2
          END-FOR                                                 /* PM2
*
          IF #NT-LUMP-5 = MASK (NNNNNNNN)                         /* PM2
            MOVE #NT-LUMP-5 TO #LUMP-PMT                          /* PM2
          END-IF                                                  /* PM2
        ELSE                                                      /* PM2
          COMPRESS NT-TXT-FLEX-YYYY (#I2) NT-TXT-FLEX-MM (#I2)
                   NT-TXT-FLEX-DD   (#I2) INTO #YYYYMMDD-A LEAVING NO
*         WRITE #ID-NUMBER 'flex-date' #YYYYMMDD
          IF  (#YYYYMMDD-A NE MASK (YYYYMMDD))
           OR (#YYYYMMDD NE #ISS-DATE)
            ESCAPE TOP
          END-IF
*
          MOVE NOTE-TEXT (#I2) TO #1035-NX
          MOVE NT-TXT-FLEX-THOUS (#I2) TO #NT-LUMP-THOUS
          MOVE NT-TXT-FLEX-HUNDR (#I2) TO #NT-LUMP-HUNDR
          FOR #I3 1 TO 5
            IF #NT-LUMP-X (#I3) = ' '
              MOVE '0' TO #NT-LUMP-X (#I3)
            END-IF
          END-FOR
*
          IF #NT-LUMP = MASK (NNNNN)
            MOVE #NT-LUMP TO #LUMP-PMT
          END-IF
        END-IF                                                    /* PM2
      END-IF
    END-IF
  END-FOR
END-FIND
*
END-SUBROUTINE
*
END
