* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*   PGM-ID GMLSTSXX
*    DOES THE MILITARY STATUS CODE EDIT
*    MILITARY-STATUS ON ADABAS FILE
*
*     A   = ACTIVE ARMY
*     C   = CIVILIAN
*     R   = RETIRED
*
DEFINE DATA PARAMETER
 1 #MIL-STATUS    (A1)
 1 #INVALID       (L)
 1 #ERR-MSG       (A60)
END-DEFINE
*
MOVE TRUE TO #INVALID
MOVE 'MIL STATUS MUST BE A, R, OR C'
                                                     TO #ERR-MSG
*
IF #MIL-STATUS = 'A' OR = 'C' OR = 'R'
  MOVE FALSE TO #INVALID
END-IF
END
