DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
/*                                       ** retired life mortality
/*                                       * expectations
/*
 1 #RETR-LIFE-EXP
   2 #M-16 (A20)
     INIT<'5206-0000-4990-0000-'>
   2 #M-17 (A20)
     INIT<'5125-0000-4908-0000-'>
   2 #M-18 (A20)
     INIT<'5045-0000-4826-0000-'>
   2 #M-19 (A20)
     INIT<'4966-0000-4725-0000-'>
   2 #M-20 (A20)
     INIT<'4886-0000-4664-0000-'>
   2 #M-21 (A20)
     INIT<'4807-0000-4583-0000-'>
   2 #M-22 (A20)
     INIT<'4728-0000-4502-0000-'>
   2 #M-23 (A20)
     INIT<'4650-0000-4422-0000-'>
   2 #M-24 (A20)
     INIT<'4571-0000-4341-0000-'>
   2 #M-25 (A20)
     INIT<'4491-0000-4260-0000-'>
   2 #M-26 (A20)
     INIT<'4412-0000-4179-0000-'>
   2 #M-27 (A20)
     INIT<'4331-0000-4096-0000-'>
   2 #M-28 (A20)
     INIT<'4250-0000-4014-0000-'>
   2 #M-29 (A20)
     INIT<'4169-0000-3933-0000-'>
   2 #M-30 (A20)
     INIT<'4087-0000-3852-0000-'>
   2 #M-31 (A20)
     INIT<'4005-0000-3772-0000-'>
   2 #M-32 (A20)
     INIT<'3923-0000-3691-0000-'>
   2 #M-33 (A20)
     INIT<'3840-0000-3609-0000-'>
   2 #M-34 (A20)
     INIT<'3757-0000-3527-0000-'>
   2 #M-35 (A20)
     INIT<'3674-4484-3443-4097-'>
   2 #M-36 (A20)
     INIT<'3591-4386-3359-4001-'>
   2 #M-37 (A20)
     INIT<'3508-4289-3275-3906-'>
   2 #M-38 (A20)
     INIT<'3425-4191-3191-3811-'>
   2 #M-39 (A20)
     INIT<'3343-4094-3107-3716-'>
   2 #M-40 (A20)
     INIT<'3260-3996-3024-3621-'>
   2 #M-41 (A20)
     INIT<'3177-3899-2941-3527-'>
   2 #M-42 (A20)
     INIT<'3095-3802-2839-3432-'>
   2 #M-43 (A20)
     INIT<'3013-3706-2776-3338-'>
   2 #M-44 (A20)
     INIT<'2932-3609-2694-3245-'>
   2 #M-45 (A20)
     INIT<'2853-3514-2612-3152-'>
   2 #M-46 (A20)
     INIT<'2774-3419-2531-3059-'>
   2 #M-47 (A20)
     INIT<'2697-3324-2451-2967-'>
   2 #M-48 (A20)
     INIT<'2622-3231-2372-2877-'>
   2 #M-49 (A20)
     INIT<'2548-3138-2295-2787-'>
   2 #M-50 (A20)
     INIT<'2476-3045-2219-2698-'>
   2 #M-51 (A20)
     INIT<'2405-2953-2146-2610-'>
   2 #M-52 (A20)
     INIT<'2335-2862-2075-2523-'>
   2 #M-53 (A20)
     INIT<'2267-2772-2005-2438-'>
   2 #M-54 (A20)
     INIT<'2200-2683-1937-2354-'>
   2 #M-55 (A20)
     INIT<'2134-2594-1871-2271-'>
   2 #M-56 (A20)
     INIT<'2069-2506-1805-2190-'>
   2 #M-57 (A20)
     INIT<'2004-2419-1739-2110-'>
   2 #M-58 (A20)
     INIT<'1940-2333-1674-2032-'>
   2 #M-59 (A20)
     INIT<'1876-2248-1610-1955-'>
   2 #M-60 (A20)
     INIT<'1812-2163-1548-1880-'>
   2 #M-61 (A20)
     INIT<'1749-2079-1487-1806-'>
   2 #M-62 (A20)
     INIT<'1685-1996-1429-1734-'>
   2 #M-63 (A20)
     INIT<'1622-1915-1374-1664-'>
   2 #M-64 (A20)
     INIT<'1558-1835-1321-1595-'>
   2 #M-65 (A20)
     INIT<'1495-1756-1271-1528-'>
   2 #M-66 (A20)
     INIT<'1432-1680-1225-1463-'>
   2 #M-67 (A20)
     INIT<'1370-1605-1176-1399-'>
   2 #M-68 (A20)
     INIT<'1308-1531-1128-1336-'>
   2 #M-69 (A20)
     INIT<'1247-1460-1981-1275-'>
   2 #M-70 (A20)
     INIT<'1186-1390-1035-1216-'>
   2 #M-71 (A20)
     INIT<'1127-1321-0966-1157-'>
   2 #M-72 (A20)
     INIT<'1070-1254-0940-1101-'>
   2 #M-73 (A20)
     INIT<'1014-1189-0897-1046-'>
   2 #M-74 (A20)
     INIT<'0960-1126-0856-0994-'>
   2 #M-75 (A20)
     INIT<'0908-1064-0818-0943-'>
   2 #M-76 (A20)
     INIT<'0858-1004-0781-0895-'>
   2 #M-77 (A20)
     INIT<'0811-0946-0746-0849-'>
   2 #M-78 (A20)
     INIT<'0765-0891-0713-0805-'>
   2 #M-79 (A20)
     INIT<'0722-0837-0680-0763-'>
   2 #M-80 (A20)
     INIT<'0681-0785-0648-0723-'>
   2 #M-81 (A20)
     INIT<'0643-0736-0616-0684-'>
   2 #M-82 (A20)
     INIT<'0607-0689-0584-0648-'>
   2 #M-83 (A20)
     INIT<'0573-0644-0552-0613-'>
   2 #M-84 (A20)
     INIT<'0540-0602-0520-0580-'>
   2 #M-85 (A20)
     INIT<'0510-0562-0488-0548-'>
   2 #M-86 (A20)
     INIT<'0482-0525-0456-0518-'>
   2 #M-87 (A20)
     INIT<'0456-0489-0424-0489-'>
   2 #M-88 (A20)
     INIT<'0431-0457-0393-0462-'>
   2 #M-89 (A20)
     INIT<'0408-0426-0361-0436-'>
   2 #M-90 (A20)
     INIT<'0386-0398-0333-0411-'>
   2 #M-91 (A20)
     INIT<'0365-0372-0306-0387-'>
   2 #M-92 (A20)
     INIT<'0346-0347-0284-0365-'>
   2 #M-93 (A20)
     INIT<'0328-0325-0266-0344-'>
   2 #M-94 (A20)
     INIT<'0311-0305-0256-0324-'>
   2 #M-95 (A20)
     INIT<'0295-0286-0246-0306-'>
   2 #M-96 (A20)
     INIT<'0280-0268-0237-0288-'>
   2 #M-97 (A20)
     INIT<'0265-0253-0228-0273-'>
   2 #M-98 (A20)
     INIT<'0252-0239-0219-0258-'>
   2 #M-99 (A20)
     INIT<'0239-0227-0211-0246-'>
   2 #M-100 (A20)
     INIT<'0226-0218-0203-0234-'>
   2 #M-101 (A20)
     INIT<'0214-0209-0195-0222-'>
   2 #M-102 (A20)
     INIT<'0202-0200-0187-0211-'>
   2 #M-103 (A20)
     INIT<'0191-0191-0178-0200-'>
   2 #M-104 (A20)
     INIT<'0179-0182-0170-0188-'>
   2 #M-105 (A20)
     INIT<'0168-0172-0161-0176-'>
 1 REDEFINE #RETR-LIFE-EXP /* REDEF. BEGIN : #RETR-LIFE EXP
   2 #MORT-EXP-AGE (90)
     3 #MORT-EXP-OFF-ENL (2)
       4 #MORT-EXP-DIS-NON (2)
         5 #MORT-EXP (N2.2)
         5 #MORT-FILL (A1)
END-DEFINE
