* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*   PGM-ID GNUSTSXX
*    Show and edit states for a North Carolina edit                     lina)
*
********************************************************************************
*                       MODIFICATION LOG
* USER DATE     TAG  REASON
* DRW  02282007 DW1  Create
* PAM  03082007 PM2  Added ability to exit screen
* YAK  04302007 YK1  Allow North Carolina applications 
********************************************************************************
DEFINE DATA PARAMETER
1 #state     (a2)
1 #Invalid    (l)
1 #SCR-COMMAND (A2)         /* PM2
1 #SCR-ID      (N9)         /* PM2
1 #SCR-SUFFIX  (A3)         /* PM2
*
local
1 #i1     (i2)
1 #st-ind (a1/51)
1 redefine #st-ind
 2 #st-ind-2 (a1/51)
1 redefine #st-ind
 2 #st-ind-3  (a1/51)
*
1 #states
 2 #st1  (a18) init <'AL-ALABAMA'>
 2 #st2  (a18) init <'AK-ALASKA'>
 2 #st3  (a18) init <'AR-ARKANSAS'>
 2 #st4  (a18) init <'AZ-ARIZONA'>
 2 #st5  (a18) init <'CA-CALIFORNIA'>
 2 #st6  (a18) init <'CO-COLORADO'>
 2 #st7  (a18) init <'CT-CONNECTICUT'>
 2 #st8  (a18) init <'DE-DELAWARE'>
 2 #st9  (a18) init <'DC-DIST COLUMBIA'>
 2 #st10 (a18) init <'FL-FLORIDA'>
 2 #st11 (a18) init <'GA-GEORGIA'>
 2 #st12 (a18) init <'HI-HAWAII'>
 2 #st13 (a18) init <'ID-IDAHO'>
 2 #st14 (a18) init <'IL-ILLINOIS'>
 2 #st15 (a18) init <'IN-INDIANA'>
 2 #st16 (a18) init <'IA-IOWA'>
 2 #st17 (a18) init <'KS-KANSAS'>
 2 #st18 (a18) init <'KY-KENTUCKY'>
 2 #st19 (a18) init <'LA-LOUISIANA'>
 2 #st20 (a18) init <'ME-MAINE'>
 2 #st21 (a18) init <'MD-MARYLAND'>
 2 #st22 (a18) init <'MA-MASSACHUSETTS'>
 2 #st23 (a18) init <'MI-MICHIGAN'>
 2 #st24 (a18) init <'MN-MINNESOTA'>
 2 #st25 (a18) init <'MS-MISSISSIPPI'>
 2 #st26 (a18) init <'MO-MISSOURI'>
 2 #st27 (a18) init <'MT-MONTANA'>
 2 #st28 (a18) init <'NE-NEBRASKA'>
 2 #st29 (a18) init <'NV-NEVADA'>
 2 #st30 (a18) init <'NH-NEW HAMPSHIRE'>
 2 #st31 (a18) init <'NJ-NEW JERSEY'>
 2 #st32 (a18) init <'NM-NEW MEXICO'>
 2 #st33 (a18) init <'NY-NEW YORK'>
 2 #st34 (a18) init <'NC-NORTH CAROLINA'>
 2 #st35 (a18) init <'ND-NORTH DAKOTA'>
 2 #st36 (a18) init <'OH-OHIO'>
 2 #st37 (a18) init <'OK-OKLAHOMA'>
 2 #st38 (a18) init <'OR-OREGON'>
 2 #st39 (a18) init <'PA-PENNSYLVANIA'>
 2 #st40 (a18) init <'RI-RHODE ISLAND'>
 2 #st41 (a18) init <'SC-SOUTH CAROLINA'>
 2 #st42 (a18) init <'SD-SOUTH DAKOTA'>
 2 #st43 (a18) init <'TN-TENNESSEE'>
 2 #st44 (a18) init <'TX-TEXAS'>
 2 #st45 (a18) init <'UT-UTAH'>
 2 #st46 (a18) init <'VT-VERMONT'>
 2 #st47 (a18) init <'VA-VIRGINIA'>
 2 #st48 (a18) init <'WA-WASHINGTON'>
 2 #st49 (a18) init <'WV-WEST VIRGINIA'>
 2 #st50 (a18) init <'WI-WISCONSIN'>
 2 #st51 (a18) init <'WY-WYOMING'>
1 redefine #states
 2 #st-occ   (51)
  3 #st     (a2)
  3 #fill   (a1)
  3 St-desc (a15)
1 redefine #states
 2 #st-occ-2  (51)
  3 #st-2   (a2)
  3 Fill-2  (a1)
  3 #dt-desc-2 (a15)
1 redefine #states
 2 #st-occ-3  (51)
  3 #st-3     (a2)
  3 Fill-3    (a1)
  3 #dt-desc-3 (a15)

*
END-DEFINE
*
INPUT USING MAP 'GNUSTMXX'
*
IF #SCR-COMMAND NE '*'        /* PM2
  ESCAPE ROUTINE              /* PM2
END-IF                        /* PM2
*
move true to #invalid
if #state ne ' '  /* A state was entered
  for #i1 1 to 51
    if #state = #st (#i1)
      reset #invalid
      escape bottom
    end-if
  end-for
else
  for #i1 1 to 51
    if #st-ind (#i1) ne ' '
      move #st (#i1) to #state
      reset #invalid
      escape bottom
    end-if
  end-for
end-if
*
if #invalid
  reinput 'Enter A VALID State or select a State from the list'
  mark *#state
end-if
*
* if #state = 'NC'             /* yk1 
*  move true to #invalid 
* else 
  reset #invalid
* end-if 
*
END
