DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #ADDRESS-UI
  2 #ERRORS (L)
  2 #POS (I4)
  2 #STATUS-DATE (A10)
  2 #CERT-REQUEST (L)
  2 #ZIP (A10)
END-DEFINE
