DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode R
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #CONTACT-REL
  2 CONTACT-1-ID (N8)
  2 ROLE-1-CD (A1)
  2 CONTACT-2-ID (N8)
  2 ROLE-2-CD (A1)
  2 LAST-USER-UPD (A8)
  2 ACCESS-AUTH-SVC (A1)
  2 ACCESS-AUTH-INS (A1)
  2 LAST-DATE-UPD (N8)
  2 LAST-TIME-UPD (N7)
END-DEFINE
