* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* 
************************************************************************** 
* SUBPROGRAM-ID: GOEMN002 - eMail access 
* DESCRIPTION: Retrieve Contact Email 
************************************************************************** 
*        MODIFICATION LOG 
************************************************************************** 
* USER   DATE      TAG  REASON 
* 
DEFINE DATA 
PARAMETER USING GOEMA001 
PARAMETER 
1 #MSG       (A) DYNAMIC 
* 
LOCAL 
1 EMAIL VIEW OF A-CONTACT-EMAIL 
  2 EMAIL-ID 
  2 CONTACT-ID 
  2 EMAIL-TYPE 
  2 EMAIL-ADDRESS 
  2 EMAIL-PROTECTION-IND 
  2 EMAIL-UNDELIV 
  2 EMAIL-PREFERRED-IND 
  2 STATUS 
  2 STATUS-DATE 
  2 START-DATE 
  2 END-DATE 
  2 REMARKS                   (A70/3) 
  2 LAST-DATE-UPD             (N8) 
  2 LAST-TIME-UPD             (N7) 
  2 LAST-USER-UPD             (A8) 
* 
END-DEFINE 
* 
IF #EMAIL.CONTACT-ID = 0 
  #MSG := 'No Contact ID' 
  ESCAPE ROUTINE 
END-IF 
* 
FIND EMAIL WITH CONTACT-ID = #EMAIL.CONTACT-ID 
  IF EMAIL.EMAIL-PREFERRED-IND = 'Y' 
    MOVE BY NAME EMAIL TO #EMAIL 
    ESCAPE BOTTOM 
  END-IF 
END-FIND 
* 
ON ERROR 
  COMPRESS 'Email add:' *ERROR-NR *ERROR-LINE *PROGRAM *DATN *TIME INTO #MSG 
    WITH DELIMITER ':' 
  ESCAPE ROUTINE 
END-ERROR 
* 
END 
