DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #EMAIL
  2 EMAIL-ID (N8)
  2 CONTACT-ID (N8)
  2 EMAIL-TYPE (A1)
  2 EMAIL-ADDRESS (A70)
  2 EMAIL-PROTECTION-IND (A1)
  2 EMAIL-UNDELIV (A1)
  2 EMAIL-PREFERRED-IND (A1)
  2 EMAIL-SOURCE (A1)
  2 STATUS (A1)
  2 STATUS-DATE (N8)
  2 REMARKS (A70/3)
END-DEFINE
