DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #MSC
  2 SVC-PLAN (A3)
  2 CLERK-ID (A3)
  2 NOTE-MSG (A60/1:10)
END-DEFINE
