* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*   PGM-ID GORIGSXX
*    DOES THE ORIGIN  EDIT
*    ORIGIN ON ADABAS FILE (intro-member & appl-tracking)
*
*   USMA/AFA/ROTC/OTS/OCS/WOCS/SMA/FSC/SNA/FSA/DC/OTHR
*
DEFINE DATA PARAMETER
1 #ORIGIN        (A4)
1 #INVALID       (L)
END-DEFINE
*
MOVE TRUE TO #INVALID
*
IF #ORIGIN = 'USMA' OR = 'AFA' OR = 'ROTC' OR = 'OTS' OR = 'OCS'
      OR = 'WOCS' OR = 'SMA' OR = 'FSC' OR = 'SNA' OR = 'FSA' OR = 'DC'
      OR = 'OTHR'
  MOVE FALSE TO #INVALID
END-IF
*
END
