DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #MILITARY-INFO
  2 CONTACT-ID (N8)
  2 RANK-ID (N6)
  2 RANK-ABBR (A25)
  2 RANK-PROTECT (A1)
  2 PREV-RANK-ID (N6)
  2 MILITARY-STATUS (A1)
  2 MILITARY-SERVICE (A3)
  2 RANK-PROTECT-DATE (N8)
  2 LAST-RANK-DATE-UPD (N8)
  2 LAST-RANK-USER-UPD (A8)
END-DEFINE
