* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*  GOSTAN01
* 1. Populate Address in STATUS
* Prerequisites: Field MEMBER-CONTACT-ID must has correct value
* Usage
* CALLNAT 'GOSTAN01' p_CN p_Err p_Err_Dscr p_Mod
* Parameters:
*  p_CN       (N6)
*  p_Err      (N4)
*  p_Err_Dscr (A78)
*  p_Mod      (A1)
*
* bz created 05/15/2011
* re modified 06/27/2012 RE1 Populate ADDRESS-CHG-CODE properly
DEFINE DATA
PARAMETER
1 p_CN       (N6)
1 p_Err      (N4)
1 p_Err_Dscr (A78)
1 p_Mod      (A1)
LOCAL USING ADDA0001
LOCAL
*
1 v_YYYYMMDD              (N8) INIT <*DATN>
END-DEFINE
*
ON ERROR
  p_Err := *ERROR-NR
  COMPRESS 'Natural Error:' *PROGRAM *ERROR-NR  'Error Line:' *ERROR-LINE INTO p_Err_Dscr
  ESCAPE ROUTINE
END-ERROR
*
ESCAPE ROUTINE  /* NO SYNCH WITH STATUS
*
END
