* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*  GOSTPN01 
* 1. Populate Phone and fax in STATUS 
* Prerequisites: Field MEMBER-CONTACT-ID must has correct value
* Usage 
* CALLNAT 'GOSTPN01' p_CN p_Err p_Err_Dscr p_Mod
* Parameters: 
*  p_CN       (N6) 
*  p_Err      (N4)  
*  p_Err_Dscr (A78)   
*  p_Mod      (A1)  
*
* bz created 05/15/2011
DEFINE DATA 
PARAMETER 
1 p_CN       (N6)
1 p_Err      (N4)  
1 p_Err_Dscr (A78) 
1 p_Mod      (A1)  
LOCAL

1 ST-V VIEW OF A-STATUS
   2 ID-NUMBER
   2 MEMBER-CONTACT-ID
*   2 TELE-NUMBER     (P11)              /* vt 10/18/2015 \/
*   2 HOME-TELE-INTR  (A6)
*   2 NXT-OF-KIN-TELE-NUMBER 
*   2 WORK-TELE-INTR         
*   2 FAX-NUMBER            (P17)
*   2 FAX-NUMBER-INTR     2 DTS-DATN     /* vt 10/18/2015 /\               
   2 DTS-TIMN  
   2 dts-datn                            /* vt 10/18/2015                                        
*
  1 PH-V VIEW OF A-CONTACT-PHONE
    2  CONTACT-ID   
    2  PHONE-TYPE-CODE              (A1)                /*   Home/Work/Fax/etc
    2  TYPE                       (A1)                  /*   Domestic / International
    2 INTL-ACCESS-CODE              (N3)                /*   International Access Cd
    2 INTL-DIAL-NUMBER              (N20)  (EM=9(20))   /*   International Dial Numbe
    2 AREA-CODE                     (N3)    (EM=999)    /*   Area Code
    2 REDEFINE AREA-CODE
      3 AREA-CODE_A (A3)
    2 DIAL-NUMBER                   (N7)     (EM=9(7))  /*   Number
    2 REDEFINE DIAL-NUMBER
      3 DIAL-NUMBER_A               (A7)
    2 EXT                           (N6)                /*   Extension
    2 PREFERRED-PHONE-IND           (A1)                /*   Preferred Phone
  1 v_A23  (A23) 
  1  REDEFINE v_A23 
    2 v_N10      (N10)
    2 v_A6       (A6)   
END-DEFINE
*
  ON ERROR 
     p_Err := *ERROR-NR
     COMPRESS 'Natural Error:'  *PROGRAM *ERROR-NR  'Error Line:' *ERROR-LINE INTO p_Err_Dscr
     ESCAPE ROUTINE 
  END-ERROR 
* 
  IF p_CN = 0
     p_Err := 0001  COMPRESS 'CN = 0' INTO p_Err_Dscr  ESCAPE ROUTINE 
  END-IF

  FST.
  FIND (1) ST-V WITH ID-NUMBER = p_CN
*
     IF NO RECORD FOUND
          p_Err := 0002  COMPRESS 'CN:' p_CN 'NOT FOUND' INTO p_Err_Dscr  ESCAPE ROUTINE 
     END-NOREC
*
     IF MEMBER-CONTACT-ID = 0
        p_Err := 0003  COMPRESS 'CN:' p_CN 'MEMBER-CONTACT-ID = 0' INTO p_Err_Dscr  ESCAPE ROUTINE 
     END-IF 
*  
  
        FIND PH-V WITH CONTACT-ID = ST-V.MEMBER-CONTACT-ID
          RESET v_A23
          IF PH-V.TYPE = 'I'
             COMPRESS PH-V.INTL-ACCESS-CODE PH-V.INTL-DIAL-NUMBER INTO  v_A23 LEAVING NO SPACE
           END-IF
           IF TYPE = 'D'
                COMPRESS PH-V.AREA-CODE_A PH-V.DIAL-NUMBER_A INTO  v_A23 LEAVING NO SPACE
           END-IF
*            DECIDE ON FIRST VALUE OF PH-V.PHONE-TYPE-CODE          /* vt 10/18/2015 \/
*              VALUE 'H'    
*                 TELE-NUMBER            := v_N10
*                 HOME-TELE-INTR         := v_A6
*              VALUE 'B'    
*                 NXT-OF-KIN-TELE-NUMBER := v_N10
*                 WORK-TELE-INTR         := v_A6
*              VALUE 'F' 
*                 FAX-NUMBER             := v_N10
*                 FAX-NUMBER-INTR        := v_A6
*             NONE IGNORE   
*           END-DECIDE                                              /* vt 10/18/2015 /\
        END-FIND 
    ST-V.DTS-DATN          := *DATN
    ST-V.DTS-TIMN          := *TIMN
    UPDATE (FST.)
 END-FIND
END
