* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
************************************************************************
* NAME         : GPADCSXX                                              *
* AUTHOR       : Copyright: Electronic Data Systems                    *
* DESCRIPTION  : Check for Members Current EZPay status                *
************************************************************************
*
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
* PAM    03012009  PM1     Remove Verification Stage V/X/Z             *
************************************************************************

*    DOES THE PRE-AUTHORIZED CODE EDIT
*    PAD-CODE           ON ADABAS FILE
*
*     P   = READY FOR PRE-NOTIFICATION
*     N   = READY FOR PRE-NOTIFICATION (non-mbr) --- rmvd 03/2004
*     D   = READY FOR PRE-NOTIFICATION (pol(s) with "D" on owner flag)
*     L   = READY FOR PRE-NOTIFICATION (No pols - used for ELP/EIP)
*     V   = PRE-AUTH VALIDATED
*     W   = PRE-AUTH VALIDATED (non-mbr) --- rmvd 03/2004
*     X   = PRE-AUTH VALIDATION (pol(s) with "D" on owner flag)
*     Z   = PRE-AUTH VALIDATION (No pols - used for ELP/EIP)
*     E   = DEBITS HAVE STARTED
*     R   = PRE-AUTH REJECTED
*     S   = PRE-AUTH STOPPED
*   BLANK = NOT PRE-AUTHORIZED
*
DEFINE DATA PARAMETER
1 #PRE-AUTH-CODE (A1)
1 #INVALID        (L)
1 #ERR-MSG        (A60)
END-DEFINE
*
MOVE TRUE TO #INVALID
MOVE 'PRE-AUTH CODE MUST BE P, D, E, R, S, or L'                     /* PM1
  TO #ERR-MSG
*
IF #PRE-AUTH-CODE = 'P' OR = 'E' OR = 'D' OR = 'R' OR = 'S' OR = 'L' /* PM1 
  MOVE FALSE TO #INVALID
END-IF
*
END
