DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #POLICY-CAP-FIELDS
  2 #ID-NUMBER (N6)
  2 #POL-NUM (A16)
  2 #CAP-INFO (A70/1:20)
END-DEFINE
