DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-GPBATRBI
  2 #GPBATRBI-ID-NUMBER (N6.0)
  2 #GPBATRBI-NEW-IND (A1)
  2 #GPBATRBI-CLERK (A3)
END-DEFINE
