DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-GPBAEZRV
  2 #GPBAEZRV-MEM-CN (N6.0)
  2 #GPBAEZRV-EZPAY-AMOUNT (P5.2)
  2 #GPBAEZRV-ISSUE-DATE (N8.0)
  2 #GPBAEZRV-NAME (A25)
  2 #GPBAEZRV-DATE-OF-UPDATE (N8)
  2 #GPBAEZRV-TIME-OF-UPDATE (N7.0)
  2 #GPBAEZRV-CLERK (A3)
  2 #GPBAEZRV-CASH-CODE (A1)
  2 #GPBAEZRV-CAP-X (I2)
END-DEFINE
