DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #RATE-KEY (A7)
1 #RATE-PLAN (A3)
1 #RATE-SMOKER (A1)
1 #RATE-DATE (N8)
1 #RATE-FACE-AMT (N7.2)
1 #RATE-REFUND (N7.4)
END-DEFINE
