DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #EMAIL-PARMS
  2 #MESSAGE (A80/1:20)
  2 #DATASET (A128)
  2 #SUB-SYSTEM (A20)
  2 #IN-EMAIL-ADD (A500)
  2 #CC-EMAIL-ADD (A500) /*/* vt
  2 #FORMAT (A1)
  2 #SUBJECT (A50)
  2 #RETRUN-ADD (A50)
END-DEFINE
