* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* GPBPSTUB
DEFINE DATA PARAMETER
1 #ID-NUMBER (N6)
1 #PARM-DATE (N8)
END-DEFINE
*
ESCAPE ROUTINE
*
END 
