DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-GPOAACHE (1:500)
  2 #EIL-MEMBER-ID (A6)
  2 #EIL-POLICY-NUMBER (A16)
END-DEFINE
