DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-GPOAACHD (1:500)
  2 #DT-MEMBER-ID (A6)
  2 #DT-TRAN-CODE (A4)
  2 #DT-ORIG-TRAN-CODE (A4)
  2 #DT-ACCOUNT-NUMBER (A4)
  2 #DT-POLICY-NUMBER (A16)
  2 #DT-DEBIT-AMOUNT (P7.2)
  2 #DT-CREDIT-AMOUNT (P7.2)
  2 #DT-REJECTION-CODE (A3)
END-DEFINE
