DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-GPOAACHP (1:500)
  2 #BILL-MEMBER-ID (A6)
  2 #BILL-REJECTION-AMOUNT (P7.2)
  2 #BILL-REJECTION-CODE (A3)
  2 #BILL-CREATE (A1) /*/* PM1
  2 #BILL-STOP (A1) /*/* PM1
  2 #BILL-TRAN-OCC (1:500)
    3 #BILL-TRAN-CODE (A4)
    3 #BILL-ORIG-TRAN (A4)
    3 #BILL-POLICY-NUMBER (A16)
    3 #BILL-DEBIT-AMOUNT (P7.2)
    3 #BILL-CREDIT-AMOUNT (P7.2)
END-DEFINE
