DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-ACHR-TABLE
  2 #ACH-ERROR-CODE (N2.0)
  2 #ACHR-DATE-OCCR (1:12)
    3 #ACHR-DATE (N6.0)
    3 #ACHR-FILE-OCC (1:500)
      4 #ACHR-MEMBER-NUMBER (A6)
      4 #ACHR-REJECTION-CODE (A3)
      4 #ACHR-REJECTION-AMOUNT (N10.2)
      4 #ACHR-CHANGE-DATA (A29)
END-DEFINE
