DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-WORKFILE
  2 #WORK-FILE-NAME (A50)
  2 #WORK-FILE-FOLDER (A100)
  2 #UNIX-FILE-FOLDER (A100)
  2 #WORKFILE-ERROR (L)
END-DEFINE
