DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-SELECT-FILE
  2 #SELECT-FILE-NAME (A50)
  2 #SELECT-FILE-FOLDER (A70)
  2 #SELECT-FILE-NAME-ONLY (A50)
END-DEFINE
