* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*   PGM-ID GPOLNSXX  ** NO LONGER USED (RELACED BY GPLNMSXX)
*    COMES UP WITH THE POLICY NUMBER
*    USED BY 'NM' 'AI' 'VP' 'AV' 'NC'
*
DEFINE DATA PARAMETER
1 #HOLD-OLD-NUMBER (N2)
1 #HOLD-NEW-NUMBER (N2)
1 #POL-NUM         (A16)
1 #CN              (N6)
1 #PLAN            (A2)
1 #ISS-DT          (N8)
1 REDEFINE #ISS-DT
 2 #ISS-YYYY    (N4)
 2 #ISS-MM      (N2)
 2 #ISS-DD      (N2)
*
LOCAL
  USING GPOLNLXX
LOCAL
*
1 #MONTHS (A36) INIT <'JanFebMarAprMayJunJulAugSepOctNovDec'>
1 REDEFINE #MONTHS
 2 #MON (A3/12)
END-DEFINE
*
IF #ISS-DT GE 19941201
  COMPRESS #CN '-' #HOLD-NEW-NUMBER INTO #POL-NUM LEAVING NO
ELSE
  FOR #INDEX 1 TO 10
    IF #HOLD-OLD-NUMBER = #OLD-MEMSHIP(#INDEX)
        AND #HOLD-NEW-NUMBER = #NEW-MEMSHIP(#INDEX)
      MOVE #PRE-LIT(#INDEX) TO #POLICY-PREFIX
      MOVE EDITED #CN (EM=99999)TO #POLICY-CN
      MOVE #SUFF-LIT(#INDEX) TO #POLICY-SUFFIX
    END-IF
  END-FOR
*
  IF #POLICY-SUFF-2A = 'OL'
    MOVE #PLAN TO #POLICY-SUFF-2A
  ELSE
    MOVE #PLAN TO #POLICY-SUFF-2B
  END-IF
*
  MOVE #POLICY-WORK-AREA TO #POL-NUM
END-IF
* DISPLAY #POLICY-PREFIX #POLICY-SUFFIX #POL-NUM
END
