DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 ERROR-LOG
  2 ERROR-PROGRAM (A) DYNAMIC
  2 ERROR-OBJECT (A) DYNAMIC
  2 ERROR-MESSAGE (A) DYNAMIC
  2 ERROR-LINE (A) DYNAMIC
  2 ERROR-NUMBER (A) DYNAMIC
END-DEFINE
