DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #TR-FIELDS
  2 #TR-ID-NUMBER (N6)
  2 #TR-NAME (A) DYNAMIC
  2 #TR-DATE-LAST-UPDATE (N8)
  2 #TR-CLERK-ID (A3)
  2 #LOG-DESCRIPTION (A) DYNAMIC
1 #SYNC-FIELD-TABLE (N3/1:32)
1 #OLD-DATA-TABLE (1:32)
  2 #FIELD-DESCRIPTION (A10)
  2 #OLD-DATA (A115)
1 #NEW-DATA-TABLE (1:32)
  2 #NEW-DATA-TAG (A3)
  2 #NEW-DATA (A122)
END-DEFINE
