* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*   PGM-ID GPREMS96
*    FINDS THE pre-1997 PREM RATE BASED ON PLAN/AGE/ISSUE-YYYY
*************************************************************************
* JNT  10/30/2013  JT1  1M Policy Support                              
*
*************************************************************************
*
DEFINE DATA PARAMETER
** to find rates scan for OL/20-PAY/30-PAY/7-PAY/SNG-PRM
1 #CGA-SCR-COMMAND (A2)
1 #CGA-SCR-ID      (N9)
1 #CGA-SCR-SUFFIX  (A3)
1 #PLAN-PASS       (A3)
1 #AGE             (N2)
1 #APREM           (N7.2)                           /* JT1
1 #ISSUE-DATE      (N8)
1 REDEFINE #ISSUE-DATE
 2 #ISSUE-YYYY (N4)
 2 #ISSUE-MMDD (N4)
1 #SMOK-FLAG       (A1)
1 #FAC-AMT         (N7.2)
1 #PRM-SEL         (I2)
1 #SEX             (A1)
*
LOCAL
*
1 #SCN-TYPE  (A45)
1 #SCN-PREM         (N5.2/81)
1 #SCN-PREM-AFT-10K (N5.2/81)
*
1 #WHOLE-DOLLARS   (N7)
1 #I1      (I2)
1 #INDEX1  (I2)
1 #INDEX2  (I2)
*
1 #PREMIUM-TABLE
 2 #TYPE-OF-PLAN (7)
*  (1)<'OL'>  /* OL (1949 thru 1996)
*  (2)<'20'>  /* 20-pay thru 1996
*  (3)<'30'>  /* 30-pay thru 1996
*  (4)<'OL'>  /* OL 1945 - 1948
*  (5)<'OL'>  /* OL PRE 1945
*  (6)<'7 '>  /* 7-pay started 12/1/94 thru 1996
*  (7)<'SI'>  /* SNG PRM (multiply by 10) thru 1996
  3 #PLAN-PREM (66)   /* AGE 0 THRU 65
   4 #PREM-PLAN (P3.2) INIT
    (1,13)<035.88>
    (1,14)<036.84>
    (1,15)<037.80>
    (1,16)<038.76>
    (1,17)<039.72>
    (1,18)<040.68>
    (1,19)<041.64>
    (1,20)<042.60>
    (1,21)<043.80>
    (1,22)<044.88>
    (1,23)<045.96>
    (1,24)<047.16>
    (1,25)<048.36>
    (1,26)<049.56>
    (1,27)<051.00>
    (1,28)<052.44>
    (1,29)<053.88>
    (1,30)<055.56>
    (1,31)<057.24>
    (1,32)<058.92>
    (1,33)<060.72>
    (1,34)<062.52>
    (1,35)<064.56>
    (1,36)<066.60>
    (1,37)<069.12>
    (1,38)<071.64>
    (1,39)<074.28>
    (1,40)<077.04>
    (1,41)<079.92>
    (1,42)<083.04>
    (1,43)<086.16>
    (1,44)<089.64>
    (1,45)<093.12>
    (1,46)<096.96>
    (1,47)<100.92>
    (1,48)<105.12>
    (1,49)<109.44>
    (1,50)<114.12>
    (1,51)<119.04>
    (1,52)<124.20>
    (1,53)<129.72>
    (1,54)<135.48>
    (1,55)<141.48>
    (1,56)<147.72>
    (1,57)<154.20>
    (1,58)<160.92>
    (1,59)<168.12>
    (1,60)<175.92>
    (1,61)<195.24>
    (1,62)<206.76>
    (1,63)<219.24>
    (1,64)<232.56>
    (1,65)<246.72>
    (1,66)<261.96>
*   20-PAY
    (2,13)<069.00>
    (2,14)<070.20>
    (2,15)<071.40>
    (2,16)<072.60>
    (2,17)<073.80>
    (2,18)<075.00>
    (2,19)<076.20>
    (2,20)<077.40>
    (2,21)<078.48>
    (2,22)<079.68>
    (2,23)<080.76>
    (2,24)<081.96>
    (2,25)<083.04>
    (2,26)<084.36>
    (2,27)<085.80>
    (2,28)<087.36>
    (2,29)<088.92>
    (2,30)<090.48>
    (2,31)<092.28>
    (2,32)<094.08>
    (2,33)<096.00>
    (2,34)<097.92>
    (2,35)<099.96>
    (2,36)<102.12>
    (2,37)<104.40>
    (2,38)<106.68>
    (2,39)<109.08>
    (2,40)<111.60>
    (2,41)<114.36>
    (2,42)<117.12>
    (2,43)<120.00>
    (2,44)<123.00>
    (2,45)<126.24>
    (2,46)<129.48>
    (2,47)<132.96>
    (2,48)<136.56>
    (2,49)<140.40>
    (2,50)<144.36>
    (2,51)<148.68>
    (2,52)<153.72>
    (2,53)<159.12>
    (2,54)<164.88>
    (2,55)<171.00>
    (2,56)<177.48>
    (2,57)<184.44>
    (2,58)<191.76>
    (2,59)<199.44>
    (2,60)<207.72>
    (2,61)<222.96>
    (2,62)<233.52>
    (2,63)<244.80>
    (2,64)<256.80>
    (2,65)<269.88>
    (2,66)<283.80>
*    30-PAY
    (3,13)<053.52>
    (3,14)<054.36>
    (3,15)<055.20>
    (3,16)<056.04>
    (3,17)<056.88>
    (3,18)<057.72>
    (3,19)<058.56>
    (3,20)<059.40>
    (3,21)<060.24>
    (3,22)<061.08>
    (3,23)<061.92>
    (3,24)<062.76>
    (3,25)<063.60>
    (3,26)<064.56>
    (3,27)<065.76>
    (3,28)<066.84>
    (3,29)<068.16>
    (3,30)<069.48>
    (3,31)<070.92>
    (3,32)<072.36>
    (3,33)<073.92>
    (3,34)<075.60>
    (3,35)<077.28>
    (3,36)<079.20>
    (3,37)<081.12>
    (3,38)<083.16>
    (3,39)<085.44>
    (3,40)<087.72>
    (3,41)<090.24>
    (3,42)<092.88>
    (3,43)<095.52>
    (3,44)<098.52>
    (3,45)<101.64>
    (3,46)<104.88>
    (3,47)<108.48>
    (3,48)<112.08>
    (3,49)<116.04>
    (3,50)<120.24>
    (3,51)<124.80>
    (3,52)<129.72>
    (3,53)<134.88>
    (3,54)<140.28>
    (3,55)<146.04>
    (3,56)<152.16>
    (3,57)<158.52>
    (3,58)<165.36>
    (3,59)<172.44>
    (3,60)<180.00>
    (3,61)<198.72>
    (3,62)<210.12>
    (3,63)<222.36>
    (3,64)<235.56>
    (3,65)<249.60>
    (3,66)<264.72>
**    OL 1945 - 1948
    (4,18)<041.52>
    (4,19)<042.36>
    (4,20)<043.20>
    (4,21)<044.16>
    (4,22)<045.12>
    (4,23)<046.08>
    (4,24)<047.16>
    (4,25)<048.24>
    (4,26)<049.32>
    (4,27)<050.52>
    (4,28)<051.84>
    (4,29)<053.16>
    (4,30)<054.60>
    (4,31)<056.04>
    (4,32)<057.60>
    (4,33)<059.16>
    (4,34)<060.84>
    (4,35)<062.64>
    (4,36)<064.56>
    (4,37)<066.60>
    (4,38)<068.64>
    (4,39)<070.92>
    (4,40)<073.32>
    (4,41)<075.84>
    (4,42)<078.48>
    (4,43)<081.24>
    (4,44)<084.24>
    (4,45)<087.48>
    (4,46)<090.84>
    (4,47)<094.44>
    (4,48)<098.28>
    (4,49)<102.36>
    (4,50)<106.68>
    (4,51)<111.36>
*    OL PRE 1945
    (5,18)<036.48>
    (5,19)<037.20>
    (5,20)<038.04>
    (5,21)<038.88>
    (5,22)<039.72>
    (5,23)<040.56>
    (5,24)<041.52>
    (5,25)<042.48>
    (5,26)<043.56>
    (5,27)<044.64>
    (5,28)<045.84>
    (5,29)<047.04>
    (5,30)<048.36>
    (5,31)<049.68>
    (5,32)<051.12>
    (5,33)<052.68>
    (5,34)<054.24>
    (5,35)<055.92>
    (5,36)<057.72>
    (5,37)<059.64>
    (5,38)<061.68>
    (5,39)<063.72>
    (5,40)<066.12>
    (5,41)<068.40>
    (5,42)<071.04>
    (5,43)<073.80>
    (5,44)<076.68>
    (5,45)<079.80>
    (5,46)<083.04>
    (5,47)<086.52>
    (5,48)<090.36>
    (5,49)<094.32>
    (5,50)<098.64>
    (5,51)<103.20>
*   7-PAY
    (6,13)<066.00>
    (6,14)<069.60>
    (6,15)<072.00>
    (6,16)<074.40>
    (6,17)<078.00>
    (6,18)<080.40>
    (6,19)<082.80>
    (6,20)<085.20>
    (6,21)<088.80>
    (6,22)<091.20>
    (6,23)<094.80>
    (6,24)<098.40>
    (6,25)<102.00>
    (6,26)<105.60>
    (6,27)<109.20>
    (6,28)<114.00>
    (6,29)<117.60>
    (6,30)<122.40>
    (6,31)<127.20>
    (6,32)<133.20>
    (6,33)<138.00>
    (6,34)<144.00>
    (6,35)<150.00>
    (6,36)<156.00>
    (6,37)<162.00>
    (6,38)<169.20>
    (6,39)<176.40>
    (6,40)<183.60>
    (6,41)<190.80>
    (6,42)<198.00>
    (6,43)<206.40>
    (6,44)<214.80>
    (6,45)<223.20>
    (6,46)<231.60>
    (6,47)<241.20>
    (6,48)<249.60>
    (6,49)<260.40>
    (6,50)<270.00>
    (6,51)<280.80>
    (6,52)<291.60>
    (6,53)<302.40>
    (6,54)<313.20>
    (6,55)<325.20>
    (6,56)<337.20>
    (6,57)<350.40>
    (6,58)<362.40>
    (6,59)<375.60>
    (6,60)<390.00>
    (6,61)<404.40>
    (6,62)<418.80>
    (6,63)<433.20>
    (6,64)<450.00>
    (6,65)<465.60>
    (6,66)<482.40>
*   SNG-PRM  (must be multiplied by 10)
    (7,15)<094.10>
    (7,16)<097.94>
    (7,17)<101.49>
    (7,18)<105.15>
    (7,19)<108.93>
    (7,20)<112.83>
    (7,21)<116.89>
    (7,22)<121.12>
    (7,23)<125.53>
    (7,24)<130.14>
    (7,25)<134.97>
    (7,26)<140.03>
    (7,27)<145.33>
    (7,28)<150.89>
    (7,29)<156.70>
    (7,30)<162.79>
    (7,31)<169.15>
    (7,32)<175.80>
    (7,33)<182.74>
    (7,34)<190.00>
    (7,35)<197.58>
    (7,36)<205.50>
    (7,37)<213.74>
    (7,38)<222.30>
    (7,39)<231.21>
    (7,40)<240.40>
    (7,41)<249.90>
    (7,42)<259.69>
    (7,43)<269.78>
    (7,44)<280.16>
    (7,45)<290.85>
    (7,46)<301.83>
    (7,47)<313.12>
    (7,48)<324.69>
    (7,49)<336.55>
    (7,50)<348.68>
    (7,51)<361.07>
    (7,52)<373.71>
    (7,53)<386.58>
    (7,54)<399.68>
    (7,55)<413.01>
    (7,56)<426.54>
    (7,57)<440.27>
    (7,58)<454.17>
    (7,59)<468.24>
    (7,60)<482.43>
    (7,61)<496.74>
    (7,62)<511.13>
    (7,63)<525.58>
    (7,64)<540.08>
    (7,65)<554.59>
    (7,66)<569.09>
END-DEFINE
* * * * * * * * * * * * * * * * *
*
IF #CGA-SCR-SUFFIX = 'PRM'
  PERFORM DISPLAY-PREMS
END-IF
*
IF #PLAN-PASS = 'OL' OR = 'SP'
  IF #ISSUE-YYYY GE 1949
    MOVE 1 TO #INDEX1
  ELSE
    IF #ISSUE-YYYY LT 1945     /* ISSUED PRIOR TO 1945
      MOVE 5 TO #INDEX1
    ELSE
      MOVE 4 TO #INDEX1        /* ISSUED 1945 - 1949
    END-IF
  END-IF
ELSE
  IF #PLAN-PASS = '20' OR = '20P'
    MOVE 2 TO #INDEX1
  ELSE
    IF #PLAN-PASS = '30' OR = '30P'
      MOVE 3 TO #INDEX1
    ELSE
      IF #PLAN-PASS = '7P'
        MOVE 6 TO #INDEX1    /* 7-pay
      ELSE
        MOVE 7 TO #INDEX1    /* single pay (#plan-pass = "SI")
      END-IF
    END-IF
  END-IF
END-IF
*
COMPUTE #INDEX2 = #AGE + 1 /* since 1st entry is for age 0
*
IF #INDEX1 = 7                /*sng-prms are for $10k & must be * 10
  COMPUTE ROUNDED #WHOLE-DOLLARS = (#PREM-PLAN(#INDEX1, #INDEX2) * 10)
  COMPUTE ROUNDED #WHOLE-DOLLARS = #WHOLE-DOLLARS * (#FAC-AMT / 10000)
  MOVE #WHOLE-DOLLARS TO #APREM
ELSE
  COMPUTE #APREM = #PREM-PLAN (#INDEX1, #INDEX2) * (#FAC-AMT / 5000)
END-IF
*
* * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE DISPLAY-PREMS
* * * * * * * * * * * * * * * * *
*
MOVE '*' TO #CGA-SCR-COMMAND
*
REPEAT UNTIL #PRM-SEL GT 13
  DECIDE ON FIRST VALUE #PRM-SEL
    VALUE 1  IGNORE
    VALUE 2  IGNORE
    VALUE 3  IGNORE
    VALUE 4  IGNORE
    VALUE 5  IGNORE
    VALUE 6  IGNORE
    VALUE 7  MOVE  7 TO #INDEX1
             MOVE '1996 SNG-PREMIUMS per $10k'    TO #SCN-TYPE
    VALUE 8  MOVE  6 TO #INDEX1
             MOVE '1996 7-PAY mnthly prems per $5k'   TO #SCN-TYPE
    VALUE 9  MOVE  2 TO #INDEX1
             MOVE '1996 20-PAY mnthly prems per $5k'  TO #SCN-TYPE
    VALUE 10 MOVE  3 TO #INDEX1
             MOVE '1996 30-PAY mnthly prems per $5k'  TO #SCN-TYPE
    VALUE 11 MOVE  1 TO #INDEX1
             MOVE '1996 OL mnthly prems per $5k'      TO #SCN-TYPE
    VALUE 12 MOVE  4 TO #INDEX1
             MOVE 'PRE-1948 OL mnthly prems per $5k'  TO #SCN-TYPE
    VALUE 13 MOVE  5 TO #INDEX1
             MOVE 'PRE-1945 OL mnthly prems per $5k'  TO #SCN-TYPE
    NONE IGNORE
  END-DECIDE
*
  MOVE #PREM-PLAN (#INDEX1, 1:66) TO #SCN-PREM (1:66)
  RESET #SCN-PREM-AFT-10K (*)
*
  IF #INDEX1 = 7                  /* all sng prems are entered as dimes
     MULTIPLY #SCN-PREM (*) BY 10
  ELSE
     DIVIDE 12 INTO #SCN-PREM (*)
  END-IF
*
  INPUT USING MAP 'GPREMM02'
*
  IF #CGA-SCR-COMMAND NE '*'
    FETCH 'G1000PXX'
  END-IF
*
  ADD 1 TO #PRM-SEL
END-REPEAT
*
MOVE 'GM' TO #CGA-SCR-COMMAND
FETCH 'G1000PXX'
*
END-SUBROUTINE
*
END
