DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode R
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 p_EMAIL
  2 P_TO (A) DYNAMIC /*address "To"
  2 P_CC (A) DYNAMIC /*address "Cc"
  2 P_SUBJ (A) DYNAMIC /*subject line
  2 P_MSG (A150/1:30) /*body 20 lines message
  2 p_rc (N3)
END-DEFINE
