* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
***************************************************************
* SUBPROGRAM-ID: GPRN0005 - Log errors for address verification
* process to send email with error log to the user
***************************************************************
*        MODIFICATION LOG
***************************************************************
* USER   DATE      TAG  REASON
* YAK    03112010       Initial Creation
***************************************************************
*
DEFINE DATA PARAMETER
1 #PROCESS-TYPE   (A) DYNAMIC
1 #LOG-MESSAGE    (A) DYNAMIC
*
LOCAL
1 #ADDRESS-VALIDATION (A) DYNAMIC INIT <'AddressValidation'>
1 #AUTODIALER-PROCESS (A) DYNAMIC INIT <'AutoDialer'>
1 #EMAIL-PROCESS      (A) DYNAMIC INIT <'Email'>
1 #EXCEPTION-LOG      (A200)
1 #ADDRESS-VALIDATION-EXCEPTIONS (A) DYNAMIC INIT
  <'/usr/SAG/cronus/emails/AddressValidationExceptions.txt'>
1 #AUTODIALER-PROCESS-EXCEPTIONS (A) DYNAMIC INIT
  <'/usr/SAG/cronus/emails/AutodialerExceptions.txt'>
1 #EMAIL-PROCESS-EXCEPTIONS (A) DYNAMIC INIT
  <'/usr/SAG/cronus/emails/EmailExceptions.txt'>
END-DEFINE
*
DEFINE WORK FILE 23 #ADDRESS-VALIDATION-EXCEPTIONS TYPE 'ASCII-COMPRESSED' ATTRIBUTES 'APPEND'
*
#EXCEPTION-LOG := #LOG-MESSAGE
DECIDE ON FIRST VALUE #PROCESS-TYPE
  VALUE #ADDRESS-VALIDATION
     WRITE WORK FILE 23 #EXCEPTION-LOG
     RESET #EXCEPTION-LOG
     WRITE WORK FILE 23 #EXCEPTION-LOG
     CLOSE WORK FILE 23
  VALUE 'D'
     WRITE WORK FILE 24 #EXCEPTION-LOG
     CLOSE WORK FILE 24
  VALUE 'E'
     WRITE WORK FILE 25 #EXCEPTION-LOG
     CLOSE WORK FILE 25
  NONE VALUE
     IGNORE
END-DECIDE
*
END
