DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 FA-RANGE (N6/1:7)
  INIT
  <10000,12500,25000,37500,50000,75000,100000>
1 AGE-RANGE (N2/7,2)
  INIT
  (1,V)<45,49>
  (2,V)<50,54>
  (3,V)<55,59>
  (4,V)<60,64>
  (5,V)<65,69>
  (6,V)<70,74>
  (7,V)<75,79>
1 FACE-OFFERED (N7/1:5) INIT
  (1) <10000>
  (2) <25000>
  (3) <50000>
  (4) <75000>
  (5) <100000>
END-DEFINE
