* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* SUBPROGRAM-ID: GUPCISXX
* DESCRIPTION: PF4 FUNCTION - View/Update/Add/Delete Contact file
********************************************************
*        MODIFICATION LOG
********************************************************
* USER   DATE      TAG  REASON
* LR  03-19-2010   LR1  Correct date format from (YYYYMMDD) to  (MMDDYYYY)
********************************************************
DEFINE DATA
PARAMETER
1 #DELETE           (L)
1 #UPDATE           (L)
1 #CGA-CLERK        (A3)
1 #CGA-ORIG-ID      (N6)    /* Parent/Member ID
1 #CO-ID-1          (N8)    /* Parent/Member Contact ID
1 #MSG              (A72)
1 #UI
  2 #STATUS-ISN         (P8)
  2 #CONTACT-ISN        (P8)
  2 #FIRS-ISN           (P8)
  2 #FIRST-NAME         (A25)
  2 #MIDDLE-NAME        (A25)
  2 #LAST-NAME          (A25)
  2 #SUFFIX             (A10)
  2 #SSN                (N9)
  2 #GENDER-CD          (A1)
  2 #BIRTH-CERT-CODE    (A1)
  2 #MARRIAGE-CERT-CODE (A1)
  2 #ORGANIZATION       (A50)
  2 #CN                 (N6)
  2 #CID                (N8)
  2 #DOB                (A8)
  2 #DOD                (A8)
  2 #DOM                (A8)
  2 #DIV                (A8)
  2 #SCR-ROLE-2-CD      (A1)
  2 #ORIG-ROLE-2-CD     (A1)
  2 #ROLE-DESC          (A15)
  2 #LST-UPD            (A10)
  2 #LST-USR            (A20)
  2 #RL-TEXT            (A18)
  2 #CN-TEXT            (A3)
  2 #DOM-TEXT           (A18)
  2 #DOM-CD-TEXT        (A5)
  2 #DIV-TEXT           (A18)
  2 #DT-FORMAT-TEXT     (A10)
  2 #ORG-DISPLAYED      (L)
  2 #DEFAULT-LN         (A25)
LOCAL
1 FIRS VIEW OF A-FIRS
  2 ID-NUMBER
  2 CONTACT-ID-NUMBER
  2 DEPENDENT-TABLE  (60)
    3 DEPN-CONTACT-ID
    3 DEPN-NAME
    3 DEPN-BIRTH-CD
    3 DEPN-STATUS-CD
    3 DEPN-DATE-OF-BIRTH
    3 DEPN-SSN
    3 DEPN-REMARKS
  2 DEPN-COLL-FUND-TBL (60)
    3 DEPN-COLL-FUND (P7)
  2 DEPN-COLL-TYPE-TBL (60)
    3 DEPN-COLL-TYPE (A1)
  2 DEPN-COLL-INFO-TBL (60)
    3 DEPN-COLL-FROM-YYYY (N4)
    3 DEPN-COLL-THRU-YYYY (N4)
    3 DEPN-COLL-ANN-COST (P6)
  2 DP-LAST-FM-DATE (N8.0)
  2 DTS-DATN (P9.0)
  2 DTS-TIMN (P7.0)

1 CNT VIEW OF A-CONTACTS
  2 CONTACT-ID       (N8)           /* D
  2 ID-NUMBER        (N6)           /* D
  2 FIRST-NAME       (A25)
  2 MIDDLE-NAME      (A25)
  2 LAST-NAME        (A25)
  2 SUFFIX           (A10)
  2 GENDER-CD        (A1)         /* --NA
  2 DATE-OF-BIRTH    (N8)
  2 SSN              (N9)           /* D
  2 DATE-OF-DEATH    (N8)
  2 BIRTH-CERT-CODE  (A1)
  2 FIRM-ORGANIZATION-NAME (A75)
  2 REDEFINE FIRM-ORGANIZATION-NAME
    3 #FIRM1         (A37)
    3 #FIRM2         (A37)
  2 CONTACT-REMARKS  (A75/100)    /* MU-FIELD
  2 LAST-USER-UPD    (A8)
  2 LAST-DATE-UPD    (N8)

1 CNT-S VIEW OF A-CONTACTS
  2 CONTACT-ID       (N8)           /* D
  2 ID-NUMBER        (N6)           /* D
  2 FIRST-NAME       (A25)
  2 MIDDLE-NAME      (A25)
  2 LAST-NAME        (A25)
  2 SUFFIX           (A10)
  2 GENDER-CD        (A1)         /* --NA
  2 DATE-OF-BIRTH    (N8)
  2 SSN              (N9)           /* D
  2 DATE-OF-DEATH    (N8)
  2 BIRTH-CERT-CODE  (A1)
  2 DELETE-FLAG      (A1)
  2 FIRM-ORGANIZATION-NAME (A75)
  2 REDEFINE FIRM-ORGANIZATION-NAME
    3 #FIRM1         (A37)
    3 #FIRM2         (A37)
  2 CONTACT-REMARKS  (A75/100)    /* MU-FIELD
  2 LAST-USER-UPD    (A8)
  2 LAST-DATE-UPD    (N8)
  2 LAST-TIME-UPD    (N7)

1 CNT-U VIEW OF A-CONTACTS
  2 CONTACT-ID       (N8)           /* D
  2 ID-NUMBER        (N6)           /* D
  2 FIRST-NAME       (A25)
  2 MIDDLE-NAME      (A25)
  2 LAST-NAME        (A25)
  2 SUFFIX           (A10)
  2 GENDER-CD        (A1)         /* --NA
  2 DATE-OF-BIRTH    (N8)
  2 SSN              (N9)           /* D
  2 DATE-OF-DEATH    (N8)
  2 BIRTH-CERT-CODE  (A1)
  2 DELETE-FLAG      (A1)
  2 FIRM-ORGANIZATION-NAME (A75)
  2 REDEFINE FIRM-ORGANIZATION-NAME
    3 #FIRM1         (A37)
    3 #FIRM2         (A37)
  2 CONTACT-REMARKS  (A75/100)    /* MU-FIELD
  2 REDEFINE CONTACT-REMARKS
    3 #CONTACT-REMARKS (100)
      4 #OLD-DESC      (A20)
      4 #OLD-VALUE     (A50)
      4 #FILLER        (A5)
  2 LAST-USER-UPD    (A8)
  2 LAST-DATE-UPD    (N8)
  2 LAST-TIME-UPD    (N7)

1 CNT-REL-S VIEW OF A-CONTACT-RELATIONSHIPS
  2 CONTACT-1-ID     (N8)           /* D
  2 ROLE-1-CD        (A1)
  2 CONTACT-2-ID     (N8)           /* D
  2 ROLE-2-CD        (A1)
  2 ACCESS-AUTH-SVC  (A1)
  2 ACCESS-AUTH-INS  (A1)
  2 LAST-USER-UPD    (A8)
  2 LAST-DATE-UPD    (N8)
  2 LAST-TIME-UPD    (N7)
1 CNT-REL-U VIEW OF A-CONTACT-RELATIONSHIPS
  2 CONTACT-1-ID     (N8)           /* D
  2 ROLE-1-CD        (A1)
  2 CONTACT-2-ID     (N8)           /* D
  2 ROLE-2-CD        (A1)
  2 ACCESS-AUTH-SVC  (A1)
  2 ACCESS-AUTH-INS  (A1)
  2 LAST-USER-UPD    (A8)
  2 LAST-DATE-UPD    (N8)
  2 LAST-TIME-UPD    (N7)

1 STATUS VIEW OF A-STATUS
  2 ID-NUMBER
  2 NAME
*   2 SEX                             /* TT1
  2 SSN
  2 PROCESS-IND
*   2 DATE-OF-BIRTH                   /* TT1
  2 DATE-OF-MARRIAGE
  2 DATE-OF-DIVORCE
  2 DATE-OF-DEATH
  2 BIRTH-CERT-CODE
  2 MARRIAGE-CERT-CODE
  2 ACCESS-AUTH-CODE
  2 SPOUSE-CONTACT-ID
  2 NAME-SP
  2 SSN-SP
*   2 SEX-SP                          /* TT1
*   2 DATE-OF-BIRTH-SP                /* TT1
  2 STATUS-CODE-SP
  2 FORMER-SPOUSE-CONTACT-ID
  2 FORMER-SPOUSE-NAME
  2 FORMER-SPOUSE-SSN
*   2 FORMER-SPOUSE-DT-OF-BIRTH       /* TT1
  2 FORMER-SPOUSE-DATE-OF-MARRIAGE
  2 FORMER-SPOUSE-DATE-OF-DIVORCE
  2 FORMER-SPOUSE-STATUS
  2 FORMER-HUSBAND-CONTACT-ID
  2 FORMER-HUSBAND-NAME
  2 FORMER-HUSBAND-SSN
  2 FS-BIRTH-CERT-CD
  2 FS-MARR-CERT-CD
  2 BIRTH-CERT-CODE-SP
  2 TITLE-SP
  2 MAILING-FLAG-SP
  2 LAST-FM-DATE
  2 DTS-DATN
  2 DTS-TIMN

1 CNT-REL VIEW OF A-CONTACT-RELATIONSHIPS
  2 CONTACT-1-ID     (N8)           /* D
  2 ROLE-1-CD        (A1)
  2 CONTACT-2-ID     (N8)           /* D
  2 ROLE-2-CD        (A1)
  2 ACCESS-AUTH-SVC  (A1)
  2 ACCESS-AUTH-INS  (A1)

1 #YYYYMMDD          (A8) 1 REDEFINE #YYYYMMDD
  2 #YYYYMMDD-N (N8)
1 #I                 (I4)
1 #HOLD-TIME         (P7)
1 #DOB-2             (N8)
1 #DOM-2             (N8)
1 #DIV-2             (N8)
1 #DOD-2             (N8)
1 #CONFIRM-DELETE    (A1)
1 #DONT-DELETE       (L)
1 #MEMBER-NAME       (A35)
1 #DEL-NAME          (A39)
1 #DEL-SSN           (N9)
1 #ITR1              (I2)
1 #ITR2              (I2)
1 P_PARMS
  2 P_ERROR_NUM           (I4)
  2 P_ERROR_LINE          (I4)
  2 P_ERROR_PROGRAM       (A32)
  2 P_ERROR_LIB           (A32)
  2 P_ERROR_DBID          (I4)
  2 P_ERROR_FNR           (I4)
  2 P_ERROR_TIME          (T)
  2 P_ERROR_PGM_TYPE      (A1)
  2 P_ERROR_PGM_TYPE_LONG (A11)
  2 P_ERROR_LANG          (I4)
  2 P_ERROR_LEVEL         (I4)
  2 P_ERROR_CLASS         (I1)
  2 P_ERROR_TYPE          (I1)
*
1 #ERROR-TIME             (A19)
END-DEFINE

DEFINE WINDOW Confirm-Delete
  SIZE 10 * 60
  BASE TOP LEFT
  FRAMED ON POSITION SYMBOL AUTO

RESET #UPDATE
IF #DELETE
  GET CNT #CONTACT-ISN
  FIND CNT-REL WITH CONTACT-2-ID = #CID    /* SPOUSE/DEPENDENT/OTHER
    IF CONTACT-1-ID = #CO-ID-1
      MOVE ROLE-2-CD TO #ORIG-ROLE-2-CD
      ESCAPE BOTTOM
    END-IF
  END-FIND
  PERFORM DELETE-RECORD
  ESCAPE ROUTINE
END-IF

IF #CID = 0            /* Add Contact
  MOVE #FIRST-NAME      TO CNT-S.FIRST-NAME
  MOVE #MIDDLE-NAME     TO CNT-S.MIDDLE-NAME
  MOVE #LAST-NAME       TO CNT-S.LAST-NAME
  MOVE #SUFFIX          TO CNT-S.SUFFIX
  MOVE #GENDER-CD       TO CNT-S.GENDER-CD
  COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
    INTO #YYYYMMDD LEAVING NO
  MOVE #YYYYMMDD-N      TO CNT-S.DATE-OF-BIRTH
  MOVE #SSN             TO CNT-S.SSN           /* D
  COMPRESS SUBSTR(#DOD,5,4) SUBSTR(#DOD,1,2) SUBSTR(#DOD,3,2)
    INTO #YYYYMMDD LEAVING NO
  MOVE #YYYYMMDD-N      TO CNT-S.DATE-OF-DEATH
  MOVE #BIRTH-CERT-CODE TO CNT-S.BIRTH-CERT-CODE
  MOVE #ORGANIZATION       TO CNT-S.FIRM-ORGANIZATION-NAME
  MOVE 'NEW'               TO CNT-S.CONTACT-REMARKS(1)
  READ (1) CNT-U DESCENDING BY CONTACT-ID
    ADD 1 TO CONTACT-ID
  END-READ
  MOVE CNT-U.CONTACT-ID    TO CNT-S.CONTACT-ID
  MOVE 'N'                 TO CNT-S.DELETE-FLAG
  MOVE #CGA-CLERK          TO CNT-S.LAST-USER-UPD
  MOVE *DATN               TO CNT-S.LAST-DATE-UPD
  MOVE *TIMN               TO CNT-S.LAST-TIME-UPD
  STORE CNT-S
*
  FIND (1) CNT-REL-S WITH CONTACT-1-ID = #CID
    IF NO RECORD FOUND
      MOVE #CID TO CONTACT-1-ID
    END-NOREC
  END-FIND
  MOVE CNT-U.CONTACT-ID TO CNT-REL-S.CONTACT-2-ID
  IF #SCR-ROLE-2-CD = 'S' OR = 'X'
    MOVE #SCR-ROLE-2-CD TO CNT-REL-S.ROLE-1-CD
  ELSE
    IF #SCR-ROLE-2-CD = 'K' OR = 'G' OR = 'D'
      MOVE 'P' TO CNT-REL-S.ROLE-1-CD
    ELSE
      MOVE 'M' TO CNT-REL-S.ROLE-1-CD
    END-IF
  END-IF
  MOVE #SCR-ROLE-2-CD      TO CNT-REL-S.ROLE-2-CD
  MOVE #CGA-CLERK          TO CNT-REL-S.LAST-USER-UPD
  MOVE *DATN               TO CNT-REL-S.LAST-DATE-UPD
  MOVE *TIMN               TO CNT-REL-S.LAST-TIME-UPD
  STORE CNT-REL-S
*
  IF #SCR-ROLE-2-CD = 'K' OR = 'G' OR = 'D'
    FIND FIRS WITH ID-NUMBER = #CGA-ORIG-ID
      FOR #I 1 60
        IF DEPN-NAME(#I) = ' '
          MOVE CNT-U.CONTACT-ID      TO DEPN-CONTACT-ID(#I)
          COMPRESS #FIRST-NAME #MIDDLE-NAME INTO DEPN-NAME(#I)
          IF #SUFFIX NE ' '
            COMPRESS DEPN-NAME(#I) ',' INTO DEPN-NAME(#I) LEAVING NO
            COMPRESS DEPN-NAME(#I) #SUFFIX INTO DEPN-NAME(#I)
          END-IF
          COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
            INTO #YYYYMMDD LEAVING NO
          MOVE #YYYYMMDD-N      TO DEPN-DATE-OF-BIRTH(#I)
          MOVE #SSN             TO DEPN-SSN(#I)
          MOVE #BIRTH-CERT-CODE TO DEPN-BIRTH-CD(#I)
          ESCAPE BOTTOM
        END-IF
      END-FOR
      MOVE *DATN      TO FIRS.DP-LAST-FM-DATE
      MOVE *DATN      TO FIRS.DTS-DATN
      MOVE *TIMN      TO FIRS.DTS-TIMN
      UPDATE
    END-FIND
  ELSE
    IF #SCR-ROLE-2-CD = 'S' OR = 'X'
      FIND STATUS WITH ID-NUMBER = #CGA-ORIG-ID
        IF #SCR-ROLE-2-CD = 'S'
          MOVE CNT-REL-S.CONTACT-2-ID TO SPOUSE-CONTACT-ID
          MOVE 'S'                 TO STATUS-CODE-SP
          COMPRESS #LAST-NAME ',' INTO NAME-SP LEAVING NO
          COMPRESS NAME-SP #FIRST-NAME INTO NAME-SP
          COMPRESS NAME-SP #MIDDLE-NAME INTO NAME-SP
          IF #SUFFIX NE ' '
            COMPRESS NAME-SP ',' INTO NAME-SP LEAVING NO
            COMPRESS NAME-SP #SUFFIX INTO NAME-SP
          END-IF
*           MOVE #GENDER-CD       TO SEX-SP                                     /* TT1
          COMPRESS SUBSTR(#DOM,5,4) SUBSTR(#DOM,1,2) SUBSTR(#DOM,3,2)
            INTO #YYYYMMDD LEAVING NO
          MOVE #YYYYMMDD-N      TO DATE-OF-MARRIAGE

*           COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)         /* TT1
*             INTO #YYYYMMDD LEAVING NO                                         /* TT1
*           MOVE #YYYYMMDD-N      TO DATE-OF-BIRTH-SP                           /* TT1

          COMPRESS SUBSTR(#DIV,5,4) SUBSTR(#DIV,1,2) SUBSTR(#DIV,3,2)
            INTO #YYYYMMDD LEAVING NO
          MOVE #YYYYMMDD-N      TO DATE-OF-DIVORCE

          MOVE #SSN             TO SSN-SP
          MOVE #BIRTH-CERT-CODE TO BIRTH-CERT-CODE-SP
        ELSE
          MOVE CNT-REL-S.CONTACT-2-ID TO FORMER-SPOUSE-CONTACT-ID
          MOVE 'F'                 TO FORMER-SPOUSE-STATUS
          COMPRESS #LAST-NAME ',' INTO FORMER-SPOUSE-NAME LEAVING NO
          COMPRESS FORMER-SPOUSE-NAME #FIRST-NAME INTO FORMER-SPOUSE-NAME
          COMPRESS FORMER-SPOUSE-NAME #MIDDLE-NAME INTO FORMER-SPOUSE-NAME
          IF #SUFFIX NE ' '
            COMPRESS FORMER-SPOUSE-NAME ',' INTO FORMER-SPOUSE-NAME LEAVING NO
            COMPRESS FORMER-SPOUSE-NAME #SUFFIX INTO FORMER-SPOUSE-NAME
          END-IF
          COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
            INTO #YYYYMMDD LEAVING NO
*           MOVE #YYYYMMDD-N      TO FORMER-SPOUSE-DT-OF-BIRTH                  /* TT1

          COMPRESS SUBSTR(#DOM,5,4) SUBSTR(#DOM,1,2) SUBSTR(#DOM,3,2)
            INTO #YYYYMMDD LEAVING NO
          MOVE #YYYYMMDD-N      TO FORMER-SPOUSE-DATE-OF-MARRIAGE

          COMPRESS SUBSTR(#DIV,5,4) SUBSTR(#DIV,1,2) SUBSTR(#DIV,3,2)
            INTO #YYYYMMDD LEAVING NO
          MOVE #YYYYMMDD-N      TO FORMER-SPOUSE-DATE-OF-DIVORCE

          MOVE #SSN             TO FORMER-SPOUSE-SSN
        END-IF
        MOVE *DATN      TO LAST-FM-DATE
        MOVE *DATN      TO DTS-DATN
        MOVE *TIMN      TO DTS-TIMN
        UPDATE
      END-FIND
    END-IF
  END-IF
  MOVE 'Record successfully added.' TO #MSG
ELSE                                                    /* Update Contact
  RESET #I
  GET CNT #CONTACT-ISN
  FIND CNT-REL WITH CONTACT-2-ID = #CID    /* SPOUSE/DEPENDENT/OTHER
    IF CONTACT-1-ID = #CO-ID-1
      MOVE ROLE-2-CD TO #ORIG-ROLE-2-CD
      ESCAPE BOTTOM
    END-IF
  END-FIND
  FIND CNT-U WITH CONTACT-ID = #CID
    IF #FIRST-NAME  NE CNT.FIRST-NAME
      ADD 1 TO #I
      MOVE 'OLD FIRST-NAME' TO #OLD-DESC(#I)
      MOVE CNT.FIRST-NAME   TO #OLD-VALUE(#I)
    END-IF
    IF CNT.MIDDLE-NAME  NE #MIDDLE-NAME
      ADD 1 TO #I
      MOVE 'OLD MIDDLE-NAME' TO #OLD-DESC(#I)
      MOVE CNT.MIDDLE-NAME   TO #OLD-VALUE(#I)
    END-IF
    IF CNT.LAST-NAME  NE #LAST-NAME
      ADD 1 TO #I
      MOVE 'OLD LAST-NAME' TO #OLD-DESC(#I)
      MOVE CNT.LAST-NAME   TO #OLD-VALUE(#I)
    END-IF
    IF CNT.SUFFIX  NE #SUFFIX
      ADD 1 TO #I
      MOVE 'OLD SUFFIX' TO #OLD-DESC(#I)
      MOVE CNT.SUFFIX   TO #OLD-VALUE(#I)
    END-IF
    MOVE #FIRST-NAME      TO CNT-U.FIRST-NAME
    MOVE #MIDDLE-NAME     TO CNT-U.MIDDLE-NAME
    MOVE #LAST-NAME       TO CNT-U.LAST-NAME
    MOVE #SUFFIX          TO CNT-U.SUFFIX
    MOVE #GENDER-CD       TO CNT-U.GENDER-CD
    MOVE #SSN             TO CNT-U.SSN
    MOVE #BIRTH-CERT-CODE TO CNT-U.BIRTH-CERT-CODE
    MOVE #CGA-CLERK       TO CNT-U.LAST-USER-UPD

    COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
      INTO #YYYYMMDD LEAVING NO
    MOVE #YYYYMMDD-N      TO CNT-U.DATE-OF-BIRTH

    COMPRESS SUBSTR(#DOD,5,4) SUBSTR(#DOD,1,2) SUBSTR(#DOD,3,2)
      INTO #YYYYMMDD LEAVING NO
    MOVE #YYYYMMDD-N      TO CNT-U.DATE-OF-DEATH

    MOVE *DATN               TO CNT-U.LAST-DATE-UPD
    MOVE *TIMN               TO CNT-U.LAST-TIME-UPD
    UPDATE
  END-FIND
*
  IF #SCR-ROLE-2-CD = 'S' OR = 'X'
    IF #CN > 0                         /* MEMBER
      FIND STATUS WITH ID-NUMBER = #CN
        COMPRESS #LAST-NAME ',' INTO STATUS.NAME LEAVING NO
        COMPRESS STATUS.NAME #FIRST-NAME INTO STATUS.NAME
        COMPRESS STATUS.NAME #MIDDLE-NAME INTO STATUS.NAME
        IF #SUFFIX NE ' '
          COMPRESS STATUS.NAME ',' INTO STATUS.NAME LEAVING NO
          COMPRESS STATUS.NAME #SUFFIX INTO STATUS.NAME
        END-IF
*         MOVE #GENDER-CD       TO SEX
        MOVE #SSN             TO SSN
        MOVE #BIRTH-CERT-CODE TO BIRTH-CERT-CODE
        MOVE #MARRIAGE-CERT-CODE TO MARRIAGE-CERT-CODE

        COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
          INTO #YYYYMMDD LEAVING NO
*         MOVE #YYYYMMDD-N      TO STATUS.DATE-OF-BIRTH                      /* TT1

        COMPRESS SUBSTR(#DOD,5,4) SUBSTR(#DOD,1,2) SUBSTR(#DOD,3,2)
          INTO #YYYYMMDD LEAVING NO
        MOVE #YYYYMMDD-N      TO STATUS.DATE-OF-DEATH

        COMPRESS SUBSTR(#DOM,5,4) SUBSTR(#DOM,1,2) SUBSTR(#DOM,3,2)
          INTO #YYYYMMDD LEAVING NO
        MOVE #YYYYMMDD-N      TO STATUS.DATE-OF-MARRIAGE

        MOVE *DATN      TO LAST-FM-DATE
        MOVE *DATN      TO DTS-DATN
        MOVE *TIMN      TO DTS-TIMN
        UPDATE
      END-FIND
    END-IF
    FIND STATUS WITH ID-NUMBER = #CGA-ORIG-ID
      IF #SCR-ROLE-2-CD = 'S'
        IF #ORIG-ROLE-2-CD = ' ' OR = 'X'
          MOVE 'S'               TO STATUS-CODE-SP
          MOVE FORMER-SPOUSE-CONTACT-ID TO SPOUSE-CONTACT-ID
        END-IF
        COMPRESS #LAST-NAME ',' INTO NAME-SP LEAVING NO
        COMPRESS NAME-SP #FIRST-NAME INTO NAME-SP
        COMPRESS NAME-SP #MIDDLE-NAME INTO NAME-SP
        IF #SUFFIX NE ' '
          COMPRESS NAME-SP ',' INTO NAME-SP LEAVING NO
          COMPRESS NAME-SP #SUFFIX INTO NAME-SP
        END-IF
        MOVE #SSN               TO SSN-SP
        MOVE #BIRTH-CERT-CODE   TO BIRTH-CERT-CODE-SP
*         MOVE #GENDER-CD         TO SEX-SP                         /* TT1
        MOVE #MARRIAGE-CERT-CODE TO MARRIAGE-CERT-CODE

        COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
          INTO #YYYYMMDD LEAVING NO
*         MOVE #YYYYMMDD-N      TO STATUS.DATE-OF-BIRTH-SP          /* TT1

        COMPRESS SUBSTR(#DOM,5,4) SUBSTR(#DOM,1,2) SUBSTR(#DOM,3,2)
          INTO #YYYYMMDD LEAVING NO
        MOVE #YYYYMMDD-N      TO STATUS.DATE-OF-MARRIAGE

        COMPRESS SUBSTR(#DIV,5,4) SUBSTR(#DIV,1,2) SUBSTR(#DIV,3,2)
          INTO #YYYYMMDD LEAVING NO
        MOVE #YYYYMMDD-N      TO STATUS.DATE-OF-DIVORCE

        IF #ORIG-ROLE-2-CD = 'X'
          RESET FORMER-SPOUSE-CONTACT-ID FORMER-SPOUSE-NAME FORMER-SPOUSE-SSN FORMER-SPOUSE-STATUS FORMER-SPOUSE-DATE-OF-MARRIAGE
            FORMER-SPOUSE-DATE-OF-DIVORCE FS-BIRTH-CERT-CD FS-MARR-CERT-CD         /* TT1
        END-IF
      ELSE
        IF #SCR-ROLE-2-CD = 'X'
          MOVE 'F'                 TO FORMER-SPOUSE-STATUS
          COMPRESS #LAST-NAME ',' INTO FORMER-SPOUSE-NAME LEAVING NO
          COMPRESS FORMER-SPOUSE-NAME #FIRST-NAME INTO FORMER-SPOUSE-NAME
          COMPRESS FORMER-SPOUSE-NAME #MIDDLE-NAME INTO FORMER-SPOUSE-NAME
          IF #SUFFIX NE ' '
            COMPRESS FORMER-SPOUSE-NAME ',' INTO FORMER-SPOUSE-NAME LEAVING NO
            COMPRESS FORMER-SPOUSE-NAME #SUFFIX INTO FORMER-SPOUSE-NAME
          END-IF
          MOVE #SSN                TO FORMER-SPOUSE-SSN
          MOVE #MARRIAGE-CERT-CODE TO FS-MARR-CERT-CD

          COMPRESS SUBSTR(#DIV,5,4) SUBSTR(#DIV,1,2) SUBSTR(#DIV,3,2)
            INTO #YYYYMMDD LEAVING NO
          MOVE #YYYYMMDD-N      TO STATUS.FORMER-SPOUSE-DATE-OF-DIVORCE

          COMPRESS SUBSTR(#DOM,5,4) SUBSTR(#DOM,1,2) SUBSTR(#DOM,3,2)
            INTO #YYYYMMDD LEAVING NO
          MOVE #YYYYMMDD-N      TO STATUS.FORMER-SPOUSE-DATE-OF-MARRIAGE

          COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
            INTO #YYYYMMDD LEAVING NO
*           MOVE #YYYYMMDD-N      TO STATUS.FORMER-SPOUSE-DT-OF-BIRTH

          IF #ORIG-ROLE-2-CD = 'S'
            MOVE SPOUSE-CONTACT-ID TO FORMER-SPOUSE-CONTACT-ID
            RESET SPOUSE-CONTACT-ID NAME-SP SSN-SP STATUS-CODE-SP DATE-OF-DIVORCE              /* TT1
              DATE-OF-MARRIAGE BIRTH-CERT-CODE-SP TITLE-SP MAILING-FLAG-SP MARRIAGE-CERT-CODE
          END-IF
        ELSE
          RESET FORMER-SPOUSE-CONTACT-ID FORMER-SPOUSE-NAME FORMER-SPOUSE-SSN FORMER-SPOUSE-STATUS FORMER-SPOUSE-DATE-OF-MARRIAGE
            FORMER-SPOUSE-DATE-OF-DIVORCE  FS-BIRTH-CERT-CD FS-MARR-CERT-CD                    /* TT1
        END-IF
      END-IF
      MOVE *DATN      TO LAST-FM-DATE
      MOVE *DATN      TO DTS-DATN
      MOVE *TIMN      TO DTS-TIMN
      UPDATE
    END-FIND
  ELSE
    IF #CN > 0                                                                                      /* MEMBER
      FIND STATUS WITH ID-NUMBER = #CN
        COMPRESS #LAST-NAME ',' INTO STATUS.NAME LEAVING NO
        COMPRESS STATUS.NAME #FIRST-NAME INTO STATUS.NAME
        COMPRESS STATUS.NAME #MIDDLE-NAME INTO STATUS.NAME
        IF #SUFFIX NE ' '
          COMPRESS STATUS.NAME ',' INTO STATUS.NAME LEAVING NO
          COMPRESS STATUS.NAME #SUFFIX INTO STATUS.NAME
        END-IF
*         MOVE #GENDER-CD       TO SEX                                    /* TT1
        MOVE #BIRTH-CERT-CODE TO BIRTH-CERT-CODE
        MOVE #SSN             TO SSN

        COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
          INTO #YYYYMMDD LEAVING NO
*         MOVE #YYYYMMDD-N      TO STATUS.DATE-OF-BIRTH                   /* TT1

        COMPRESS SUBSTR(#DOD,5,4) SUBSTR(#DOD,1,2) SUBSTR(#DOD,3,2)
          INTO #YYYYMMDD LEAVING NO
        MOVE #YYYYMMDD-N      TO STATUS.DATE-OF-DEATH

        MOVE *DATN      TO LAST-FM-DATE
        MOVE *DATN      TO DTS-DATN
        MOVE *TIMN      TO DTS-TIMN
        UPDATE
      END-FIND
    END-IF
*
    IF #SCR-ROLE-2-CD = 'S' OR = 'X'
      FIND STATUS WITH ID-NUMBER = #CGA-ORIG-ID
        IF #SCR-ROLE-2-CD = 'S'
          MOVE 'S'               TO STATUS-CODE-SP
          COMPRESS #LAST-NAME ',' INTO NAME-SP LEAVING NO
          COMPRESS NAME-SP #FIRST-NAME INTO NAME-SP
          COMPRESS NAME-SP #MIDDLE-NAME INTO NAME-SP
          IF #SUFFIX NE ' '
            COMPRESS NAME-SP ',' INTO NAME-SP LEAVING NO
            COMPRESS NAME-SP #SUFFIX INTO NAME-SP
          END-IF

*           MOVE #GENDER-CD         TO SEX-SP                                /* TT1
          MOVE #SSN               TO SSN-SP
          MOVE #BIRTH-CERT-CODE   TO BIRTH-CERT-CODE-SP

          COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
            INTO #YYYYMMDD LEAVING NO
*           MOVE #YYYYMMDD-N      TO STATUS.DATE-OF-BIRTH-SP                /* TT1

          COMPRESS SUBSTR(#DOM,5,4) SUBSTR(#DOM,1,2) SUBSTR(#DOM,3,2)
            INTO #YYYYMMDD LEAVING NO
          MOVE #YYYYMMDD-N      TO STATUS.DATE-OF-MARRIAGE

          COMPRESS SUBSTR(#DIV,5,4) SUBSTR(#DIV,1,2) SUBSTR(#DIV,3,2)
            INTO #YYYYMMDD LEAVING NO
          MOVE #YYYYMMDD-N      TO STATUS.DATE-OF-DIVORCE
        ELSE
          MOVE 'F'                 TO FORMER-SPOUSE-STATUS
          COMPRESS #LAST-NAME ',' INTO FORMER-SPOUSE-NAME LEAVING NO
          COMPRESS FORMER-SPOUSE-NAME #FIRST-NAME INTO FORMER-SPOUSE-NAME
          COMPRESS FORMER-SPOUSE-NAME #MIDDLE-NAME INTO FORMER-SPOUSE-NAME
          IF #SUFFIX NE ' '
            COMPRESS FORMER-SPOUSE-NAME ',' INTO FORMER-SPOUSE-NAME LEAVING NO
            COMPRESS FORMER-SPOUSE-NAME #SUFFIX INTO FORMER-SPOUSE-NAME
          END-IF
          COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
            INTO #YYYYMMDD LEAVING NO
*           MOVE #YYYYMMDD-N      TO FORMER-SPOUSE-DT-OF-BIRTH                /* TT1

          COMPRESS SUBSTR(#DOM,5,4) SUBSTR(#DOM,1,2) SUBSTR(#DOM,3,2)
            INTO #YYYYMMDD LEAVING NO
          MOVE #YYYYMMDD-N      TO FORMER-SPOUSE-DATE-OF-MARRIAGE

          COMPRESS SUBSTR(#DIV,5,4) SUBSTR(#DIV,1,2) SUBSTR(#DIV,3,2)
            INTO #YYYYMMDD LEAVING NO
          MOVE #YYYYMMDD-N      TO FORMER-SPOUSE-DATE-OF-DIVORCE

          MOVE #SSN             TO FORMER-SPOUSE-SSN
        END-IF
        MOVE *DATN      TO LAST-FM-DATE
        MOVE *DATN      TO DTS-DATN
        MOVE *TIMN      TO DTS-TIMN
        UPDATE
      END-FIND
    END-IF
*
    IF #ORIG-ROLE-2-CD = 'K' OR = 'G' OR = 'D'                                                        /* DEPENDENT
      FIND FIRS WITH ID-NUMBER = #CGA-ORIG-ID
        FOR #I 1 60
          IF DEPN-CONTACT-ID(#I) = #CID
            IF NOT (#SCR-ROLE-2-CD = 'K' OR = 'G' OR = 'D') /* DEPENDENT CHANGED TO OTHER
              MOVE DEPN-CONTACT-ID(#I+1:60)      TO DEPN-CONTACT-ID(#I:59)
              MOVE DEPN-NAME(#I+1:60)            TO DEPN-NAME(#I:59)
              MOVE DEPN-DATE-OF-BIRTH(#I+1:60)   TO DEPN-DATE-OF-BIRTH(#I:59)
              MOVE DEPN-SSN(#I+1:60)             TO DEPN-SSN(#I:59)
              MOVE DEPN-BIRTH-CD(#I+1:60)        TO DEPN-BIRTH-CD(#I:59)
              MOVE DEPN-STATUS-CD(#I+1:60)       TO DEPN-STATUS-CD(#I:59)
              MOVE DEPN-REMARKS(#I+1:60)         TO DEPN-REMARKS(#I:59)
              MOVE DEPN-COLL-FUND(#I+1:60)       TO DEPN-COLL-FUND(#I:59)
              MOVE DEPN-COLL-TYPE(#I+1:60)       TO DEPN-COLL-TYPE(#I:59)
              MOVE DEPN-COLL-FROM-YYYY(#I+1:60)  TO DEPN-COLL-FROM-YYYY(#I:59)
              MOVE DEPN-COLL-THRU-YYYY(#I+1:60)  TO DEPN-COLL-THRU-YYYY(#I:59)
              MOVE DEPN-COLL-ANN-COST(#I+1:60)   TO DEPN-COLL-ANN-COST(#I:59)
            ELSE                                                   /* DEPENDENT
              COMPRESS CNT.FIRST-NAME CNT.MIDDLE-NAME INTO DEPN-NAME(#I)
              IF CNT.SUFFIX NE ' '
                COMPRESS DEPN-NAME(#I) ',' INTO DEPN-NAME(#I) LEAVING NO
                COMPRESS DEPN-NAME(#I) CNT.SUFFIX INTO DEPN-NAME(#I)
              END-IF

              COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
                INTO #YYYYMMDD LEAVING NO
              MOVE #YYYYMMDD-N      TO DEPN-DATE-OF-BIRTH (#I)
              MOVE #SSN             TO DEPN-SSN (#I)
              MOVE #BIRTH-CERT-CODE TO DEPN-BIRTH-CD (#I)
            END-IF
            ESCAPE BOTTOM
          END-IF
        END-FOR
        MOVE *DATN      TO FIRS.DP-LAST-FM-DATE
        MOVE *DATN      TO FIRS.DTS-DATN
        MOVE *TIMN      TO FIRS.DTS-TIMN
        UPDATE
      END-FIND
    END-IF
*
    IF (#ORIG-ROLE-2-CD = 'A' OR = 'B' OR = 'E' OR = 'F' OR = 'I' OR = 'P' OR = 'R' OR = 'T')
        AND (#SCR-ROLE-2-CD = 'K' OR = 'G' OR = 'D')      /* OTHER CHANGED TO DEPENDENT
      FIND FIRS WITH ID-NUMBER = #CGA-ORIG-ID
        FOR #I 1 60
          IF DEPN-CONTACT-ID (#I) = 0
            MOVE #CID          TO DEPN-CONTACT-ID(#I)
            COMPRESS #FIRST-NAME #MIDDLE-NAME INTO DEPN-NAME (#I)
            IF #SUFFIX NE ' '
              COMPRESS DEPN-NAME (#I) ',' INTO DEPN-NAME(#I) LEAVING NO
              COMPRESS DEPN-NAME (#I) #SUFFIX INTO DEPN-NAME (#I)
            END-IF

            COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
              INTO #YYYYMMDD LEAVING NO
            MOVE #YYYYMMDD-N      TO DEPN-DATE-OF-BIRTH (#I)
            MOVE #SSN             TO DEPN-SSN (#I)
            MOVE #BIRTH-CERT-CODE TO DEPN-BIRTH-CD (#I)
            ESCAPE BOTTOM
          END-IF
        END-FOR
        MOVE *DATN      TO FIRS.DP-LAST-FM-DATE
        MOVE *DATN      TO FIRS.DTS-DATN
        MOVE *TIMN      TO FIRS.DTS-TIMN
        UPDATE
      END-FIND
    END-IF
  END-IF
*
  IF #ORIG-ROLE-2-CD NE #SCR-ROLE-2-CD
    FIND CNT-REL-U WITH CONTACT-2-ID = #CID
      IF CONTACT-1-ID = #CO-ID-1
        MOVE #SCR-ROLE-2-CD TO CNT-REL-U.ROLE-2-CD
        MOVE #CGA-CLERK     TO CNT-REL-U.LAST-USER-UPD
        MOVE *DATN          TO CNT-REL-U.LAST-DATE-UPD
        MOVE *TIMN          TO CNT-REL-U.LAST-TIME-UPD
        UPDATE
        ESCAPE BOTTOM
      END-IF
    END-FIND
  END-IF
  MOVE 'Record successfully updated.' TO #MSG
END-IF
ASSIGN #UPDATE = TRUE
*
*******************************
DEFINE SUBROUTINE DELETE-RECORD
*******************************

RESET #CONFIRM-DELETE #DONT-DELETE
FIND CNT-S WITH CONTACT-ID = #CID
  #MEMBER-NAME := FUNCTION-DISP-CT-NAME(<CNT-S.FIRST-NAME,CNT-S.MIDDLE-NAME,CNT-S.LAST-NAME,CNT-S.SUFFIX>)
END-FIND
#DEL-NAME := FUNCTION-DISP-CT-NAME(<CNT.FIRST-NAME,CNT.MIDDLE-NAME,CNT.LAST-NAME,CNT.SUFFIX>)
MOVE #SSN TO #DEL-SSN
SET WINDOW 'Confirm-Delete'

REPEAT
  INPUT WINDOW='Confirm-Delete' USING MAP 'C2232MCB'
  IF *PF-KEY = 'PF3'
    ESCAPE BOTTOM
  END-IF
  IF #CONFIRM-DELETE = 'Y'
    FIND CNT-REL-S WITH CONTACT-2-ID = #CID      /* Checks for other existing relationships
      IF CONTACT-1-ID NE #CO-ID-1
        MOVE TRUE TO #DONT-DELETE                     /* Don't tag for deletion
        ESCAPE BOTTOM
      ELSE
        DELETE
      END-IF
    END-FIND
*
    IF NOT #DONT-DELETE
      FIND CNT-U WITH CONTACT-ID = #CID
        MOVE 'Y' TO DELETE-FLAG
        MOVE #CGA-CLERK          TO CNT-U.LAST-USER-UPD
        MOVE *DATN               TO CNT-U.LAST-DATE-UPD
        MOVE *TIMN               TO CNT-U.LAST-TIME-UPD
        UPDATE
      END-FIND
    END-IF
*
    MOVE 'Record successfully deleted.' TO #MSG
    ESCAPE BOTTOM
  END-IF
END-REPEAT
SET WINDOW OFF
*
IF NOT *PF-KEY = 'PF3'
  PERFORM WRITE-TRANS-REG
  PERFORM DELETE-STATUS-FIRS
END-IF
ASSIGN #UPDATE = TRUE
END-SUBROUTINE
*
************************************
DEFINE SUBROUTINE DELETE-STATUS-FIRS
************************************
IF #ORIG-ROLE-2-CD = 'G' OR = 'K' OR = 'D'         /* Remove Dependent info from Member's record in A-FIRS
  FIND FIRS WITH ID-NUMBER = #CGA-ORIG-ID
    FOR #I 1 60
      IF DEPN-CONTACT-ID(#I) = #CID
        MOVE BY NAME DEPENDENT-TABLE    (#I+1:60) TO DEPENDENT-TABLE    (#I:59)
        MOVE BY NAME DEPN-COLL-FUND-TBL (#I+1:60) TO DEPN-COLL-FUND-TBL (#I:59)
        MOVE BY NAME DEPN-COLL-TYPE-TBL (#I+1:60) TO DEPN-COLL-TYPE-TBL (#I:59)
        MOVE BY NAME DEPN-COLL-INFO-TBL (#I+1:60) TO DEPN-COLL-INFO-TBL (#I:59)
        RESET DEPENDENT-TABLE(60) DEPN-COLL-FUND-TBL(60) DEPN-COLL-TYPE-TBL(60)
          DEPN-COLL-INFO-TBL(60)
        ESCAPE BOTTOM
      END-IF
    END-FOR
    MOVE *DATN      TO FIRS.DP-LAST-FM-DATE
    MOVE *DATN      TO FIRS.DTS-DATN
    MOVE *TIMN      TO FIRS.DTS-TIMN
    UPDATE
  END-FIND
ELSE
  IF #ORIG-ROLE-2-CD = 'S' OR = 'X'               /* Remove Spouse/Former Spouse info from Member's record in A-STATUS
    FIND STATUS WITH ID-NUMBER = #CGA-ORIG-ID
      IF #ORIG-ROLE-2-CD = 'S'
        RESET STATUS.SPOUSE-CONTACT-ID STATUS.STATUS-CODE-SP  STATUS.DATE-OF-DIVORCE STATUS.SSN-SP   /* TT1
          STATUS.NAME-SP  STATUS.DATE-OF-MARRIAGE STATUS.BIRTH-CERT-CODE-SP STATUS.MARRIAGE-CERT-CODE STATUS.TITLE-SP
          STATUS.MAILING-FLAG-SP
      ELSE
        RESET FORMER-SPOUSE-CONTACT-ID FORMER-SPOUSE-NAME FORMER-SPOUSE-SSN FORMER-SPOUSE-STATUS FORMER-SPOUSE-DATE-OF-MARRIAGE
          FORMER-SPOUSE-DATE-OF-DIVORCE  FS-BIRTH-CERT-CD FS-MARR-CERT-CD                         /* TT1
      END-IF
      MOVE *DATN      TO STATUS.LAST-FM-DATE
      MOVE *DATN      TO STATUS.DTS-DATN
      MOVE *TIMN      TO STATUS.DTS-TIMN
      UPDATE
    END-FIND
  END-IF
END-IF
*
END-SUBROUTINE

*********************************
DEFINE SUBROUTINE WRITE-TRANS-REG
*********************************
GET STATUS #STATUS-ISN
GET CNT    #CONTACT-ISN
IF #CID = 0             /* Add Contact
  MOVE #SCR-ROLE-2-CD TO #ORIG-ROLE-2-CD
END-IF

MOVE *TIMN TO #HOLD-TIME
COMPRESS SUBSTR(#DOB,5,4) SUBSTR(#DOB,1,2) SUBSTR(#DOB,3,2)
  INTO #YYYYMMDD LEAVING NO
MOVE #YYYYMMDD-N TO #DOB-2
COMPRESS SUBSTR(#DOM,5,4) SUBSTR(#DOM,1,2) SUBSTR(#DOM,3,2)
  INTO #YYYYMMDD LEAVING NO
MOVE #YYYYMMDD-N TO #DOM-2
COMPRESS SUBSTR(#DIV,5,4) SUBSTR(#DIV,1,2) SUBSTR(#DIV,3,2)
  INTO #YYYYMMDD LEAVING NO
MOVE #YYYYMMDD-N TO #DIV-2
COMPRESS SUBSTR(#DOD,5,4) SUBSTR(#DOD,1,2) SUBSTR(#DOD,3,2)
  INTO #YYYYMMDD LEAVING NO
MOVE #YYYYMMDD-N TO #DOD-2


IF #CONFIRM-DELETE = 'Y'
  RESET CNT.FIRST-NAME CNT.MIDDLE-NAME CNT.LAST-NAME CNT.SUFFIX
    #DOB-2 #DOM-2 #DIV-2 CNT.SSN
END-IF

CALLNAT 'C2232SCB'
  #CONTACT-ISN
  #STATUS-ISN
  #FIRS-ISN
  #ITR1
  #ITR2
  #CGA-ORIG-ID
  STATUS.PROCESS-IND /* PM - 06/2000 - SPLIT COMPANIES
  STATUS.NAME
  FIRS.DP-LAST-FM-DATE
  #CGA-CLERK
  #HOLD-TIME
  #ORIG-ROLE-2-CD
  #SCR-ROLE-2-CD
  CNT.FIRST-NAME
  CNT.MIDDLE-NAME
  CNT.LAST-NAME
  CNT.SUFFIX
  #CID
  #DOB-2
  #DOM-2
  #DIV-2
  CNT.SSN
  CNT.GENDER-CD
  CNT.BIRTH-CERT-CODE
  #DOD-2
  #ORGANIZATION
*
END-SUBROUTINE

ON ERROR
/*
  CALLNAT 'USR2001N' P_PARMS
/*
  MOVE EDITED P_ERROR_TIME (EM=YYYY'-'MM'-'DD' 'HH':'II':'SS)
    TO #ERROR-TIME
/*
  INPUT (AD=OIT IP=OFF CD=TU SG=OFF)
    /// 5T 'Error number:' P_ERROR_NUM 'Error class:' P_ERROR_CLASS 'Error line:' P_ERROR_LINE
    //  5T 'Error program:' P_ERROR_PROGRAM
    /   5T 'Error program type:' P_ERROR_PGM_TYPE
    /   5T 'Error program type long:' P_ERROR_PGM_TYPE_LONG
    /   5T 'Error program level:' P_ERROR_LEVEL
    /   5T 'Language at error time:' P_ERROR_LANG
    //  5T 'Error library:' P_ERROR_LIB
    /   5T 'DBID:' P_ERROR_DBID 'FNR:' P_ERROR_FNR
    //  5T 'Error type:'  P_ERROR_TYPE
    /   5T 'Error time:' #ERROR-TIME
  ESCAPE ROUTINE
END-ERROR

END
