* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL USING OBJLGENT
* local using ATHISWRK
local
1 #isn (p7)
1 #line (a50)
* 1 var-int-rt (p2.3)
* 1 curr-rt    (p2.3)
* 1 #CURR-DEFAULT-INT-RATE (p2.3)
END-DEFINE
* #CURR-DEFAULT-INT-RATE := FUNCTION-INT-RATE(<'RATECB1'>)
* display #CURR-DEFAULT-INT-RATE
   define work file 1 '/usr/SAG/AAFMAA/batch/workfiles/TEMP/dump.gent'
DISPLAY 'START'
* perform add-record
find gen-table-v with gen-key = 'TRAN'
  delete
  end transaction
end-find  
* read work file 1 gen-table-v
* read gen-table-v with gen-key = 'TRAN'
*  if gen-key ne 'TRAN'
*     escape bottom
*  end-if
*  read gen-table-v     /* BY GEN-KEY = 'ADDR'   /* sec-key = 'RATEG'
* write 'number' *number
*    store gen-table-v
*     APPROVED-FLAG := 'N'
*     UPDATE
*    DISPLAY APPROVED-FLAG
*     END TRANSACTION
*  write
*   write work file 1 gen-table-v
* end-read
* read gen-table-v with gen-key = 'MODE'
*  if gen-key ne 'MODE'
*     escape bottom
*  end-if
*  read gen-table-v     /* BY GEN-KEY = 'ADDR'   /* sec-key = 'RATEG'
* write 'number' *number
*    store gen-table-v
*     APPROVED-FLAG := 'N'
*     UPDATE
*    DISPLAY APPROVED-FLAG
*     END TRANSACTION
*  write
*   write work file 1 gen-table-v
* end-read
*   write *COUNTER *isn gen-key gen-sub-key gen-number-value end-date
*   end-read
read work file 1 gen-table-v
  store gen-table-v
end-work
end transaction
   DISPLAY 'END'
*  END-FIND
* input #isn
* get gen-table-v #isn
* #line := substr(gen-description,1,50)
* display #isn gen-key gen-sub-key #line
*    end-date := 99999999
*     UPDATE
* delete
*   end transaction
*
* R-INT-RT := FUNCTION-INT-RATE(<'RATECB '>)                   /* YK2
* RR-RT     := FUNCTION-INT-RATE(<'RATECA '>) / 100             /* YK2
* splay VAR-INT-RT CURR-RT
* R-VAR-INT-RT := FUNCTION-INT-RATE(<'RATECB '>)                   /* YK2
* -CURR-RT     := FUNCTION-INT-RATE(<'RATECA '>) / 100             /* YK2
* splay CUR-VAR-INT-RT IS-CURR-RT
* define subroutine add-record
* GEN-DESCRIPTION    := 'User Initiated Batch Processes'
* GEN-KEY            := 'MENU'
* GEN-SUB-KEY        := 'B'
* OWNER-ID           := 'YAK'
* ALT-OWNER-ID       := 'PAM'
* GEN-SECURITY-CODE  := 99
* GEN-ALPHA-VALUE    := 'G1000PUI:PROC'
* EFFECTIVE-DATE     := 01012008
* END-DATE           := 99999999
* LAST-DATE-UPDATE   := 20080205
*  store gen-table-v
*  end transaction
* end-subroutine
END
