* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID LOADANNR
*
DEFINe DATA
LOCAL
*
1 #input    (a6)
*
1 st-v view of a-status
 2 id-number
 2 DTS-DATN
 2 DTS-TIMN
 2 process-ind
 2 intro-flag
 2 name
 2 DATE-OTHER-UPDATE
 2 annual-rpt-flag
 2 number-memberships
*
1 #i1    (i2)
1 #i2    (i2)
*
1 #full     (n6)
1 #summary  (n6)
1 #none     (n6)
1 #blank    (n6)
1 #unknown  (n6)
1 #CN  (n6)
1 redefine #cn
 2 #cn-a  (a6)
*
1 #TRX  (I2)
1 #W-OLD-NEW-DATA  (A125)
1 REDEFINE #W-OLD-NEW-DATA
  2 #W-DESCRIPTION (A10)
  2 #W-DATA        (A115)
*
1 TRLOG VIEW OF A-TRANSACTION-REGISTER
 2 ID-NUMBER
 2 NAME
 2 DATE-LAST-UPDATE
 2 TERMINAL-ID
 2 PROCESS-IND
 2 CLERK-ID
 2 TRANSACTION-DATN (P9)
 2 TRANSACTION-TIMN (P7)
 2 OLD-DATA  (A125/32)
 2 NEW-DATA  (A125/32)
 2 REDEFINE NEW-DATA
  3 NEW-DATA-OCC (32)
   4 NEW-DATA-CG (A3)
   4 NEW-DATA-REST (A122)
*
END-DEFINE
*
write 'DO Full file'
READ WORK 1 #input      /* FUL REPORT FILE
  move #input to #cn-a
*
  find (1) st-v with member-key = #cn-a
    if no record found
      write #input 'No St Record Found'
      escape bottom
    end-norec
*
    if annual-rpt-flag = 'F'
      end transaction
      escape top
    end-if
*
    MOVE 'ANN RP CD' TO #W-DESCRIPTION
    MOVE St-v.ANNUAL-RPT-FLAG TO #W-DATA
    MOVE #W-OLD-NEW-DATA TO OLD-DATA (1)
    MOVE 'F' TO #W-DATA
    MOVE #W-OLD-NEW-DATA TO NEW-DATA (1)
*
    MOVE st-v.ID-NUMBER   TO TRLOG.ID-NUMBER
    mOVE st-v.NAME        TO TRLOG.NAME
    MOVE st-v.PROCESS-IND TO TRLOG.PROCESS-IND
    MOVE st-v.DATE-OTHER-UPDATE TO TRLOG.DATE-LAST-UPDATE
    MOVE 'EDS'      TO TRLOG.CLERK-ID
    MOVE *INIT-ID   TO TRLOG.TERMINAL-ID
    MOVE *DATN      TO TRLOG.TRANSACTION-DATN
    MOVE *TIMN      TO TRLOG.TRANSACTION-TIMN
    MOVE 'CG-' TO NEW-DATA-CG (1)
    STORE TRLOG
*
    move 'F' to st-v.annual-rpt-flag
    MOVE *DATN TO DTS-DATN
    MOVE *TIMN TO DTS-TIMN
    MOVE *DATN TO st-v.DATE-OTHER-UPDATE
    update (0064)
    end transaction
*   write st-v.id-number 'Record processed'
  end-find
end-work
*
write 'DO Summary file'
READ WORK 2 #input      /* Summary REPORT FILE
  move #input to #cn-a
*
  find (1) st-v with member-key = #cn-a
    if no record found
      write #input 'No St Record Found'
      escape bottom
    end-norec
*
    if annual-rpt-flag = 'S'
      end transaction
      escape top
    end-if
*
    MOVE 'ANN RP CD' TO #W-DESCRIPTION
    MOVE St-v.ANNUAL-RPT-FLAG TO #W-DATA
    MOVE #W-OLD-NEW-DATA TO OLD-DATA (1)
    MOVE 'S' TO #W-DATA
    MOVE #W-OLD-NEW-DATA TO NEW-DATA (1)
*
    MOVE st-v.ID-NUMBER   TO TRLOG.ID-NUMBER
    mOVE st-v.NAME        TO TRLOG.NAME
    MOVE st-v.PROCESS-IND TO TRLOG.PROCESS-IND
    MOVE st-v.DATE-OTHER-UPDATE TO TRLOG.DATE-LAST-UPDATE
    MOVE 'EDS'      TO TRLOG.CLERK-ID
    MOVE *INIT-ID   TO TRLOG.TERMINAL-ID
    MOVE *DATN      TO TRLOG.TRANSACTION-DATN
    MOVE *TIMN      TO TRLOG.TRANSACTION-TIMN
    MOVE 'CG-' TO NEW-DATA-CG (1)
    STORE TRLOG
*
    move 'S' to st-v.annual-rpt-flag
    MOVE *DATN TO DTS-DATN
    MOVE *TIMN TO DTS-TIMN
    MOVE *DATN TO st-v.DATE-OTHER-UPDATE
    update (0106)
    end transaction
*   write st-v.id-number 'Record processed'
  end-find
end-work
*
write 'DO None file'

READ WORK 3 #input      /* NONE REPORT FILE
  move #input to #cn-a
*
  find (1) st-v with member-key = #cn-a
    if no record found
      write #input 'No St Record Found'
      escape bottom
    end-norec
*
    if annual-rpt-flag = 'N'
      end transaction
      escape top
    end-if
*
    MOVE 'ANN RP CD' TO #W-DESCRIPTION
    MOVE St-v.ANNUAL-RPT-FLAG TO #W-DATA
    MOVE #W-OLD-NEW-DATA TO OLD-DATA (1)
    MOVE 'N' TO #W-DATA
    MOVE #W-OLD-NEW-DATA TO NEW-DATA (1)
*
    MOVE st-v.ID-NUMBER   TO TRLOG.ID-NUMBER
    mOVE st-v.NAME        TO TRLOG.NAME
    MOVE st-v.PROCESS-IND TO TRLOG.PROCESS-IND
    MOVE st-v.DATE-OTHER-UPDATE TO TRLOG.DATE-LAST-UPDATE
    MOVE 'EDS'      TO TRLOG.CLERK-ID
    MOVE *INIT-ID   TO TRLOG.TERMINAL-ID
    MOVE *DATN      TO TRLOG.TRANSACTION-DATN
    MOVE *TIMN      TO TRLOG.TRANSACTION-TIMN
    MOVE 'CG-' TO NEW-DATA-CG (1)
    STORE TRLOG
*
    move 'N' to st-v.annual-rpt-flag
    MOVE *DATN TO DTS-DATN
    MOVE *TIMN TO DTS-TIMN
    MOVE *DATN TO st-v.DATE-OTHER-UPDATE
    update (0149)
    end transaction
*   write st-v.id-number 'Record processed'
  end-find
end-work
*
read st-v by member-key
*  escape bottom    /* <<<<<<<<<<<<<<<<<<
*
  if  (number-memberships = 0)
   OR (INTRO-FLAG = 'S' OR = 'K' OR = 'G')     /* NO SPS OR GEN
   OR (PROCESS-IND = 'C')                      /* NO CONTACT ENTITIES
    escape top
  end-if
*
  decide on first value of annual-rpt-flag
    value 'F' add 1 to #full
    value 'S' add 1 to #summary
    value 'N' add 1 to #NONE
    value ' ' add 1 to #blank
    none      add 1 to #unknown
  end-decide
end-read
*
write #full    'Full ann Rpt'
write #Summary 'Summary Ann Rpt'
write #NONE    'None Ann Rpt'
write #blank   'Blank Ann Rpt'
write #Unknown 'Unknown Ann Rpt'
*
END
