* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
LOCAL USING OBJLGENT
LOCAL
1 #TAB        (A1) CONST <H'09'>
*
1 #INPUT-RECORD-3
  2 #ISN           (A) DYNAMIC
  2 #KEY           (A) DYNAMIC
  2 #SUB-KEY       (A) DYNAMIC
  2 #SEC-CODE      (A) DYNAMIC
  2 #ALPHA-VALUE   (A) DYNAMIC
  2 #NUM-VALUE     (A) DYNAMIC
  2 #DESCRIPTION   (A) DYNAMIC
  2 #EFF-DATE      (A) DYNAMIC
  2 #END-DATE      (A) DYNAMIC
  2 #PRIM-OWN      (A) DYNAMIC
  2 #ALT-OWN       (A) DYNAMIC
  2 #LAST-USER     (A) DYNAMIC
  2 #LAST-DATE     (A) DYNAMIC
  2 #ADDL-INFO     (A) DYNAMIC
  2 #APPR-FLAG     (A) DYNAMIC
  2 #USER-APPV     (A) DYNAMIC
*
1 #RECORD          (A500)
1 #CNT             (P7)
1 #CNT-2           (P7)
1 #LOAD            (A8)  INIT <'LOAD'>
*
1 #DATN            (N8)
1 #TIME            (N7)
*
1 #I1              (I2)
1 #I2              (I2)
*
1 #GEN-KEY         (A7)
1 #ST-KEY          (A3)
1 #WORK-STATE      (A6)
1 REDEFINE #WORK-STATE
 2 #WORK-1         (A3)
 2 #STATE          (A3)
*
1 #FOUND           (L)
*
END-DEFINE
*
************************************************************************
#DATN := *DATN
#TIME := *TIMN
*
RESET #FOUND
D01. FIND GEN-TABLE-V WITH GEN-KEY = 'CODE'
  IF GEN-TABLE-V.GEN-SUB-KEY = '090'
    #FOUND := TRUE
    WRITE 'FOUND an EXISTING entry'
    delete (d01.)
  END-IF
END-FIND
*
RESET #CNT
READ WORK FILE 1 #RECORD
  ADD 1 TO #CNT
*
  IF #CNT = 1 OR #RECORD = ' '
    ESCAPE TOP
  END-IF
*
  RESET #INPUT-RECORD-3
  SEPARATE #RECORD INTO
    #KEY
    #SUB-KEY
    #SEC-CODE
    #ALPHA-VALUE
    #NUM-VALUE
    #DESCRIPTION
    #EFF-DATE
    #END-DATE
    #PRIM-OWN
    #ALT-OWN
    #LAST-USER
    #LAST-DATE
    #ADDL-INFO
    #APPR-FLAG
  IGNORE WITH DELIMITERS #TAB
*
  RESET GEN-TABLE-V
  GEN-KEY               := #KEY
  GEN-SUB-KEY           := #SUB-KEY
  GEN-DESCRIPTION       := #DESCRIPTION
  GEN-SECURITY-CODE     := 99
  GEN-ALPHA-VALUE       := #ALPHA-VALUE
  ADDL-INFO             := #ADDL-INFO
  EFFECTIVE-DATE        := VAL(#EFF-DATE)
  END-DATE              := VAL(#END-DATE)
  OWNER-ID              := #PRIM-OWN
  ALT-OWNER-ID          := #ALT-OWN
  USER-APPROVED         := 'VXT'
  LAST-USER-UPDATE      := #LAST-USER
  LAST-DATE-UPDATE      := VAL(#LAST-DATE)
  APPROVED-FLAG         := #APPR-FLAG
  IF #NUM-VALUE NE ' '
    GEN-NUMBER-VALUE    := VAL(#NUM-VALUE)
  END-IF
*
  DISPLAY (1) #CNT GEN-KEY GEN-SUB-KEY
  STORE GEN-TABLE-V
  END TRANSACTION
END-WORK
*
END
