DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
/** New Parameter Data Area LWSAPR.
/**
/** :author nguentchev
1 POR
  2 beneficiaryrestricted (A5)
  2 rolename (A33)
  2 designationid (A8)
  2 settlementtype (A33)
  2 beneficiarypercent (A10)
  2 policynumber (A16)
  2 contactid (A8)
  2 contactGUID (A50)
  2 policyGUID (A50)
  2 beneficiarydesignationGUID (A50)
END-DEFINE
