DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*  /** New Parameter Data Area MANASRCH.
1 #OWNERCN (N6)
*  /**
*  /** :author nguentchev
*  /* TODO Enter your data definitions here
1 #LAST-NAME (A25)
1 #PHONE (N20)
1 #EMAIL (A40)
1 #FIRST-NAME (A25)
1 #SSN (A11)
1 #DOB (N8)
END-DEFINE
