* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* <Natural Source Header
/** New Function MANF0008.
/**
/** :author nguentchev
DEFINE FUNCTION CAN-OVERRIDE-LIMITS RETURNS (L)
  DEFINE DATA
  LOCAL
  1 #VALID-CLERK-IDS  (A3/4) CONST <'MB','GCJ','MJM','NG'>
1 #VALID-USER-IDS   (A8/4) CONST <'BZM3QG','GJACOBS','MMEESE','GUENTCH'>
  END-DEFINE
/*
  RESET CAN-OVERRIDE-LIMITS
IF *USER = #VALID-USER-IDS (*)
  CAN-OVERRIDE-LIMITS := TRUE
END-IF
END-FUNCTION
END
