DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*  /** New Local Data Area MANL010A.
*  /**
*  /** :author nguentchev
*  /**
1 #TITLES (A10/1:2,1:12)
  INIT
  (1,1) <'a'>
  (1,2) <'b'>
  (1,3) <'b'>
  (1,4) <'c'>
  (1,5) <'v'>
  (1,6) <'d'>
END-DEFINE
