DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*  New Parameter Data Area MBRASVC.
*
*  :author nguentchev
*  TODO: Enter your data definitions here
1 ServiceRequest
  2 ContactID (N8)
  2 C@Service (I2)
  2 Service (1:*)
    3 Plan (A3)
    3 MODE (A1)
    3 TrackingID (N6)
    3 SERVICE-ID (A20)
    3 CRM-SERVICE-ID (A50)
END-DEFINE
