DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*  New Parameter Data Area MBRRATEA.
*
*  :author nguentchev
*  TODO: Enter your data definitions here
1 ServiceRates
  2 Age (I2)
  2 Service (1:*)
    3 Plan (A3)
    3 YearlyRate (N7.2)
    3 AGERANGE (A7)
  2 C@Service (I2)
END-DEFINE
