* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
************************************************************************
* NAME         : MBRDATA3                                               *
* AUTHOR       : Copyright: MetrostarSystems AAFMAA                    *
* DESCRIPTION  : Returns Contact data elements                         *
************************************************************************
*        MODIFICATION LOG                                              *
************************************************************************
* USER   DATE      TAG  REASON                                         *
* NGG    20120605       Initial Creation                               *
*
DEFINE DATA
PARAMETER
1 #CONTACT-ID          (N8)
1 #XML_SERIALZE_OUTPUT (A)  DYNAMIC
LOCAL USING AUCAPI01
LOCAL USING AUCAMI01
LOCAL USING AUCAMS01
LOCAL
1 ST-V VIEW OF A-STATUS
  2 STATUS-CODE-SP
  2 DATE-OF-MARRIAGE
  2 DATE-OF-DIVORCE
  2 MARRIAGE-CERT-CODE
  2 FORMER-SPOUSE-STATUS
  2 FORMER-SPOUSE-DATE-OF-MARRIAGE
  2 FORMER-SPOUSE-DATE-OF-DIVORCE
  2 FS-MARR-CERT-CD
*
1 #XML-TEMP (A) DYNAMIC
1 #GET      (I4) CONST <0>
1 BLANK     (A1) CONST <' '>
1 #TRUE                (A4)  CONST <'true'>
1 #FALSE               (A5)  CONST <'false'>
*
END-DEFINE
*
IF #CONTACT-ID <= 0
  ESCAPE ROUTINE
END-IF
FIND (1) ST-V WITH MEMBER-CONTACT-ID = #CONTACT-ID
  IF NO RECORDS FOUND
    RESET ST-V
  END-NOREC
END-FIND
*
RESET PersonalInfo
PersonalInfo.ContactID  := #CONTACT-ID
PersonalInfo.ActionType := #GET
CALLNAT 'AUCNPIM1' PersonalInfo
COMPRESS  #XML_SERIALZE_OUTPUT
  '<SSNProtectedDate'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS NUMERIC #XML_SERIALZE_OUTPUT
  PersonalInfo.SSNProtectedDate
  '</SSNProtectedDate>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<BirthCode'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  PersonalInfo.BirthCode
  '</BirthCode>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<DeathCode'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  PersonalInfo.DeathCode
  '</DeathCode>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS FULL #XML_SERIALZE_OUTPUT
  '<WebsiteURL'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<![CDATA['
  PersonalInfo.WebsiteURL
  ']]>'
  '</WebsiteURL>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS FULL #XML_SERIALZE_OUTPUT
  '<OrganizationEstablishedDate'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS NUMERIC #XML_SERIALZE_OUTPUT
  PersonalInfo.OrganizationEstablishedDate
  '</OrganizationEstablishedDate>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS FULL #XML_SERIALZE_OUTPUT
  '<OrganizationCertificateCode'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS FULL #XML_SERIALZE_OUTPUT
  PersonalInfo.OrganizationCertificateCode
  '</OrganizationCertificateCode>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
*
RESET MilitaryInfo
MilitaryInfo.ContactID  := #CONTACT-ID
MilitaryInfo.ActionType := #GET
CALLNAT 'AUCNMIM1' MilitaryInfo
COMPRESS FULL #XML_SERIALZE_OUTPUT
  '<PreviousMilitaryRankID'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS FULL #XML_SERIALZE_OUTPUT
  MilitaryInfo.PreviousMilitaryRankID
  '</PreviousMilitaryRankID>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<SpecialPay'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
IF MilitaryInfo.SpecialPay = 'Y'
  COMPRESS  #XML_SERIALZE_OUTPUT #TRUE
    '</SpecialPay>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
ELSE
  COMPRESS  #XML_SERIALZE_OUTPUT #FALSE
    '</SpecialPay>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
END-IF
COMPRESS  #XML_SERIALZE_OUTPUT
  '<RankProtection'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
IF MilitaryInfo.RankProtection = 'Y'
  COMPRESS  #XML_SERIALZE_OUTPUT #TRUE
    '</RankProtection>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
ELSE
  COMPRESS  #XML_SERIALZE_OUTPUT #FALSE
    '</RankProtection>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
END-IF
COMPRESS  #XML_SERIALZE_OUTPUT
  '<RankProtectionDate'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS NUMERIC #XML_SERIALZE_OUTPUT
  MilitaryInfo.RankProtectionDate
  '</RankProtectionDate>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
*
IF FORMER-SPOUSE-DATE-OF-DIVORCE > 0
  COMPRESS FULL #XML_SERIALZE_OUTPUT
    '<DateOfDivorce'
    '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
  COMPRESS NUMERIC #XML_SERIALZE_OUTPUT
    FORMER-SPOUSE-DATE-OF-DIVORCE
    '</DateOfDivorce>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
END-IF
IF MARRIAGE-CERT-CODE NE BLANK
  COMPRESS FULL #XML_SERIALZE_OUTPUT
    '<MarriageCertificateCode'
    '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
  COMPRESS NUMERIC #XML_SERIALZE_OUTPUT
    ST-V.MARRIAGE-CERT-CODE
    '</MarriageCertificateCode>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
END-IF
IF FS-MARR-CERT-CD NE BLANK
  COMPRESS FULL #XML_SERIALZE_OUTPUT
    '<DivorceCertificateCode'
    '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
  COMPRESS NUMERIC #XML_SERIALZE_OUTPUT
    ST-V.FS-MARR-CERT-CD
    '</DivorceCertificateCode>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
END-IF
*
RESET MembershipInfo
MembershipInfo.ContactID := #CONTACT-ID
MembershipInfo.ActionType := #GET
CALLNAT 'AUCNMSM1' MembershipInfo
COMPRESS  #XML_SERIALZE_OUTPUT
  '<AAFMAAAccess'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
IF MembershipInfo.AAFMAAAccess = 'Y'
  COMPRESS  #XML_SERIALZE_OUTPUT #TRUE
    '</AAFMAAAccess>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
ELSE
  COMPRESS  #XML_SERIALZE_OUTPUT #FALSE
    '</AAFMAAAccess>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
END-IF
COMPRESS  #XML_SERIALZE_OUTPUT
  '<SpecialCode'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  MembershipInfo.SpecialCode
  '</SpecialCode>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<MailSpecial'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  MembershipInfo.MailSpecial
  '</MailSpecial>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<Newsletter'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  MembershipInfo.Newsletter
  '</Newsletter>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<Underwriting'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  MembershipInfo.Underwriting
  '</Underwriting>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<ApplSource'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<![CDATA['
  MembershipInfo.ApplSource
  ']]>'
  '</ApplSource>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<AnnualMeeting'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  MembershipInfo.AnnualMeeting
  '</AnnualMeeting>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<AnnualReport'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  MembershipInfo.AnnualReport
  '</AnnualReport>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  '<BridgerVerify'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
IF MembershipInfo.BridgerVerify = 'Y'
  COMPRESS  #XML_SERIALZE_OUTPUT #TRUE
    '</BridgerVerify>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
ELSE
  COMPRESS  #XML_SERIALZE_OUTPUT #FALSE
    '</BridgerVerify>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
END-IF
COMPRESS  #XML_SERIALZE_OUTPUT
  '<ProcessInd'
  '>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
COMPRESS  #XML_SERIALZE_OUTPUT
  MembershipInfo.ProcessInd
  '</ProcessInd>' INTO #XML_SERIALZE_OUTPUT LEAVING NO
*
END
