DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 CONTACT
  2 Id (A) DYNAMIC
  2 DateOfBirth (N8)
  2 FirstName (A) DYNAMIC
  2 MiddleName (A) DYNAMIC
  2 LastName (A) DYNAMIC
  2 GovtID (N9)
  2 Gender (A1)
  2 ContactType (A1)
  2 CN (N6)
  2 ContactID (N8)
END-DEFINE
