* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*/
DEFINE DATA PARAMETER
 1 PARMS(A250)
 1 REDEFINE PARMS
   2 TIMEOUT (N8)
   2 PERRINFO(L)
   2 CALLETA (L)
   2 TRYALT  (L)
   2 MFPATT  (A8)
   2 UXPATT  (A8)
END-DEFINE
 ASSIGN  TIMEOUT =          0
 ASSIGN  PERRINFO=  TRUE
 ASSIGN  CALLETA =  FALSE
 ASSIGN  TRYALT  =  TRUE
 ASSIGN  MFPATT  ='ETB*'
 ASSIGN  UXPATT  ='*'
END
