* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
***********************************************************
*   Program : NCOAPLS1                                    *
*                                                         *
*   Function: Read work file and eliminate duplicate CN   *
*                                                         *
* 03/03/2017 vxt Initial creation                         *
***********************************************************
DEFINE DATA LOCAL
1 #rec-read   (n7)
1 #rec-extr   (n7)
1 #in-file    (a125)
1 redefine #in-file
  2 #cn         (n6)
  2 #rest       (a119)
1 #old-cn     (n6)
END-DEFINE
*
* DEFINE WORK FILE 1 '/usr/SAG/AAFMAA/batch/workfiles/SYSDA/ATH/NCOA.OWNERS.SORTED.TXT' TYPE 'ASCII'
* DEFINE WORK FILE 2 '/usr/SAG/AAFMAA/batch/workfiles/SYSDA/ATH/NCOA.OWNERS.SORTED.FINAL.TXT' TYPE 'ASCII'
*
read work file 1 #in-file
  add 1 to #rec-read
  if #cn ne #old-cn
    write work 2 #in-file
    add 1 to #rec-extr
    move #cn to #old-cn
  end-if
  at end of data
    write
      'records read' #rec-read /
      'records extracted ' #rec-extr
  end-enddata
end-work
end

