DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*                                                Policy Data
1 EMAIL-INFORMATION
  2 EMAIL-FLAG (L)
  2 DOCTYPE (A4)
  2 CREATION-DATE (N8.0)
  2 POLICY-NUMBER (A16)
  2 SALUTATION (A50)
  2 DAL-CN (A6)
  2 OWNER-EMAIL (A60)
  2 INSURED-NAME (A25)
  2 ISSUE-DATE (A12)
  2 PAYMENT-MODE (A30)
  2 FPF-AMOUNT-DUE (A13)
END-DEFINE
