* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION FUNCTION-MEMBER-NAME RETURNS (A) DYNAMIC
DEFINE DATA
PARAMETER
1 #ID-NUMBER    (N6)
LOCAL
1 CONTACT VIEW OF A-CONTACTS
  2 CONTACT-ID (N8)
END-DEFINE
*
FIND CONTACT WITH ID-NUMBER = #ID-NUMBER
  FUNCTION-MEMBER-NAME := FUNCTION-CONTACT-NAME-2 (< CONTACT-ID >)
END-FIND
*
END-FUNCTION
END
