DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
* New Parameter Data Area OBJADBTS.
*
* :author nguentchev
* TODO: Enter your data definitions here
1 #DB
  2 #REQUEST (I4)
  2 #FILE-REC-ISN (P8)
  2 #FILE-NAME (A) DYNAMIC
  2 #Message (A) DYNAMIC
  2 LAST-DATE-UPD (N8)
  2 LAST-TIME-UPD (N7)
  2 LAST-USER-UPD (A8)
  2 LUU-NAME (A) DYNAMIC
END-DEFINE
