DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*  New Parameter Data Area OBJAMP01.
*
*  :author nguentchev
*  TODO: Enter your data definitions here
1 #SVC-PLAN
  2 LAST-UPD-USER (A8)
  2 LAST-UPD-DATE (N8)
  2 LAST-UPD-TIME (N7)
  2 SVC-PLAN (A3)
  2 SVC-PLAN-DESCRIPTION (A50)
  2 SVC-PLAN-EFFECTIVE-DATE (N8)
  2 SVC-PLAN-END-DATE (N8)
END-DEFINE
