DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
*       * Access general file table
*
*
*
1 PARM-GEN-TABLE
  2 #ACTION (A8)
  2 #PRIMARY-KEY (A15)
  2 REDEFINE #PRIMARY-KEY
    3 #SEC-KEY (A7)
    3 REDEFINE #SEC-KEY
      4 #KEY (A4)
      4 #SUB-KEY (A3)
    3 #DATE (N8.0)
  2 #RETURN-CODE (A4)
  2 #RETURN-MESSAGE (A70)
  2 PARM-ARRAY (1:*)
    3 ISN (P7.0)
    3 GEN-KEY (A4)
    3 GEN-SUB-KEY (A3)
    3 GEN-SECURITY-CODE (N2.0)
    3 GEN-ALPHA-VALUE (A50)
    3 GEN-NUMBER-VALUE (N7.4)
    3 GEN-DESCRIPTION (A75)
    3 EFFECTIVE-DATE (N8.0)
    3 END-DATE (N8.0)
    3 OWNER-ID (A3)
    3 ALT-OWNER-ID (A3)
    3 LAST-USER-UPDATE (A8)
    3 LAST-DATE-UPDATE (N8.0)
    3 ADDL-INFO (A150)
    3 APPROVED-FLAG (A1)
    3 USER-APPROVED (A8)
    3 DATE-APPROVED (N8.0)
  2 #NUMBER-OF-RECORDS (N6.0) OPTIONAL
END-DEFINE
