DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 SVC-PLAN-V VIEW OF A-SVC-PLAN
  2 LAST-UPD-USER (A8)
  2 LAST-UPD-DATE (N8)
  2 LAST-UPD-TIME (N7)
  2 SVC-PLAN (A3)
  2 SVC-PLAN-DESCRIPTION (A50)
  2 SVC-PLAN-EFFECTIVE-DATE (N8)
  2 SVC-PLAN-END-DATE (N8)
1 A-SVC-PLAN VIEW OF A-SVC-PLAN
  2 SVC-PLAN-ALLOW-ALOT (A1)
  2 SVC-PLAN-AAFM-BILL (A1)
END-DEFINE
