* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
LOCAL USING OBJAPR01
LOCAL
1 #REQUEST (A) DYNAMIC
1 #MSG     (A) DYNAMIC
END-DEFINE
*
#REQUEST := 'UPDATE_RFS'
#PROCESS-REQ.REQUEST-TYPE := 'DELINQUENT CAP'
CALLNAT 'OBJNPR01'
  #PROCESS-REQ
  #REQUEST
  #MSG
IF #MSG NE ' '
  PRINT #MSG
  BACKOUT TRANSACTION
END-IF
END
