DEFINE DATA GLOBAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
BLOCK MASTER-BLOCK
1 #CGA-G
  2 #CGA-INFO-10A (A10)
  2 #CGA-INFO-20A (A20)
  2 #CGA-INFO-5N (N5)
END-DEFINE
