* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: PC-FET2
DEFINE DATA
GLOBAL USING PC-CGA-G WITH MASTER-BLOCK
LOCAL
1 ST-V VIEW OF A-STATUS
 2 ID-NUMBER
 2 NAME
 2 RANK
 2 MILITARY-STATUS
*
1 #INVALID  (L)
1 #ERROR-MSG   (A60)
*
END-DEFINE
*
MOVE 'Last Prog = PC-fet2' TO #CGA-INFO-20A
ADD 1 TO #CGA-INFO-5N
COMPRESS #CGA-INFO-10A 'D' INTO #CGA-INFO-10A LEAVING NO
*
END
