* >Natural Source Header 000000
* :Mode R
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
PARAMETER
1 #P-A10 (A10/1:2)
1 #P-N10 (N10/1:2)
1 #P-P10A (P10)
1 #P-P10B (P10)
LOCAL
1 #L-A5  (A5) INIT <'SUB'>
END-DEFINE
*
COMPRESS #P-A10(2) #L-A5 INTO #P-A10(2)
MOVE *DEVICE TO #P-A10(1)
ADD 1 TO #P-N10(2)
ADD 1 TO #P-P10A
ADD 1 TO #P-P10B
END
