* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL
1 TR-V VIEW OF A-TRANSACTION-REGISTER
  2 ID-NUMBER
  2 DATE-LAST-UPDATE (N8)
  2 REDEFINE DATE-LAST-UPDATE
   3 DLU-CENT  (A2)
   3 DLU-YY  (A2)
   3 DLU-MM  (A2)
   3 DLU-DD  (A2)
  2 TRANSACTION-DATN
END-DEFINE
  READ (20) TR-V
* READ(2) ST-V BY WIDOW-KEY
DISPLAY NOTITLE ID-NUMBER DATE-LAST-UPDATE DLU-CENT DLU-YY DLU-MM DLU-DD
*    NAME-KEY WIDOW-FLAG WIDOW-KEY
END-READ
END
