* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL
1 ST-V VIEW OF A-STATUS
  2 ID-NUMBER
  2 MEMBER-KEY
  2 NAME-KEY
  2 WIDOW-FLAG
  2 WIDOW-KEY
  2 MEMBER-FLAG
  2 C*ACTIVE-SEGMENTS
  2 PLAN (9)
  2 ISSUE-DATE (9)
END-DEFINE
  READ (20) ST-V BY MEMBER-KEY FROM '011000'
* READ(2) ST-V BY WIDOW-KEY
DISPLAY NOTITLE ID-NUMBER C*ACTIVE-SEGMENTS PLAN(*) ISSUE-DATE(*)
*    NAME-KEY WIDOW-FLAG WIDOW-KEY
END-READ
END
