DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 P_VALIDATE
  2 P_VAL-IF-NAME (A25)
  2 P_VAL-ERR-MSG (A60)
END-DEFINE
