* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE FUNCTION HAS_KIDS RETURNS (I2)
  DEFINE DATA
  PARAMETER
  1 CONTACT-ID (N8)
  LOCAL
  1 CR-V VIEW OF A-CONTACT-RELATIONSHIPS
    2 CONTACT-1-ID (N8)
    2 ROLE-1-CD    (A1)
    2 CONTACT-2-ID (N8)
    2 ROLE-2-CD    (A1)
  END-DEFINE
*
RESET HAS_KIDS
FIND CR-V WITH CONTACT-1-ID = CONTACT-ID
  IF CR-V.ROLE-2-CD = 'K'
    ADD 1 TO HAS_KIDS
  END-IF
END-FIND
END-FUNCTION
END
