DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
 1 #TITLE (A/1:24) DYNAMIC
   CONST
   <
   'CN',
   'Prefix',
   'First',
   'Last',
   'Gender',
   'Pay Grade',
   'Married',
   'Kids',
   'Age',
   'DOB',
   'No of Policies',
   'Total Face Amount',
   'Total Death Benefits',
   'Product',
   'Policy 1',
   'Plcy_1_ExpirationDate',
   'Policy 2',
   'Plcy_2_ExpirationDate',
   'Policy 3',
   'Plcy_3_ExpirationDate',
   'Policy 4',
   'Plcy_4_ExpirationDate',
   'Policy 5',
   'Plcy_5_ExpirationDate'
   >
 1 #TITLE-2 (A/1:10) DYNAMIC
   CONST
   <
   'Salutation',
   'Letter',
   'Email',
   'Phone',
   'State',
   'City',
   'ZIP',
   'AddressLine1',
   'AddressLine2',
   'AddressLine3'
   >
 1 ADAM (A1)
   CONST
   <'A'>
 1 JAMES (A1)
   CONST
   <'J'>
 1 MARK (A1)
   CONST
   <'M'>
 1 TED (A1)
   CONST
   <'T'>
 1 #DIR (A) DYNAMIC
   CONST
   <'/usr/SAG/tmp/'>
 1 #ADAM_F1 (A) DYNAMIC
   CONST
   <'Adam.txt'>
 1 #ADAM_F2 (A) DYNAMIC
   CONST
   <'AdamWithActivePolicies.txt'>
 1 #ADAM_F3 (A) DYNAMIC
   CONST
   <'AdamNoActivePolicy.txt'>
 1 #JAMES_F1 (A) DYNAMIC
   CONST
   <'James.txt'>
 1 #JAMES_F2 (A) DYNAMIC
   CONST
   <'JamesWithActivePolicies.txt'>
 1 #JAMES_F3 (A) DYNAMIC
   CONST
   <'JamesNoActivePolicy.txt'>
 1 #MARK_F1 (A) DYNAMIC
   CONST
   <'Mark.txt'>
 1 #MARK_F2 (A) DYNAMIC
   CONST
   <'MarkWithActivePolicies.txt'>
 1 #MARK_F3 (A) DYNAMIC
   CONST
   <'MarkNoActivePolicy.txt'>
 1 #TED_F1 (A) DYNAMIC
   CONST
   <'Ted.txt'>
 1 #TED_F2 (A) DYNAMIC
   CONST
   <'TedWithActivePolicies.txt'>
 1 #TED_F3 (A) DYNAMIC
   CONST
   <'TedNoActivePolicy.txt'>
 1 #ANONYMOUS_F1 (A) DYNAMIC
   CONST
   <'Anonymous.txt'>
 1 #ANONYMOUS_F2 (A) DYNAMIC
   CONST
   <'AnonymousWithActivePolicies.txt'>
 1 #ANONYMOUS_F3 (A) DYNAMIC
   CONST
   <'AnonymousNoActivePolicy.txt'>
END-DEFINE
