* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Program ID: PDBPALL
* Project Persona Database
**************************************************************************
*        MODIFICATION LOG
**************************************************************************
* USER   DATE      TAG  REASON
* NG    20130506        Created
*
DEFINE DATA
LOCAL USING PDBLTTL
LOCAL
1 #PARMS          (A8) 1 REDEFINE #PARMS
  2 #PERSONA      (A1)
  2 FILLER        1X
  2 CN            (N6)
1 #CURRENT_PERSONA (A1)
1 CAMPAIGNS       (A1)
1 #EXCEL          (A1024)
1 #EXCEL-Campaign (A1024)
1 #EXCEL-NoPol    (A1024)
1 #INSURED        (I2)
1 #SKIP           (L)
1 #AGE            (I2)
1 #FNAME          (A) DYNAMIC
1 #ISN            (P10)
*
1 CNT-V VIEW OF A-CONTACTS
  2 CONTACT-ID    (N8)
1 #TAB            (A1)  CONST <H'09'>
1 YES             (A1)  CONST <'Y'>
1 UNNAMED         (A1)  CONST <'U'>
1 #MACHINE-CLASS  (A16)
1 #TP             (A8)
*
END-DEFINE
*
* PERSONA IS ONE OF Adam, James, Mark, Ted, Unnamed or BLANK for all of them
*
PRINT
  / 'CODEPAGE....:' *CODEPAGE
  / 'HARDWARE....:' *HARDWARE
  / 'HOSTNAME....:' *HOSTNAME
  / 'INIT-ID.....:' *INIT-ID
  / 'INIT-PROGRAM:' *INIT-PROGRAM
  / 'LOCALE......:' *LOCALE
  / 'MACHINE-CLASS:' *MACHINE-CLASS
  / 'OPSYS.......:' *OPSYS
  / 'OS..........:' *OS
  / 'OSVERS......:' *OSVERS
  / 'TP..........:' *TP
  / 'TPSYS.......:' *TPSYS
  / 'TPVERS......:' *TPVERS
  / 'WINMGR......:' *WINMGR
  / 'WINMGRVERS..:' *WINMGRVERS
  / 'BROWSER-IO..:' *BROWSER-IO
  / 'DEVICE......:' *DEVICE
  / 'GROUP.......:' *GROUP
  / 'HARDCOPY....:' *HARDCOPY
  / 'INIT-USER...:' *INIT-USER
  / 'LANGUAGE....:' *LANGUAGE
  / 'NATVERS.....:' *NATVERS
  / 'NET-USER....:' *NET-USER
  / 'PARM-USER...:' *PARM-USER
  / 'PATCH-LEVEL.:' *PATCH-LEVEL
  / 'PID.........:' *PID
  / 'SCREEN-IO...:' *SCREEN-IO
  / 'SERVER-TYPE.:' *SERVER-TYPE
  / 'UI..........:' *UI
  / 'USER........:' *USER
  / 'USER-NAME...:' *USER-NAME
*
INPUT #PARMS
IF #PERSONA = ADAM OR= JAMES OR= MARK OR= TED OR= UNNAMED OR= ' '
  IGNORE
ELSE
  PRINT 'Only A,J,M,T,U or Blank are accepted'
  ESCAPE ROUTINE
END-IF
*
PERFORM INIT-FILES
*
CAMPAIGNS := YES
IF CN > 0
  FIND CNT-V WITH ID-NUMBER = CN
    #ISN := *ISN (0089)
    #CURRENT_PERSONA := #PERSONA
    CALLNAT 'PDBNFLTR'
      #ISN
      #SKIP
      #CURRENT_PERSONA
      #AGE
    IF #SKIP
      ESCAPE TOP
    ELSE
      PERFORM PERSONA-DATA
    END-IF
  END-FIND
ELSE
  READ CNT-V BY ID-NUMBER
      STARTING FROM 1901
    #ISN := *ISN (0104)
    #CURRENT_PERSONA := #PERSONA
    CALLNAT 'PDBNFLTR'
      #ISN
      #SKIP
      #CURRENT_PERSONA
      #AGE
    IF #SKIP
      ESCAPE TOP
    ELSE
      PERFORM PERSONA-DATA
    END-IF
  END-READ
END-IF
*
DEFINE PERSONA-DATA
/*     ============
CALLNAT 'PDBNDATA'
  #ISN
  #INSURED
  #AGE
  #EXCEL
  #EXCEL-NoPol
IF CAMPAIGNS = YES
  /* Collect compain data
  CALLNAT 'PDBN0002' CNT-V.CONTACT-ID #EXCEL-Campaign
END-IF
DECIDE ON FIRST VALUE OF #CURRENT_PERSONA
  VALUE ADAM
    WRITE WORK 1 #EXCEL #TAB #EXCEL-Campaign
    IF #INSURED > 0
      WRITE WORK 2 #EXCEL #TAB #EXCEL-Campaign
    ELSE
      WRITE WORK 3 #EXCEL-NoPol #TAB #EXCEL-Campaign
    END-IF
  VALUE JAMES
    WRITE WORK 4 #EXCEL #TAB #EXCEL-Campaign
    IF #INSURED > 0
      WRITE WORK 5 #EXCEL #TAB #EXCEL-Campaign
    ELSE
      WRITE WORK 6 #EXCEL-NoPol #TAB #EXCEL-Campaign
    END-IF
  VALUE MARK
    WRITE WORK 7 #EXCEL #TAB #EXCEL-Campaign
    IF #INSURED > 0
      WRITE WORK 8 #EXCEL #TAB #EXCEL-Campaign
    ELSE
      WRITE WORK 9 #EXCEL-NoPol #TAB #EXCEL-Campaign
    END-IF
  VALUE TED
    WRITE WORK 10 #EXCEL #TAB #EXCEL-Campaign
    IF #INSURED > 0
      WRITE WORK 11 #EXCEL #TAB #EXCEL-Campaign
    ELSE
      WRITE WORK 12 #EXCEL-NoPol #TAB #EXCEL-Campaign
    END-IF
  NONE VALUE
    WRITE WORK 13 #EXCEL #TAB #EXCEL-Campaign
    IF #INSURED > 0
      WRITE WORK 14 #EXCEL #TAB #EXCEL-Campaign
    ELSE
      WRITE WORK 15 #EXCEL-NoPol #TAB #EXCEL-Campaign
    END-IF
END-DECIDE
END-SUBROUTINE
*
DEFINE INIT-FILES
/*     ==========
#MACHINE-CLASS := *MACHINE-CLASS
#TP            := *SERVER-TYPE
IF #TP = 'DEVELOP'
  COMPRESS #DIR #ADAM_F1 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 1 #FNAME TYPE 'ASCII-COMPRESSED'
  COMPRESS #DIR #ADAM_F2 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 2 #FNAME TYPE 'ASCII-COMPRESSED'
  COMPRESS #DIR #ADAM_F3 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 3 #FNAME TYPE 'ASCII-COMPRESSED'
*
  COMPRESS #DIR #JAMES_F1 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 4 #FNAME TYPE 'ASCII-COMPRESSED'
  COMPRESS #DIR #JAMES_F2 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 5 #FNAME TYPE 'ASCII-COMPRESSED'
  COMPRESS #DIR #JAMES_F3 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 6 #FNAME TYPE 'ASCII-COMPRESSED'
*
  COMPRESS #DIR #MARK_F1 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 7 #FNAME TYPE 'ASCII-COMPRESSED'
  COMPRESS #DIR #MARK_F2 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 8 #FNAME TYPE 'ASCII-COMPRESSED'
  COMPRESS #DIR #MARK_F3 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 9 #FNAME TYPE 'ASCII-COMPRESSED'
*
  COMPRESS #DIR #TED_F1 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 10 #FNAME TYPE 'ASCII-COMPRESSED'
  COMPRESS #DIR #TED_F2 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 11 #FNAME TYPE 'ASCII-COMPRESSED'
  COMPRESS #DIR #TED_F3 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 12 #FNAME TYPE 'ASCII-COMPRESSED'
*
  COMPRESS #DIR #ANONYMOUS_F1 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 13 #FNAME TYPE 'ASCII-COMPRESSED'
  COMPRESS #DIR #ANONYMOUS_F2 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 14 #FNAME TYPE 'ASCII-COMPRESSED'
  COMPRESS #DIR #ANONYMOUS_F3 INTO #FNAME LEAVING NO
  DEFINE WORK FILE 15 #FNAME TYPE 'ASCII-COMPRESSED'
END-IF
*
COMPRESS #TITLE   (*) INTO #EXCEL          WITH DELIMITER #TAB
COMPRESS #TITLE-2 (*) INTO #EXCEL-Campaign WITH DELIMITER #TAB
WRITE WORK 1 #EXCEL #TAB #EXCEL-Campaign
WRITE WORK 2 #EXCEL #TAB #EXCEL-Campaign
COMPRESS #TITLE (1:10) INTO #EXCEL  WITH DELIMITER #TAB
WRITE WORK 3 #EXCEL #TAB #EXCEL-Campaign
*
COMPRESS #TITLE   (*) INTO #EXCEL          WITH DELIMITER #TAB
COMPRESS #TITLE-2 (*) INTO #EXCEL-Campaign WITH DELIMITER #TAB
WRITE WORK 4 #EXCEL #TAB #EXCEL-Campaign
WRITE WORK 5 #EXCEL #TAB #EXCEL-Campaign
COMPRESS #TITLE (1:10) INTO #EXCEL  WITH DELIMITER #TAB
WRITE WORK 6 #EXCEL #TAB #EXCEL-Campaign
*
COMPRESS #TITLE   (*) INTO #EXCEL          WITH DELIMITER #TAB
COMPRESS #TITLE-2 (*) INTO #EXCEL-Campaign WITH DELIMITER #TAB
WRITE WORK 7 #EXCEL #TAB #EXCEL-Campaign
WRITE WORK 8 #EXCEL #TAB #EXCEL-Campaign
COMPRESS #TITLE (1:10) INTO #EXCEL  WITH DELIMITER #TAB
WRITE WORK 9 #EXCEL #TAB #EXCEL-Campaign
*
COMPRESS #TITLE   (*) INTO #EXCEL          WITH DELIMITER #TAB
COMPRESS #TITLE-2 (*) INTO #EXCEL-Campaign WITH DELIMITER #TAB
WRITE WORK 10 #EXCEL #TAB #EXCEL-Campaign
WRITE WORK 11 #EXCEL #TAB #EXCEL-Campaign
COMPRESS #TITLE (1:10) INTO #EXCEL  WITH DELIMITER #TAB
WRITE WORK 12 #EXCEL #TAB #EXCEL-Campaign
*
COMPRESS #TITLE   (*) INTO #EXCEL          WITH DELIMITER #TAB
COMPRESS #TITLE-2 (*) INTO #EXCEL-Campaign WITH DELIMITER #TAB
WRITE WORK 13 #EXCEL #TAB #EXCEL-Campaign
WRITE WORK 14 #EXCEL #TAB #EXCEL-Campaign
COMPRESS #TITLE (1:10) INTO #EXCEL  WITH DELIMITER #TAB
WRITE WORK 15 #EXCEL #TAB #EXCEL-Campaign
END-SUBROUTINE
*
END
