DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 PARM-APPL-TRACKING
  2 #AT-NUMBER-A (A6)
  2 #AT-NAME (A25)
  2 #ISN (P8.0)
  2 #USER-ACTION (A8)
  2 #ERROR-MESSAGE (A60)
  2 PM-CODE (A3/1:4)
  2 PM-REMARK (A130/1:4)
  2 PM-STATUS (A25)
  2 PM-VENDOR (A10) /*Name of the vendor
END-DEFINE
