* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* <Natural Source Header
/** New Function POSF0003.
/**
/** :author nguentchev
DEFINE FUNCTION GET-DSGN-ID RETURNS (N8)
/* TODO Enter your code here
  DEFINE DATA
  LOCAL
  1 DS-V VIEW OF A-DESIGNATION
    2 DESIGNATION-ID (N8)
  LOCAL
  END-DEFINE
*
READ (1) DS-V DESCENDING BY DESIGNATION-ID
END-READ
GET-DSGN-ID := DESIGNATION-ID + 1
END-FUNCTION
END
