* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* <Natural Source Header
/** New Subprogram POSN0014.
/**
/** :author nguentchev
/* TODO Enter your code here
DEFINE DATA
PARAMETER
1 #POLICY-NUMBER   (A16)
1 #MSG             (A) DYNAMIC
LOCAL USING POSADSGN
LOCAL USING ERROR_L
LOCAL
1 #GET    (I4) CONST <0>
1 #UPDATE (I4) CONSTANT <2>
1 #ISN    (N8)
END-DEFINE
*
RESET #DSGN
#DSGN.DESIGNATION-ID := GET-FINAL-DSGN-ID (< #POLICY-NUMBER >)
CALLNAT 'POSN0011' #GET #MSG #ISN #DSGN
IF #MSG = ' '
  #DSGN.STATUS-CODE := 'C'
  RESET #DSGN.LAST-UPD-DATE
    #DSGN.LAST-UPD-TIME
    #DSGN.LAST-UPD-USER
  CALLNAT 'POSN0011' #UPDATE #MSG #ISN #DSGN
END-IF
END
