* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM = RCSBPN
*
* INCLUDE RCSBPC
*
END
