* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
define data local
1 #line   (n3) init <1>
1 #text   (a20) init <'this is line number:'>
end-define
format (0) ls=60 ps=11
write (0) title 'program' *program 'date' *timx (em=mm/dd/yyyy' 'hh:ii:ss)
at top of page (0)
  reset initial #line
end-toppage
repeat
  add 1 to #line
  display (0) #text #line *line-count
  if *line-count lt 11
    write (0) ' '
  end-if
end-repeat
end

