* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* <Natural Source Header
/** New Function RTEF0002.
/**
/** :author nguentchev
DEFINE FUNCTION Get7Pay RETURNS (N5.6)
  DEFINE DATA
  PARAMETER
  1 #AGE           (I2) BY VALUE
  1 #SMOKER-FLAG   (A1)
  1 #GENDER-CD     (A1)
  1 #VERSION       (A1)
  LOCAL
  1 #MECC-KEY (A5) 1 REDEFINE #MECC-KEY
    2 #TYPE   (A1)  /* P = 7PAY A = ADJ1035
    2 #AGE-2  (A2)
    2 #GENDER (A1)
    2 #SMOKER (A1)
  1 PRTES-V VIEW OF A-PRODUCT-RATES
    2 WL-RATE   (N7.2)
    2 MECC-KEY  (A5)
  1 #MAX-7-PAY-NON-SM
  2 #N00 (A48) INIT <'01033-01037-01067-01100-01134-01170-01209-01251-'>
  2 #N08 (A48) INIT <'01295-01342-01392-01444-01497-01551-01605-01660-'>
  2 #N16 (A48) INIT <'01714-01770-01826-01884-01944-02007-02073-02142-'>
  2 #N24 (A48) INIT <'02215-02293-02374-02460-02551-02645-02745-02848-'>
  2 #N32 (A48) INIT <'02957-03070-03187-03310-03437-03569-03706-03848-'>
  2 #N40 (A48) INIT <'03995-04147-04307-04468-04637-04811-04991-05178-'>
  2 #N48 (A48) INIT <'05370-05570-05777-05991-06212-06440-06675-06917-'>
  2 #N56 (A48) INIT <'07167-07424-07689-07964-08248-08542-08847-09162-'>
  2 #N64 (A48) INIT <'09487-09822-10168-10528-10904-11301-11719-12156-'>
  1 REDEFINE #MAX-7-PAY-NON-SM
    2 #7-PA-OCC-NS (72)
      3 #7-PA-MAX-PRM-NS   (N4.1)
      3 #7-PA-MAX-PRM-NS-X (A1)
*
  1 #MAX-7-PAY-SMOKER
  2 #S00 (A48) INIT <'01256-01271-01312-01356-01402-01451-01502-01558-'>
  2 #S08 (A48) INIT <'01616-01678-01743-01811-01882-01954-02028-02100-'>
  2 #S16 (A48) INIT <'02170-02239-02310-02383-02457-02535-02616-02701-'>
  2 #S24 (A48) INIT <'02791-02887-02988-03094-03206-03323-03446-03574-'>
  2 #S32 (A48) INIT <'03708-03847-03991-04141-04297-04458-04625-04797-'>
  2 #S40 (A48) INIT <'04974-05157-05344-05536-05734-05936-06144-06357-'>
  2 #S48 (A48) INIT <'06577-06804-07037-07278-07525-07779-08039-08304-'>
  2 #S56 (A48) INIT <'08575-08852-09138-09433-09740-10058-10387-10726-'>
  2 #S64 (A48) INIT <'11074-11429-11794-12172-12565-12981-13422-13890-'>
  1 REDEFINE #MAX-7-PAY-SMOKER
    2 #7-PA-OCC-SM (72)
      3 #7-PA-MAX-PRM-SM   (N4.1)
      3 #7-PA-MAX-PRM-SM-X (A1)
  END-DEFINE
/*
  RESET Get7Pay
IF #VERSION = '4'
  #TYPE := 'P'
  IF #AGE GT 80
    MOVE 80 TO #AGE
  END-IF
  MOVE EDITED #AGE (EM=99) TO #AGE-2
  #GENDER := #GENDER-CD
  IF #SMOKER-FLAG = 'S' OR= 'Y'
    #SMOKER := 'Y'
  ELSE
    #SMOKER := 'N'
  END-IF
  FIND PRTES-V WITH MECC-KEY = #MECC-KEY
    Get7Pay := PRTES-V.WL-RATE / 1000  /* more digits
  END-FIND
ELSE
  ADD 1 TO #AGE
  IF #AGE GT 72
    MOVE 72 TO #AGE
  END-IF
  IF #SMOKER-FLAG = 'S' OR= 'Y'
    Get7Pay := #7-PA-MAX-PRM-SM (#AGE)
  ELSE
    Get7Pay := #7-PA-MAX-PRM-NS (#AGE)
  END-IF
END-IF
END-FUNCTION
END
