* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* RX-TEST - Create Test case
* bz 08/30/2017
DEFINE DATA
PARAMETER
1 p_SSN              (N9)
END-DEFINE

/*  p_SSN := 050000000
/*  ESCAPE ROUTINE

DEFINE WINDOW WIN-Test
  SIZE 17 * 50
  BASE 8 / 13
  TITLE ' Rx test cases '
  CONTROL SCREEN

p_SSN := 0
SET KEY PF2
SET KEY PF3
REPEAT UNTIL *PF-KEY = 'PF2' AND p_SSN <> 0
  INPUT WINDOW='WIN-Test' (IP=OFF)
    01/2 'RX Test Cases. Enter Test SSN to continue'
    03/2 '  Test SSN from 0 to 19    : Rx        Fills'(I)
    04/2 '010000000/011 - 429100000  : High       : 62'
    05/2 '020000000/021 - 429200000  : Medium     : 51'
    06/2 '030000000/031 - 429300000  : Low        : 36'
    07/2 '040000000/041 - 429400000  : Elig Only  :  0'
    08/2 '050000000/051 - 429500000  : Medium     : 38'
    09/2 '060000000/061 - 429600000  : Medium     : 17'
    10/2 '070000000/071 - 429700000  : Low        :  4'
    11/2 '080000000/081 - 429800000  : Medium     : 18'
    12/2 '090000000     - 429900000  : Not Found  :  0'
    14/2 'SSN:' p_SSN (AD=M EM=999999999) 7x 'PF2-Run     PF3-Cancel'(I)
  IF *PF-KEY = 'PF3' ESCAPE BOTTOM END-IF
END-REPEAT
END
