DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 p_Parms
  2 p_AT (N6) BY VALUE
  2 p_Clerk (A3)
  2 p_Mode (A1) /* T = test mote
  2 p_Message (A) DYNAMIC BY VALUE RESULT
  2 p_RC (N4)
END-DEFINE
