DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #SCAN-LINE (A18)
1 REDEFINE #SCAN-LINE /* BEGIN REDEFINE: #SCAN-LINE
  2 #SCAN-WORK-CHECK-DIGIT (A17)
  2 #SCAN-WORK-CHECK-REST (A1)
1 REDEFINE #SCAN-LINE /* BEGIN REDEFINE: #SCAN-LINE
  2 #SCAN-MEMBER-CN (A6)
  2 #SCAN-ISSUE-DATE (A8) /*MMDDYYYY format
  2 #SCAN-POL-IND (A1)
  2 #SCAN-BILL-TYPE (A2)
  2 #SCAN-CHECK-DIGIT (A1)
END-DEFINE
