* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*************************************************************************
* program SORTM05 written 10/24/2006 Andy Bergmanis (SAG)
* purpose to get around Unix sort not limiting the sort to the sort keys
* sorts only on the first 27 characters of the record
*************************************************************************
DEFINE DATA LOCAL
* 1 #inrec
*   2 #sortkey (a27)
*   2 #therest (a223)
1 #INREC               /* PM99
  2 #SORTKEY  (A72)   /* PM99
  2 #THEREST  (A477)  /* PM99     vt1 was 475

1 #RECSIN   (N7)
1 #RECSOUT  (N7)
END-DEFINE
**
READ WORK FILE 1 #INREC
  ADD 1 TO #RECSIN
END-ALL
**
SORT RECORDS BY #SORTKEY USING #THEREST
**
  WRITE WORK FILE 2 #INREC
  ADD 1 TO #RECSOUT
END-SORT
**
WRITE //
  #RECSIN  'records in' /
  #RECSOUT 'records out'
**
END
