DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #PDA-AAFMAA-SERVICES
  2 #SERVICES-CN (N6)
  2 #SERVICES-PARM-DATE (N8)
  2 #SERVICES (L)
  2 #SERVICES-AMOUNT-DUE (N7.2)
  2 #SERVICES-PAYMENT-MODE (A1)
  2 #SERVICES-PAID-TO-DATE (N8)
  2 #SERVICES-ISSUE-DATE (N8)
  2 #SERVICES-TERMINATION-DATE (N8)
  2 #OL-IND (L)
  2 #OL-INDEX (I2)
END-DEFINE
