* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
LOCAL
1 M-V VIEW OF A-SVC-MEMBER
  2 SVC-CONTRACT-NUMBER
END-DEFINE
HISTOGRAM M-V FOR SVC-CONTRACT-NUMBER
  DISPLAY *NUMBER SVC-CONTRACT-NUMBER
END-HISTOGRAM
END
