* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
DEFINE DATA
LOCAL USING SVCA0003
LOCAL
1 #MSG  (A) DYNAMIC
END-DEFINE
*
PARM-SVC.ACTION := 'GET'
SVC-MEMBER-ID := 41530
SVC-PLAN := 'PSM'
CALLNAT 'SVCN0003' PARM-SVC #MSG
PRINT PARM-SVC
*
END
