* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
define data
local
1 cnt-v view of a-contacts
  2 first-name
end-define
find cnt-v with first-name ge 'robert'
  display *number first-name
end-find
* histogram cnt-v for first-name
*   display *number first-name
* end-histogram
end
