* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION TRANSLATE-POL-STATUS RETURNS (A) DYNAMIC
DEFINE DATA
PARAMETER
1 #STATUS (A1)
END-DEFINE
  DECIDE ON FIRST VALUE OF #STATUS
  VALUE 'D'
     TRANSLATE-POL-STATUS := 'Active'
  VALUE 'F'
     TRANSLATE-POL-STATUS := 'Cancelled'
  NONE VALUE
     IGNORE
  END-DECIDE
END-FUNCTION
END
