DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 DOCUMENT-DTL (A78)
1 REDEFINE DOCUMENT-DTL /* REDEF. BEGIN : DOCUMENT-DTL
  2 DOC1 (A35)
  2 DF2 (A4)
  2 DOC2 (A35)
1 DEPN-X (I1)
1 MAX-IDX (P3)
1 LOOP-LIMIT (P3)
1 W-LINES-REMAINING (P3)
1 WI-F01-VIEW VIEW OF DI-F01
  2 C*DOCUMENT
  2 DOCUMENT (A35/1:72) /* MULTIPLE FIELD
END-DEFINE
