DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #P-DI-LIST
  2 #P-DI-FIRS-ISN (P8)
  2 #P-DI-IDX (I1)
  2 #P-DI-NUM-ENTRIES (P3)
  2 #P-DI-START-NUM (P3)
  2 #P-DI-TOT-INSURANCE (P9)
  2 #P-DI-TRAVEL-INSURANCE (P9)
  2 #P-DI-CODE-TYPE-TAB (A1/1:4)
  2 #P-DI-SCR-LINE (A78/1:18)
END-DEFINE
