* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Create an array with CNs of rejected credit card charges     *
* from daly CC process                                         * 
**************************************************************** 
* YAK    20120730         Initial creation                     * 
****************************************************************
DEFINE DATA  
  PARAMETER
  1 REJ-CC-CN (A/*) DYNAMIC
  LOCAL
  1 #CC-DAILY-TRAN (A) DYNAMIC CONST
    <"/usr/SAG/AAFMAA/batch/workfiles/PERMDA/COM/DailyFPFCCTran.txt">
1 #I            (I2)
1 #TAB          (A1) CONST <H'09'>
1 #SUCCESSFUL   (A1) CONST <'4'>
1 #INPUT        (A200)
1 #AT-NUMBER    (A) DYNAMIC
1 #CN-NUMBER    (A) DYNAMIC
1 #CC-NUMBER    (A) DYNAMIC
1 #CC-EXP-MONTH (A) DYNAMIC
1 #CC-EXP-YEAR  (A) DYNAMIC
1 #CC-AMOUNT    (A) DYNAMIC
1 #USER         (A) DYNAMIC
1 #RESULT-CODE  (A) DYNAMIC    
  END-DEFINE
*
IF FN_Exist(<#CC-DAILY-TRAN>)
*
DEFINE WORK FILE 2 #CC-DAILY-TRAN
*
EXPAND ARRAY REJ-CC-CN TO (*:50)
READ WORK FILE 2 #INPUT
  SEPARATE #INPUT INTO #AT-NUMBER #CN-NUMBER #CC-NUMBER #CC-EXP-MONTH #CC-EXP-YEAR
    #CC-AMOUNT #USER #RESULT-CODE IGNORE WITH DELIMITER #TAB
  IF #RESULT-CODE <> #SUCCESSFUL
    #I := #I + 1
    REJ-CC-CN(#I) := #CN-NUMBER
  END-IF
END-WORK
RESIZE ARRAY REJ-CC-CN TO (*:#I)
*
END-IF
*
END
