* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
*
* Software AG use only
*
* WORK FILE coding to be used with ATHP05P0
*
* Written: USAPDI - SAG
* Date:    March 6, 2006
*
DEFINE WORK FILE 1 "/usr/SAG/AAFMAA/batch/workfiles/SYSDA/ATHJW/M05REXTR.TXT"
DEFINE WORK FILE 2 "/usr/SAG/AAFMAA/batch/workfiles/SYSDA/ATHJW/M05REXT2.TXT"
DEFINE WORK FILE 3 "/usr/SAG/AAFMAA/batch/workfiles/SYSDA/ATH/SUNGARD1.TXT"
DEFINE WORK FILE 4 "/usr/SAG/AAFMAA/batch/workfiles/SYSDA/ATHUF/DBCRFILE.TXT"
DEFINE WORK FILE 5 "/usr/SAG/AAFMAA/batch/workfiles/SYSDA/ATHJW/RPTEXTR.TXT"
DEFINE WORK FILE 6 "/usr/SAG/AAFMAA/batch/workfiles/SYSDA/ATHJW/SORTALLT.TXT"
DEFINE WORK FILE 7 "/usr/SAG/AAFMAA/batch/workfiles/SYSDA/ATHJW/PADFILE.TXTT"
DEFINE WORK FILE 8 "/usr/SAG/AAFMAA/batch/workfiles/SYSDA/ATHJW/PADAFSC.TXT"
DEFINE WORK FILE 9 "/usr/SAG/AAFMAA/batch/workfiles/SYSDA/ATHJW/PALLTRPT.TXT"
DEFINE WORK FILE 10 "/usr/SAG/AAFMAA/batch/workfiles/TEMP/ATHP05P0_DEBUG.TXT"
DEFINE WORK FILE 11 "/usr/SAG/AAFMAA/batch/workfiles/TEMP/REPORT_11.TXT"
*
* End of WORKFILE definition
*
