* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ATHPATLB - Daily AT processing  for labels to FTP to AAFM
*
************************************************************************
*                       MODIFICATION LOG                               *
* USER   DATE      TAG     REASON                                      *
*                                                                      *
* PAM    04082008  None    Program Written - One time use              *
************************************************************************
*
DEFINE DATA
LOCAL
*
1 AT-V VIEW OF A-APPL-TRACKING
 2 ID-NUMBER      (N6)
 2 NAME           (A25)
 2 AT-STATUS      (A2)
*
1 #CNT-1          (P5)
*
END-DEFINE
************************************************************************
*
READ AT-V BY ID-NUMBER
  IF AT-V.AT-STATUS NE 'SD'
    ESCAPE TOP
  ELSE
    ADD +1 TO #CNT-1
    DISPLAY #CNT-1
            AT-V.ID-NUMBER
            AT-V.AT-STATUS
  END-IF
END-READ
*
END
