* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM-ID: ZUPSTPST - to update STATUS file
*
DEFINE DATA
LOCAL
*
1 #COI     (N5.2)
1 #HAS-ASQM  (L)
1 #CLERK   (A3)
1 #INT     (I2)
1 #NOTE-TEXT   (A60/10)
1 #CN    (N6)
1 REDEFINE #CN
 2 #CN-A  (A6)
1 #ISSUE-DATE  (N8)
1 #ISSUE-DATE-DISP  (A10)
1 #OLD-FACE    (N5)
1 REDEFINE #OLD-FACE
 2 #OLD-2      (A2)
 2 #OLD-3      (A3)
1 #NEW-FACE    (N5)
1 #NEW-FACE-DISP (A7)
*
1 #START-KEY        (N15)
1 REDEFINE #START-KEY
  2 #START-ID       (N6)
  2 #START-ISSUE    (N8)
  2 #START-IND      (N1)
*
1 #END-KEY          (N15)
1 REDEFINE #END-KEY
  2 #END-ID         (N6)
  2 #END-ISSUE      (N8)
  2 #END-IND        (N1)
*
1 VA-V VIEW OF A-VA-HISTORY
 2 RECORD-KEY
 2 REDEFINE RECORD-KEY
  3 ID-NUM     (N6)
  3 ISS-DT     (N8)
 3 SPLT-IND   (N1)
 2 YEAR-MONTH-M    (13)
 2 COST-OF-INSURANCE-M (13)
*
1 ST-V VIEW OF A-STATUS
  2 ID-NUMBER      (N6)
* 2 WIDOW-FLAG          (A1)
* 2 OTHER-COMPANY-ID
* 2 REDEFINE OTHER-COMPANY-ID
*  3 OTHER-COMPANY-ID-A  (A6)
  2 PROCESS-IND
  2 INTRO-FLAG
* 2 PAD-CODE
* 2 X-BILL-ADJUST  (9)
* 2 DEBIT-CREDIT-AMT
* 2 MBR-SINCE
* 2 DATA-SHARED-IND
* 2 LOAN-AMOUNT
* 2 LOAN-DATE
* 2 X-LOAN-AMOUNT   (9)
* 2 X-LOAN-DATE     (9)
* 2 INTERNET-ADDR
* 2 PROCESS-IND
* 2 APPL-SOURCE         (A7)
* 2 REDEFINE APPL-SOURCE
*  3 APPL-SRC-3         (A3)
*  3 APPL-SRC-4         (A4)
* 2 STOP-DATE
* 2 MEMBERSHIP-DRIVE (A6)
* 2 REDEFINE MEMBERSHIP-DRIVE
*   3 PC-1 (A1)
*   3 PC-2 (A1)
*   3 PC-3 (A1)
*   3 PC-4 (A1)
*   3 PC-5 (A1)
*   3 PC-6 (A1)
* 2 FORMER-HUSBAND-SSN
* 2 FORMER-HUSBAND-NAME
* 2 FORMER-HUSBAND-DOD
* 2 FORMER-HUSBAND-RANK
* 2 SS-BENEFIT-AMT
* 2 SS-BENEFIT-STATUS
* 2 RANK                (A3)
* 2 SSN                 (P9)
* 2 SERVICE-DATE-1405   (N8)
* 2 BASE-PAY-EF-DATE    (N8)
* 2 ACTIVE-DUTY-BASE-DATE (N8)
* 2 MILITARY-STATUS     (A1)
* 2 MILITARY-SERVICE    (A3)
* 2 RETIRED-PAY-AMT
* 2 VA-DISABILITY-PCT
* 2 VA-DISABLE-DATE
* 2 DISABILITY-PCT
* 2 DATE-RETIRED        (N8)
* 2 REDEFINE DATE-RETIRED
*   3 DR-YYYY    (N4)
*   3 DR-MM      (N2)
*   3 DR-DD      (N2)
* 2 NAME         (A25)
* 2 HANDLE-FLAG  (A1)
* 2 S-ADDRESS-CODE (A1)
* 2 S-ADDRESS-1  (A25)
* 2 S-ADDRESS-2  (A25)
* 2 ADDRESS-1    (A25)
* 2 ADDRESS-2    (A25)
* 2 ADDRESS-3    (A25)
* 2 ZIP-CODE     (N9)
* 2 REDEFINE ZIP-CODE
*  3 ZIP-CODE-5  (N5)
*  3 ZIP-CODE-4  (N4)
* 2 NAME-SP             (A25)
* 2 BIRTH-CERT-CODE     (A1)
* 2 BIRTH-CERT-CODE-SP  (A1)
* 2 MARRIAGE-CERT-CODE  (A1)
* 2 ALT-LP-IND          (A1)
*   2 ALOT-AMT
* 2 DATE-ACCT-UPDATE
* 2 REDEFINE DATE-ACCT-UPDATE
*  3 DAU-YYYYMM         (N6)
*  3 DAU-DD             (N2)
* 2 ALT-LP-AMT          (P3.2)
* 2 LOAN-OWNERSHIP-FLAG (A1)
* 2 STATUS-CODE-SP       (A1)
* 2 FORMER-SPOUSE-STATUS (A1)
* 2 DATE-OF-DIVORCE      (N8)
* 2 FORMER-SPOUSE-DATE-OF-DIVORCE  (N8)
* 2 MIL-SBP-OPT         (A1)
* 2 MIL-SBP-AMT         (P5)
* 2 RETIRED-PAY-AMT     (P5)
* 2 DATE-OF-BIRTH       (N8)
* 2 REDEFINE DATE-OF-BIRTH
*  3 DOB-YYYY          (N4)
*  3 DOB-MM            (N2)
*  3 DOB-DD            (N2)
  2 MTD-ACV-COI-ADJ    (9)
* 2 NUMBER-MEMBERSHIPS
  2 SPLIT-IND           (N1/9)
  2 ISSUE-DATE          (N8/9)
* 2 REDEFINE ISSUE-DATE
*  3 ISSUE-DATE-OCC     (9)
*    4 ID-YYYY    (N4)
*    4 ID-MM      (N2)
*    4 ID-DD      (N2)
*
  2 MODE                (9)
  2 STATUS              (9)
  2 PLAN                (9)
  2 REDEFINE PLAN
   3 PLAN-OCC (9)
    4 PLAN-A1     (A1)
    4 PLAN-A2     (A2)
* 2 CONV-DURATION       (9)
* 2 MONTH-ALLOC-AMT     (9)
* 2 ANNUAL-PREM        (9)
* 2 MONTH-ALLOC-AMT     (9)
* 2 DEATH-BENEFIT       (9)
* 2 FACE-AMOUNT         (9)
* 2 CASH-VALUE          (9)
  2 PAY-STATUS          (9)
* 2 LAST-ANN-CASH-VALUE (9)
* 2 BEG-CASH-VALUE      (9)
* 2 CONVERSION-FLAG     (9)
* 2 ISSUE-AGE           (9)
* 2 NUM-MBRSHIPS        (P1/5)
* 2 PAID-TO-DATE        (N8/5)
* 2 OWNERSHIP-FLAG      (A1/5)
* 2 FIRS-LOCATION-CODE  (A1/5)
* 2 WHT-YEAR            (N4/2)
*
*
1 #COUNTERS
 2 #RECS-READ        (P5)
 2 #RECS-SELECTED    (P5)
 2 #CNT              (P5)
 2 #CNT-2            (P5)
 2 #CNT-3            (P5)
 2 #CNT-4            (P5)
 2 #CNT-5            (P5)
 2 #CNT-6            (P5)
 2 #I1               (I2)
 2 #TOT-UPD          (P7)
1 #UPDATE            (L)
1 #FND-REC           (L)
1 #SGLI      (P7)
*
1 #YYYYMMDD     (N8)
1 REDEFINE #YYYYMMDD
 2 #YYYY    (A4)
 2 #MM      (A2)
 2 #DD      (A2)
*
1 #AVL-TDIV   (N5.2)
1 #DB-AVL-TDIV   (N7.2)
1 #NUM-Q         (N5)
1 #FND-999      (L)
1 #OTHER-G-PREMS  (P5)
1 #NUM-POLS      (P5)
1 #FND-RT     (L)
1 #CAP-ISSUE-DATE  (N8)
1 #CAP-MONTH-ALLOC-AMT (N7.2)            /*TT1
1 #CAP-PAY-STATUS  (A1)
1 #CAP-PLAN        (A3)
1 #CAP-MODAL-PMT   (N5.2)
1 #PREM            (N5.2)
1 #CAP-X  (I2)
*
END-DEFINE
*
  FORMAT (2) LS=133 PS=76
  WRITE  (2) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
       'SPS/GEN G/F with BAD SVC-FEE adjustment'
                        5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
*   FORMAT (3) LS=133 PS=76
*   WRITE  (3) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
*        'Due for loan-pay-off-letter'
*                         5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
* FORMAT (4) LS=133 PS=76
* WRITE  (4) TITLE LEFT 'PROGRAM: ' *PROGRAM 5X
*      'AGR/FGR MEMBERS       '
*                       5X 'DATE: ' *DATN 5X 'TIME: ' *TIMX
*
*
MOVE 'EXPENSE COST HAS BEEN ADJUSTED BY $41.77' TO #NOTE-TEXT (1)
*
READ ST-V BY MEMBER-KEY FROM '096843'
* READ ST-V BY WIDOW-KEY FROM '000000'
* READ ST-V PHYSICAL
  IF ST-V.ID-NUMBER GE 600000
    END TRANSACTION
    ESCAPE BOTTOM
  END-IF
*
  IF NOT INTRO-FLAG = 'S' OR = 'K' OR = 'G'
   OR (PROCESS-IND NE 'G')
    END TRANSACTION
    ESCAPE TOP
  END-IF
*
  FOR #I1 1 TO 1    /* was 9
    IF   (STATUS (#I1) = 'D')
     AND (NOT PLAN (#I1) = 'LT' OR = 'RT')
     AND ((PLAN-A1 (#I1) LT 'U') OR (PLAN-A1 (#I1) GT 'Z'))
      MOVE ST-V.ID-NUMBER  TO #START-ID
      MOVE ISSUE-DATE (#I1) TO #START-ISSUE
      MOVE SPLIT-IND  (#I1) TO #START-IND
*
      RESET #COI
      FIND (1) VA-V WITH RECORD-KEY = #START-KEY
        IF NO RECORD FOUND
          WRITE ST-V.ID-NUMBER 'VA record not found'
        END-NOREC
*
        MOVE COST-OF-INSURANCE-M (13) TO #COI
      END-FIND
*
      ADD 1 TO #CNT-2
      DISPLAY (2) #CNT-2 ST-V.ID-NUMBER #I1
       'Issue/Date' ISSUE-DATE (#I1)
       'PROC/IND'   PROCESS-IND
       'Intr/Flag'  INTRO-FLAG
       'Plan'       PLAN (#I1)
       'COI/ADJ'    MTD-ACV-COI-ADJ (#I1)
       'COI'       #COI   (EM=-ZZ,ZZZ.99)
*
      MOVE TRUE TO #UPDATE
      SUBTRACT 41.77 FROM MTD-ACV-COI-ADJ (#I1)
      WRITE (2) 'new COI adjust =' MTD-ACV-COI-ADJ (#I1)
*
      MOVE 1 TO #INT
      MOVE 'EDS' TO #CLERK
      CALLNAT 'E4205SDM' ST-V.ID-NUMBER #INT #CLERK #NOTE-TEXT (1:10)
      WRITE (2) ST-V.ID-NUMBER 'NS'#NOTE-TEXT (1)
    #NOTE-TEXT (1)
    END-IF
  END-FOR
*
* IF #UPDATE
*   UPDATE (0231)
* END-IF
  END TRANSACTION
END-READ
*
END
