* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program ADHOC1.
/**
/** :author nguentchev
DEFINE DATA
LOCAL
1 RR-V VIEW OF A-RANK-REFERENCE
  2  RANK-ID
END-DEFINE
/* 
FIND RR-V WITH RANK-ID = 2900
  PRINT RR-V.RANK-ID
  RR-V.RANK-ID := 2900
  UPDATE
  END TRANSACTION
END-FIND
END
