* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA 
LOCAL USING OBJLLETT
LOCAL USING GPRL0EML
*   
LOCAL
1 #DATN (N8)
END-DEFINE
* 
#DATN := *DATN
FIND.
FIND LT-V WITH LAST-LOAD-DATE = #DATN
 IF IS-SENT = ' ' AND TEMPLATE-NAME = 'BDAY_EML' 
  P_TO     := 'ykegeles@aafmaa.com'
  P_CC     := 'ngorbatovskikh@aafmaa.com,yfayngersh@aafmaa.com'
  P_SUBJ   := '"Birthday Emails have not been sent"'
  P_MSG(1) := 'Error processing Birthday emails'
  CALLNAT 'GPRS0EML' p_EMAIL
  ESCAPE BOTTOM
 END-IF 
END-FIND
END
  
