* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL   
1 BA-V VIEW OF A-BANK-ACC-INFO
  2 ID-NUMBER
1 CC-V VIEW OF A-CC-INFO
  2 ID-NUMBER
  2 CC-DEFAULT-IND
1 #ISN (P9)  
*
END-DEFINE

* #ISN := 4347
* GET  BA-V #ISN
* DELETE
* END TRANSACTION
#ISN := 31989
GET  CC-V #ISN
CC-DEFAULT-IND := 'Y'
UPDATE
* DELETE
END TRANSACTION
END  
