DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 PARM-CN (N6)
1 PARM-MEMBER-CN (N6)
1 PARM-POLICIES (*)
  2 ID-NUMBER (N6)
  2 POLICY-INDEX (I2)
  2 POLICY-NUMBER (A16)
  2 POLICY-MODE (A1)
  2 POLICY-STATUS (A1)
  2 POLICY-PAY-STATUS (A2)
END-DEFINE
