* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
** OI-1582 OI-2307
** Assign W - E delivery. Term or (whole life) from 02/01/2014
*
* 11/25/14     02min:44sec:9 Upd= YES
*
* Skiped
* Memberships =0             58465
* Not Term before  20140201  55998
* Web acc already W          55622
* Duplicate attempt            207
* Web acc aready M            7609
* New Web acc with W          5506
* Upd Web acc to W               1
* New WL or Term             68738

* ---------------------------------------------------------------------------------------
DEFINE DATA
LOCAL USING OBJLWEBU
LOCAL
1 ST-V VIEW OF A-STATUS
  2 ID-NUMBER
  2 MEMBER-CONTACT-ID
  2 NUMBER-MEMBERSHIPS
  2 C*ACTIVE-SEGMENTS
  2 ACTIVE-SEGMENTS(9)
    3 STATUS
    3 PLAN
    3 ISSUE-DATE
*
1 #w                (I2)
1 #i                (I2)
1 #j                (I2)
1 v_CN              (N6)
* - - - - - - - - - - - - - - - - - -
END-DEFINE

ON ERROR
  WRITE  *PROGRAM "Err-ln:" *ERROR-LINE "Err:" *ERROR-NR / ST-V.ID-NUMBER #i
  ESCAPE ROUTINE
END-ERROR
*
SETA. SETTIME
READ ST-V BY ID-NUMBER  FROM 1900
  IF  NUMBER-MEMBERSHIPS = 0
    ESCAPE TOP
  END-IF
  v_CN     := ID-NUMBER
  PERFORM sbr_Web
END-READ
IF #j <> 0
  END TRANSACTION
END-IF
write #w
*
* ====================================================================================
DEFINE sbr_WEB
FWEB.
FIND(1) WEB-ACCOUNT-INFO WITH MEMBER-CN = v_CN
  IF NO RECORD FOUND
    RESET WEB-ACCOUNT-INFO
    MEMBER-CN := v_CN
    DATE-CREATED       := *DATN
    DATE-MODIFIED      := 0
    STORE WEB-ACCOUNT-INFO
    #j := #j + 1
    #w := #w + 1
    ESCAPE BOTTOM
  END-NOREC
END-FIND
IF #j > 200
  END TRANSACTION
  #j := 0
END-IF
END-SUBROUTINE
*
END
