* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Web Application Online
* Member Information module
*
********************************************************
*        MODIFICATION LOG
********************************************************
* USER   DATE      TAG  REASON
* YAK    03092009       Initial Creation
********************************************************
*
* DEFINE DATA PARAMETER
*
define data
*
LOCAL USING PARSER-X
LOCAL USING GPRA0003
LOCAL
1 PROCESS-NAME      (A) DYNAMIC
1 REQUEST-DATA      (A) DYNAMIC
1 RESPONSE-DATA     (A) DYNAMIC       /* Out
1 RETURN-MESSAGE    (A78)
*
* 1 POLICY-NUMBER (A) DYNAMIC
* 1 MEMBER-CN     (A) DYNAMIC
* 1 OWNER-CN      (A) DYNAMIC
1 RequestInfo
  2 PolicyNumber  (A16)
  2 SSN4          (A4)
*
LOCAL
1 XML_PARSER_XPATH             (A) DYNAMIC
1 XML_PARSER_XPATH_TYPE        (A1)
1 XML_PARSER_CONTENT           (A) DYNAMIC
1 XML_PARSER_CONTENT_IS_EMPTY  (L)
1 XML_PARSER_INPUT   (A) DYNAMIC
1 XML_PARSER_ERROR_TEXT        (A253)
1 XML_PARSER_RESPONSE          (I2)
*
END-DEFINE
*
* EDS PERM ADDR. 6710 BETHLEHEM RD RICHMOND VA 23230
* EDS (804-266-6261) LOAN TO AFB
* into request-data leaving no
*
RESET RESPONSE-DATA
COMPRESS
* RegisterMember
* '<MemberLogin>'
* * '<UserName>yk9812</UserName>'
* '<CN>118368</CN>'
* '<OrganizationFlag>true</OrganizationFlag>'
* '<LastName>Owen</LastName>'
* '<TrustCompanyEntityName>SPARANO TRUST</TrustCompanyEntityName>'
* '<TINLast4>0128</TINLast4>'
*  '<DateOfBirth>19560211</DateOfBirth>'
*  '<SSNLast4>3273</SSNLast4>'
* '<Password>+QUCS9lsdwiBAJ/YeyLdjWgxWVByMSolHNP6N/aGG8U=</Password>'
* '<SecurityQuestions>'
* '<SecurityQuestion>'
* '<Key>1</Key>'
* '<Answer>bla1</Answer>'
* '</SecurityQuestion>'
* '<SecurityQuestion>'
* '<Key>2</Key>'
* '<Answer>bla2</Answer>'
* '</SecurityQuestion>'
* '<SecurityQuestion>'
* '<Key>3</Key>'
* '<Answer>bla3</Answer>'
* '</SecurityQuestion>'
* '</SecurityQuestions>'
* '</MemberLogin>'
*
* CheckUserID 
* '<MemberLogin>'
* '<UserName>yk9812</UserName>'
* '</MemberLogin>'
*
* MemberLogin
* '<MemberLogin>'
* '<CN>112056</CN>'
* '<CN>10201</CN>' 
* '<UserName>test1</UserName>'
* '<Password>fgvVlI+W1ITB1cRhvXSs4AyudLqWBYpJcsYjOSdJpE4=</Password>'
* '<Password>+QUCS9lsdwiBAJ/YeyLdjWgxWVByMSolHNP6N/aGG8U=</Password>'
* '</MemberLogin>'
* '<Password>xxxxx9lsdwiBAJ/YeyLdjWgxWVByMSolHNP6N/aGG8U=</Password>'
* '<MemberLogin>'
*   '<ActionType>0</ActionType>'
*   '<ErrorCode>0</ErrorCode>'
*   '<UserName>test6</UserName>'
*   '<Password>47DEQpj8HBSa+/TImW+5JCeuQeRkm5NMpJWZG3hSuFU=</Password>'
*   '<CN>118368</CN>'
*   '<OrganizationFlag>false</OrganizationFlag>'
*   '<TrustCompanyEntityName>sparano trust</TrustCompanyEntityName>'
*   '<TINLast4>0128</TINLast4>'
*   '<SecurityQuestions>'
*     '<SecurityQuestion>'
*       '<Key>001</Key>'
*       '<Answer>test</Answer>'
*     '</SecurityQuestion>'
*     '<SecurityQuestion>'
*       '<Key>008</Key>'
*       '<Answer>test</Answer>'
*     '</SecurityQuestion>'
*     '<SecurityQuestion>'
*       '<Key>015</Key>'
*       '<Answer>test</Answer>'
*     '</SecurityQuestion>'
*   '</SecurityQuestions>'
* '</MemberLogin>'
*
'<MemberLogin>'
  '<CN>82384</CN>'
  '<UserName></UserName>'
* '<Password>+QUCS9lsdwiBAJ/YeyLdjWgxWVByMSolHNP6N/aGG8U=</Password>'
  '<Password>iEzlYcBZydMb5Vv39mfoysRUh0ZGsD/xyWfI24yq8Jg=</Password>'
  '<OrganizationFlag>false</OrganizationFlag>'
  '<SecurityQuestions />'
'</MemberLogin>'
*
* '<MemberLogin>'
*   '<ActionType>0</ActionType>'
*   '<ErrorCode>0</ErrorCode>'
*   '<UserName>cgross4238</UserName>'
*   '<Password>TdCxKVEvd7pWLbunFr9Vtm6K/IPt1VHZ9n4TsPplB/w=</Password>'
*   '<OrganizationFlag>false</OrganizationFlag>'
*   '<SecurityQuestions />'
*   '<PaperlessOptions>'
*     '<ActionType>0</ActionType>'
*     '<ErrorCode>0</ErrorCode>'
*   '</PaperlessOptions>'
* '</MemberLogin>'
*  
* '<MemberLogin>'
*   '<CN>10201</CN>'
*   '<SecurityQuestions>'
*     '<SecurityQuestion>'
*       '<Key>001</Key>'
*       '<Answer>test</Answer>'
*     '</SecurityQuestion>'
*     '<SecurityQuestion>'
*       '<Key>008</Key>'
*       '<Answer>test</Answer>'
*     '</SecurityQuestion>'
*     '<SecurityQuestion>'
*       '<Key>015</Key>'
*       '<Answer>test</Answer>'
*     '</SecurityQuestion>'
*   '</SecurityQuestions>'
* '</MemberLogin>'
*
* '<MemberLogin>'
*   '<OrganizationFlag>false</OrganizationFlag>'
*   '<LastName>tripp</LastName>'
*   '<DateOfBirth>19111019</DateOfBirth>'
*   '<SSNLast4>8525</SSNLast4>'
*   '<SecurityQuestions />'
* '</MemberLogin>'
* '<MemberLogin>'
*   '<CN>12367</CN>'
*   '<OrganizationFlag>false</OrganizationFlag>'
*   '<LastName>degruchy</LastName>'
*   '<DateOfBirth>20141106</DateOfBirth>'
*   '<SSNLast4>5303</SSNLast4>'
*   '<SecurityQuestions />'
* '</MemberLogin>'
* '<MemberLogin>'
*   '<CN>10201</CN>'
*   '<PaperlessOptions>'
*   '<BillDeliveryFlag>M</BillDeliveryFlag>'
*   '<AnnsDeliveryFlag>M</AnnsDeliveryFlag>'
*   '</PaperlessOptions>'
* '</MemberLogin>'
* Organization
* '<MemberLogin>'
*   '<CN>59771</CN>'
*   '<OrganizationFlag>false</OrganizationFlag>'
* '</MemberLogin>'
* person
* '<MemberLogin>'
*   '<OrganizationFlag>false</OrganizationFlag>'
*   '<LastName>sears</LastName>'
*   '<DateOfBirth>19160123</DateOfBirth>'
*   '<SSNLast4>4068</SSNLast4>'
* '</MemberLogin>'
* '<MemberLogin>'
*   '<ActionType>0</ActionType>'
*   '<ErrorCode>0</ErrorCode>'
*   '<OrganizationFlag>false</OrganizationFlag>'
*   '<LastName>patterson</LastName>'
*   '<DateOfBirth>19831012</DateOfBirth>'
*   '<SSNLast4>4925</SSNLast4>'
*   '<SecurityQuestions />'
*   '<PaperlessOptions>'
*     '<ActionType>0</ActionType>'
*     '<ErrorCode>0</ErrorCode>'
*   '</PaperlessOptions>'
* '</MemberLogin>'
'<MemberLogin>'
  '<ActionType>0</ActionType>'
  '<ErrorCode>0</ErrorCode>'
  '<CN>82384</CN>'
  '<OrganizationFlag>false</OrganizationFlag>'
  '<SecurityQuestions />'
  '<PaperlessOptions>'
    '<ActionType>0</ActionType>'
    '<ErrorCode>0</ErrorCode>'
  '</PaperlessOptions>'
'</MemberLogin>'
INTO REQUEST-DATA LEAVING NO
*
* PROCESS-NAME := 'CheckUserID'
  PROCESS-NAME := 'MemberLogin'
* PROCESS-NAME := 'UpdatePassword'
* PROCESS-NAME := 'RegisterMember'
* PROCESS-NAME := 'VerifyMemberInfo'
* PROCESS-NAME := 'CheckIsRegistered' 
* PROCESS-NAME := 'GetAccountInformation'
* PROCESS-NAME := 'UpdateSecurityQuestions'
* PROCESS-NAME := 'UpdatePaperlessOptions'
*
CALLNAT 'NATSERV0' PROCESS-NAME REQUEST-DATA RESPONSE-DATA
repeat
RETURN-MESSAGE := RESPONSE-DATA
WRITE RETURN-MESSAGE
if *length(response-data) > 78
 response-data := substr(response-data,79)
else
  escape bottom
end-if
end-repeat
END
