* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Web Application Online
* Member Information module
*
********************************************************
*        MODIFICATION LOG
********************************************************
* USER   DATE      TAG  REASON
* YAK    03092009       Initial Creation
********************************************************
*
* DEFINE DATA PARAMETER
*
define data
*
LOCAL USING PARSER-X
LOCAL USING GPRA0003
LOCAL
1 PROCESS-NAME      (A) DYNAMIC
1 REQUEST-DATA      (A) DYNAMIC
1 RESPONSE-DATA     (A) DYNAMIC       /* Out
1 RETURN-MESSAGE    (A78)
*
1 #LOG-FILE         (A) Dynamic INIT <'/usr/SAG/tmp/natserv0_224_'>
1 #FIR-REQUEST-FILE (A) Dynamic INIT <'/usr/SAG/MC/FIR_REQUEST.TXT'>
1 #FIR-REPORT-FILE  (A) Dynamic INIT <'/usr/SAG/MC/FIR_REPORT.TXT'>
1 #FAS-REPORT-FILE  (A) Dynamic INIT <'/usr/SAG/MC/FAS_REPORT.TXT'>
END-DEFINE
*
DEFINE WORK FILE 1 #LOG-FILE TYPE 'ASCII-COMPRESSED' ATTRIBUTES 'APPEND'
DEFINE WORK FILE 2 #FIR-REQUEST-FILE TYPE 'ASCII-COMPRESSED' ATTRIBUTES 'APPEND'
DEFINE WORK FILE 3 #FIR-REPORT-FILE TYPE 'ASCII-COMPRESSED' ATTRIBUTES 'APPEND'
DEFINE WORK FILE 4 #FAS-REPORT-FILE TYPE 'ASCII-COMPRESSED' ATTRIBUTES 'APPEND'
RESET RESPONSE-DATA
COMPRESS

'<MilitaryInfo>'
  '<ActionType>2</ActionType>'
  '<ErrorCode>0</ErrorCode>'
  '<CN>145020</CN>'
  '<MilitaryRankID>280</MilitaryRankID>'
  '<MilitaryStatus>A</MilitaryStatus>'
  '<MilitaryBranch>AR</MilitaryBranch>'
  '<DateOfRetirement>0</DateOfRetirement>'
  '<CurrentPromotionDate>0</CurrentPromotionDate>'
  '<PreviousPromotionDate>0</PreviousPromotionDate>'
  '<PEBDate>0</PEBDate>'
  '<BASDDate>0</BASDDate>'
  '<DateInitEntryMilService>19780513</DateInitEntryMilService>'
  '<RNGDate20YearLetter>19980610</RNGDate20YearLetter>'
  '<RSVRetDate>0</RSVRetDate>'
  '<RSVRetPoints>5000+</RSVRetPoints>'
  '<OldMilitaryRankID>280</OldMilitaryRankID>'
'</MilitaryInfo>'

INTO REQUEST-DATA LEAVING NO
*
* PROCESS-NAME := 'ManageMilitaryInfo'
*
* CALLNAT 'NATSERV0' PROCESS-NAME REQUEST-DATA RESPONSE-DATA
  CALLNAT 'MBCN0020' REQUEST-DATA RESPONSE-DATA
repeat
RETURN-MESSAGE := RESPONSE-DATA
WRITE RETURN-MESSAGE
if *length(response-data) > 78
 response-data := substr(response-data,79)
else
  escape bottom
end-if
end-repeat
END
