DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 Fir_Sync
  2 ActionType (A) DYNAMIC
  2 CN (N6)
  2 ContactID (N8)
  2 SystemSource (A) DYNAMIC
  2 SSN (N9)
  2 DateOfBirth (N8)
  2 GenderCode (A1)
  2 RelationshipCode (A1)
  2 DependentStatusCode (A1)
  2 FullName
    3 LastName (A25)
    3 FirstName (A25)
    3 MiddleName (A25)
    3 Suffix (A10)
END-DEFINE
