DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
* /* Policy Data
1 BENEFICIARY-INFORMATION
  2 CN (N6.0)
  2 CONTACT-ID (N8)
  2 POL-SEG (N2)
  2 MESSAGE (A) DYNAMIC
  2 BEN-COMPLETED (L)
  2 C@BENEFICIARY-LINE (N2.0)
  2 BENEFICIARY-LINE (A/1:20) DYNAMIC
END-DEFINE
