DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 #FamilyInformation
  2 CN (N6)
  2 ContactID (N8)
  2 FullName
    3 FirstName (A) DYNAMIC
    3 LastName (A) DYNAMIC
  2 SSN (N9)
  2 RelationshipCode (A) DYNAMIC
  2 DateOfBirth (N8)
END-DEFINE
