DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 PayRequest
  2 CN (N6)
  2 RequestorCN (N6)
  2 UserId (A) DYNAMIC
  2 ProcessType (A) DYNAMIC
  2 RequestData (A) DYNAMIC
  2 RequestType (A) DYNAMIC
  2 RequestStatus (A) DYNAMIC
  2 RequestDate (A) DYNAMIC
  2 PaymentDate (A) DYNAMIC
  2 PayPolicyNumber (A) DYNAMIC
  2 PaymentAmount (A) DYNAMIC
END-DEFINE
