DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 FirPages
  2 CN (N6)
  2 C@Pages (N2)
  2 Pages_group (1:*)
    3 Header (A) DYNAMIC
    3 C@Lines (N2)
    3 Lines (A/1:*) DYNAMIC
    3 Footer (A) DYNAMIC
END-DEFINE
