DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 AddressRelInfo
  2 CN (N6)
  2 ContactID (N8)
  2 UserID (A) DYNAMIC
  2 ActionType (A) DYNAMIC
  2 SystemSource (A) DYNAMIC
  2 C@AddressRel (N2)
  2 AddressRelArray (*)
    3 AddressPoolId (N8)
    3 AddressTypeCode (A1)
END-DEFINE
