DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 BA_Lines
  2 #Pages (N2)
  2 #Lines (N3)
  2 MC_Lines (A79/200)
END-DEFINE
