DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 MemberProfilePayment
  2 CN (N6)
  2 PaymentInformation
    3 PolicyNumber (A) DYNAMIC
    3 DueDate (A) DYNAMIC
    3 DueAmount (A) DYNAMIC
    3 PastDue (A) DYNAMIC
END-DEFINE
