DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
1 ERROR-QUEUE-V VIEW OF A-ERROR-QUEUE
  2 MEMBER-CN (N6)
  2 ERROR-STATUS (A1)
  2 ERROR-TYPE (A10)
  2 PROCESS-NAME (A35)
  2 REQUEST-LINE (A250/1:100)
  2 C*REQUEST-LINE (N3)
  2 RESPONSE-LINE (A250/1:100)
  2 C*RESPONSE-LINE (N3)
END-DEFINE
