* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA 
LOCAL USING OBJLPRST
END-DEFINE
*
* FIND PAY-REQUEST-V WITH PAYMENT-DATE-STATUS = '20160729S'
FIND PAY-REQUEST-V WITH ID-NUMBER = 115952   /* PAYMENT-DATE-STATUS = '20160729S'
 ACCEPT IF PAYMENT-DATE = 20160801
  WRITE ID-NUMBER PAYMENT-AMOUNT
  REQUEST-STATUS := 'S'
  PAYMENT-DATE := 20160802
  UPDATE
  END TRANSACTION
END-FIND
*
END
