* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* PROGRAM ID: T-23A
* Get Web Account details
DEFINE DATA
PARAMETER
1 p_T-21 
  2 p_CN (N6)
  2 p_Out  (A/*) DYNAMIC
LOCAL
* ----------------------------------------------- Contact
1 CNT-V VIEW OF A-CONTACTS
  2  ID-NUMBER                  (N6.0)   /*  D 
  2  FULL-NAME                                     
   3  FIRST-NAME                (A25)    /*  N   
   3  MIDDLE-NAME               (A25)    /*  N   
   3  LAST-NAME                 (A25)    /*  N   
   3  SUFFIX                    (A10)    /*  N   
  2  DATE-OF-BIRTH              (N8)     /*  N D 
  2  SSN                        (N9)     /*  N D 
*
 1 WEB-V VIEW OF A-WEB-ACCOUNT-INFO
   2 MEMBER-CN                  (N6)
   2 WEB-USER-NAME              (A50)
   2 WEB-USER-PASSWORD          (A50)
   2 USER-PASSWORD-ARRAY        (A50/1:4) /*MU-FIELD
   2 SECURITY-Q-A        (1:3)            /*PE
     3 SECURITY-QUESTION        (A3)
     3 SECURITY-ANSWER          (A100)
   2 FAILED-LOGIN-ATTEMPTS      (N1)
   2 TEMP-PASSWORD-FLAG         (A1)
   2 LEGACY-USER                (A1)
   2 AGGREEMENT-TERMS-CONDITIONS (A1)
   2 REGISTERED-FLAG            (A1)   
   2 NEWS-LETTER                (A1)
   2 BILL-DELIVERY-FLAG         (A1) 
   2 ANNS-DELIVERY-FLAG         (A1)
   2 NO-FAMILY-FLAG             (A1)
   2 DAL-ACCESS-DATE            (N8)
   2 PROFILE-UPDATE-DATE        (N8)
   2 DATE-CREATED               (N8)
   2 DATE-MODIFIED              (N8)

1 #i         (N1)
1 #x         (I2)
1 v_A        (A)  DYNAMIC
1 v_AA       (A)  DYNAMIC
1 A10        (A10)
1 A11        (A11)  
1 #br        (A5) INIT <'</br>'>
END-DEFINE
* ON ERROR
*   COMPRESS "CN:" ID-NUMBER "Pgm:" *PROGRAM "Err-ln:" *ERROR-LINE "Err:" *ERROR-NR INTO v_A
*   PERFORM sbr_ADD
*   ESCAPE ROUTINE
* END-ERROR
*
 FIND(1) WEB-V WITH MEMBER-CN = p_CN
    IF NO RECORD FOUND
       COMPRESS 'No Web account records for' p_CN INTO v_A
       PERFORM sbr_ADD
       ESCAPE BOTTOM
    END-NOREC
    FIND CNT-V WITH ID-NUMBER = p_CN END-FIND
   v_A := '<pre>' 
   PERFORM sbr_ADD
   MOVE EDITED  CNT-V.DATE-OF-BIRTH(EM=9999-99-99)  TO A10
   MOVE EDITED  CNT-V.SSN (EM=999-99-9999)          TO A11
   COMPRESS   'CN:'  MEMBER-CN   'DOB:' A10 'SSN:' A11 #br INTO v_A
   PERFORM sbr_ADD
   COMPRESS 'User-Name: ['  WEB-USER-NAME ']' INTO v_A LEAVING NO SPACE
   PERFORM sbr_ADD 

   IF WEB-USER-PASSWORD <> ' ' v_AA := 'Entered, not shown' ELSE v_AA := 'Blank' END-IF
      COMPRESS 'Password:' v_AA #br INTO v_A

   PERFORM sbr_ADD
   FOR #i = 1 TO 4
     IF USER-PASSWORD-ARRAY(#i) <> ' '  v_AA := 'Entered' ELSE v_AA := 'Blank' END-IF
       COMPRESS FULL 'Password-' #i ' ' v_AA INTO v_A LEAVING NO SPACE
       PERFORM sbr_ADD

   END-FOR  
   COMPRESS 'Sec.Q-1' SECURITY-QUESTION(1) '-' SECURITY-ANSWER(1) INTO v_A
   PERFORM sbr_ADD
   COMPRESS 'Sec.Q-2' SECURITY-QUESTION(2) '-' SECURITY-ANSWER(2) INTO v_A 
   PERFORM sbr_ADD
   COMPRESS 'Sec.Q-3' SECURITY-QUESTION(3) '-' SECURITY-ANSWER(3) INTO v_A 
   PERFORM sbr_ADD
   COMPRESS 'Login Attempts:'  FAILED-LOGIN-ATTEMPTS 'Temp password flag:' TEMP-PASSWORD-FLAG #br INTO v_A
   PERFORM sbr_ADD
   COMPRESS 'Legacy user:' LEGACY-USER  INTO v_A
   PERFORM sbr_ADD
   COMPRESS 'Aggreement term conditions:' AGGREEMENT-TERMS-CONDITIONS #br INTO v_A
   PERFORM sbr_ADD

   COMPRESS 'Registered flag:'  REGISTERED-FLAG INTO v_A
   PERFORM sbr_ADD
   COMPRESS 'No family flag:'  NO-FAMILY-FLAG INTO v_A
   PERFORM sbr_ADD
   COMPRESS 'Dal access date:'  DAL-ACCESS-DATE INTO v_A
   PERFORM sbr_ADD
   COMPRESS 'Profile update date:' PROFILE-UPDATE-DATE #br INTO v_A
   PERFORM sbr_ADD
   COMPRESS 'News Letter:' NEWS-LETTER  INTO v_A
   PERFORM sbr_ADD
   COMPRESS 'Annual statments delivery flag:' ANNS-DELIVERY-FLAG  INTO v_A
   PERFORM sbr_ADD
   COMPRESS 'Bill delivery flag:' BILL-DELIVERY-FLAG  #br INTO v_A
   PERFORM sbr_ADD
   MOVE EDITED DATE-CREATED (EM=9999-99-99) TO A10
   COMPRESS 'Date Created :' A10 INTO v_A
   PERFORM sbr_ADD
   MOVE EDITED  DATE-MODIFIED(EM=9999-99-99) TO A10
   COMPRESS v_A 'Date Modified:' A10 #br INTO v_A
   PERFORM sbr_ADD
   v_A := '<pre>' 
   PERFORM sbr_ADD
END-FIND

* = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =
DEFINE sbr_ADD
  #x:= #x + 1
  EXPAND ARRAY p_Out TO (1:#x)
  COMPRESS v_A INTO p_Out(#x) 
  v_A := ' '                      
END-SUBROUTINE
* = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =
END
