* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Interface to schema subprogram T-21A
*
DEFINE DATA
 PARAMETER
1 r_ID            (A) Dynamic
1 r_IN            (A) Dynamic
1 r_OUT           (A) Dynamic       
*
LOCAL
1 f_Name       (A) DYNAMIC  INIT <'/usr/SAG/AAFMAA/batch/workfiles/WORK/out.txt'> 
1 shell        (A) DYNAMIC
1 v_A200       (A200)
1 #x (N3) 
1 #i (N4)   
************  
END-DEFINE
*
  
COMPRESS r_IN '>' f_Name  INTO shell

 CALL 'shcmd' shell 
 IF RET('shcmd') <> 0  
   #x := RET('shcmd') 
   COMPRESS *Program ' Shell error' #x ':' shell INTO r_OUT
   ESCAPE ROUTINE
 END-IF    
 
 DEFINE WORK FILE 1 f_Name
 READ WORK 1 v_A200 
    shell := v_A200
    #i := #i + 1 
    COMPRESS r_OUT '<br/>' shell INTO r_OUT
 END-WORK
 COMPRESS 'Result:'  r_ID 'Lines:' #i '<br/>' r_OUT INTO r_OUT
*
END
