* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL
1 #PRICE (N5.3)
1 #UNITS (P6.3)
1 #BALANCE (N7)
END-DEFINE
#PRICE := 68.460
#UNITS := 463.854
COMPUTE ROUNDED #BALANCE := #PRICE * #UNITS
WRITE #BALANCE
END
