* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* TEST-ESPS CALL SEQUENCE - STEPLIB
DEFINE DATA
LOCAL
1 USR1025L
     2 ACTION        (A1)       INIT<'D'>
     2 STEPLIB-ID    (A8/1:8)  
     2 DBID          (N5/1:8)  
     2 FNR           (N5/1:8)  
     2 PASSWORD      (A8)      
     2 CIPHERCODE    (N8)      
     2 POSIT         (N1)      
     2 SV-STEPLIB    (A8)      
     2 SV-DBID       (N5)      
     2 SV-FNR        (N5)      
     2 NUMBER-ACTIVE (N1)      
     2 RESPONSE      (N4)      
     2 INFOTEXT      (A65)     
1 v_Text  (A) DYNAMIC
1 n1      (A1)      INIT<H'0A'>
END-DEFINE
CALLNAT 'USR1025N'  USR1025L
WRITE WORK FILE 1 
     '     STEPLIB  NAME     DBID    FNR' n1 
     '     --------------    ----    ---' n1
     '1.' STEPLIB-ID(1) DBID(1) FNR(1) n1
     '2.' STEPLIB-ID(2) DBID(2) FNR(2) n1
     '3.' STEPLIB-ID(3) DBID(3) FNR(3) n1
     '4.' STEPLIB-ID(4) DBID(4) FNR(4) n1
     '5.' STEPLIB-ID(5) DBID(5) FNR(5) n1
     '6.' STEPLIB-ID(6) DBID(6) FNR(6) n1
     '7.' STEPLIB-ID(7) DBID(7) FNR(7) n1
     '8.' STEPLIB-ID(8) DBID(8) FNR(8) n1
     '*STEPLIB  ' SV-STEPLIB SV-DBID  SV-FNR
END
