* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
**
* ---------------------------------------------------------------------------------------
DEFINE DATA
LOCAL USING OBJLWEBU
*
END-DEFINE

*
FIND WEB-ACCOUNT-INFO WITH MEMBER-CN = 0
  WRITE #ISN
END-FIND  
* DELETE
* END TRANSACTION
*
END
