* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* Web Application Online
* Member Information module
*
********************************************************
*        MODIFICATION LOG
********************************************************
* USER   DATE      TAG  REASON
* YAK    03092009       Initial Creation
********************************************************
*
* DEFINE DATA PARAMETER
*
define data
*
LOCAL USING PARSER-X
LOCAL USING GPRA0003
LOCAL
1 PROCESS-NAME      (A) DYNAMIC
1 REQUEST-DATA      (A) DYNAMIC
1 RESPONSE-DATA     (A) DYNAMIC       /* Out
1 RETURN-MESSAGE    (A78)
*
END-DEFINE
*
RESET RESPONSE-DATA
COMPRESS
'<MCMemberInfo>'
  '<ActionType>0</ActionType>'
  '<ErrorCode>0</ErrorCode>'
  '<CN>87812</CN>'
  '<ContactID>0</ContactID>'
  '<AddressPoolID>0</AddressPoolID>'
  '<AnnualReportMailingCode>F</AnnualReportMailingCode>'
  '<FullName> </FullName>'
  '<FullNameWithSuffix> </FullNameWithSuffix>'
  '<SSN>0</SSN>'
  '<DateOfBirth>0</DateOfBirth>'
  '<DateOfDeath>0</DateOfDeath>'
  '<DateCreated>0</DateCreated>'
  '<DateModified>0</DateModified>'
  '<IsLegacy>false</IsLegacy>'
  '<TempPassword>false</TempPassword>'
  '<SendNews>false</SendNews>'
  '<AgreeOnPolicy>false</AgreeOnPolicy>'
  '<CurrentSpouseDateOfDivorce>0</CurrentSpouseDateOfDivorce>'
  '<CurrentSpouseDateOfMarriage>0</CurrentSpouseDateOfMarriage>'
  '<FormerSpouseDateOfDivorce>0</FormerSpouseDateOfDivorce>'
  '<FormerSpouseDateOfMarriage>0</FormerSpouseDateOfMarriage>'
  '<MembershipDate>0</MembershipDate>'
  '<IsMember>false</IsMember>'
  '<IsOwner>false</IsOwner>'
  '<IsNotRegistered>false</IsNotRegistered>'
  '<PaperlessOptions>'
    '<ActionType>0</ActionType>'
    '<ErrorCode>0</ErrorCode>'
  '</PaperlessOptions>'
  '<SecurityQuestions />'
'</MCMemberInfo>'
*
INTO REQUEST-DATA LEAVING NO
*
 PROCESS-NAME := 'UpdateAnnRptFlag'
*
CALLNAT 'NATSERV0' PROCESS-NAME REQUEST-DATA RESPONSE-DATA
repeat
RETURN-MESSAGE := RESPONSE-DATA
WRITE RETURN-MESSAGE
if *length(response-data) > 78
 response-data := substr(response-data,79)
else
  escape bottom
end-if
end-repeat
END
