* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL USING OBJLWEBU
LOCAL
1 K  (I4)
1 J  (I4)
1 #DATN (N8)
END-DEFINE
*
#DATN := *DATN
RWA.
FIND WEB-ACCOUNT-INFO WITH MEMBER-CN = 143469  
  WRITE WEB-USER-NAME MEMBER-CN
END-FIND
WRITE 'END'
END
