* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL USING OBJLWEBU
LOCAL
1 K  (I4)
1 J  (I4)
1 #DATN (N8)
END-DEFINE
*
#DATN := *DATN
RWA.
FIND WEB-ACCOUNT-INFO WITH MEMBER-CN = 119693  
  RESET WEB-USER-NAME FAILED-LOGIN-ATTEMPTS TEMP-PASSWORD-FLAG
  RESET LEGACY-USER
  RESET SECURITY-QUESTION(*) SECURITY-ANSWER (*)
  RESET REGISTERED-FLAG
  RESET ANNS-DELIVERY-FLAG BILL-DELIVERY-FLAG 
        DATE-MODIFIED NO-FAMILY-FLAG DAL-ACCESS-DATE PROFILE-UPDATE-DATE 
  DATE-CREATED := *DATN
  UPDATE
  END TRANSACTION
END-FIND
WRITE 'END'
END
