DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP ISO_8859-1:1987
/* <Natural Source Header
/*  /** New Local Data Area ATHISAL2.
/*  /**
/*  /** :author nguentchev
/*  /* TODO Enter your data definitions here
 1 #A (F8/1:100)
   INIT
   <
   0.15484786E-0,
   0.15900353E-0,
   0.16370543E-0,
   0.16880231E-0,
   0.17419588E-0,
   0.17981075E-0,
   0.18562414E-0,
   0.19162456E-0,
   0.19783745E-0,
   0.20426805E-0,
   0.2108998E-0,
   0.21772016E-0,
   0.22467683E-0,
   0.23174058E-0,
   0.23889482E-0,
   0.24598497E-0,
   0.25305086E-0,
   0.26006965E-0,
   0.26702097E-0,
   0.27401209E-0,
   0.28110417E-0,
   0.28833108E-0,
   0.29570877E-0,
   0.30324318E-0,
   0.31093281E-0,
   0.31876143E-0,
   0.32674212E-0,
   0.33488857E-0,
   0.34327554E-0,
   0.3520016E-0,
   0.36109306E-0,
   0.37055129E-0,
   0.38036197E-0,
   0.39049957E-0,
   0.40094045E-0,
   0.41168685E-0,
   0.42271999E-0,
   0.43400969E-0,
   0.44552955E-0,
   0.45725905E-0,
   0.46918723E-0,
   0.48126778E-0,
   0.49344948E-0,
   0.5056848E-0,
   0.51792199E-0,
   0.53013971E-0,
   0.54238153E-0,
   0.55469028E-0,
   0.5671782E-0,
   0.57993498E-0,
   0.59288756E-0,
   0.60594727E-0,
   0.61900684E-0,
   0.6319611E-0,
   0.64471908E-0,
   0.65720011E-0,
   0.66941741E-0,
   0.68142332E-0,
   0.69332774E-0,
   0.70517265E-0,
   0.71684398E-0,
   0.72819228E-0,
   0.73907772E-0,
   0.74943096E-0,
   0.75928029E-0,
   0.76872088E-0,
   0.77786702E-0,
   0.78682805E-0,
   0.79566381E-0,
   0.80440029E-0,
   0.81297277E-0,
   0.82127155E-0,
   0.82920261E-0,
   0.83674695E-0,
   0.84395495E-0,
   0.85081284E-0,
   0.85726928E-0,
   0.86324576E-0,
   0.86866104E-0,
   0.87346573E-0,
   0.87765859E-0,
   0.8812939E-0,
   0.88444475E-0,
   0.88711858E-0,
   0.88925635E-0,
   0.8908248E-0,
   0.89185008E-0,
   0.89238389E-0,
   0.89249123E-0,
   0.89227611E-0,
   0.89188351E-0,
   0.89136535E-0,
   0.89070597E-0,
   0.88991557E-0,
   0.88900745E-0,
   0.88809129E-0,
   0.88720273E-0,
   0.88628903E-0,
   0.88538621E-0,
   1.00000000E-0
   >
 1 #B (F8/1:100)
   INIT
   <
   0.15909208E-0,
   0.16377264E-0,
   0.16886012E-0,
   0.17425167E-0,
   0.17986784E-0,
   0.18568259E-0,
   0.19168301E-0,
   0.1978972E-0,
   0.20433144E-0,
   0.21097175E-0,
   0.21780635E-0,
   0.22477992E-0,
   0.23187301E-0,
   0.23906544E-0,
   0.24619301E-0,
   0.25330128E-0,
   0.26035796E-0,
   0.26733584E-0,
   0.27434752E-0,
   0.28145748E-0,
   0.2887016E-0,
   0.29609715E-0,
   0.30365204E-0,
   0.31136416E-0,
   0.31921591E-0,
   0.32721585E-0,
   0.33536971E-0,
   0.34375538E-0,
   0.35247944E-0,
   0.36157152E-0,
   0.37103565E-0,
   0.38085884E-0,
   0.39101295E-0,
   0.4014736E-0,
   0.41224637E-0,
   0.42331378E-0,
   0.43464501E-0,
   0.44621169E-0,
   0.45799583E-0,
   0.46999113E-0,
   0.48215192E-0,
   0.49442889E-0,
   0.50677388E-0,
   0.51912598E-0,
   0.53145909E-0,
   0.54380719E-0,
   0.55620055E-0,
   0.56877262E-0,
   0.58163823E-0,
   0.59473075E-0,
   0.60796597E-0,
   0.62123772E-0,
   0.63444379E-0,
   0.64748407E-0,
   0.66026205E-0,
   0.67276923E-0,
   0.68504483E-0,
   0.69723485E-0,
   0.70942337E-0,
   0.72151341E-0,
   0.73335526E-0,
   0.74478363E-0,
   0.75569467E-0,
   0.76609277E-0,
   0.77606331E-0,
   0.7857304E-0,
   0.79521756E-0,
   0.80460758E-0,
   0.81396289E-0,
   0.82326715E-0,
   0.83242848E-0,
   0.84127787E-0,
   0.84977153E-0,
   0.8580085E-0,
   0.86599207E-0,
   0.87370365E-0,
   0.88109533E-0,
   0.88806143E-0,
   0.89452291E-0,
   0.90044753E-0,
   0.90583307E-0,
   0.91075496E-0,
   0.91530391E-0,
   0.91946917E-0,
   0.9231618E-0,
   0.9263262E-0,
   0.92895401E-0,
   0.93105838E-0,
   0.93265553E-0,
   0.9338412E-0,
   0.93473401E-0,
   0.93536854E-0,
   0.93576546E-0,
   0.93588869E-0,
   0.9357931E-0,
   0.93554675E-0,
   0.93510847E-0,
   0.93446405E-0,
   0.93379906E-0,
   1.00000000E-0
   >
 1 #C (F8/1:100)
   INIT
   <
   0.16381048E-0,
   0.16889053E-0,
   0.17428005E-0,
   0.17989622E-0,
   0.18571232E-0,
   0.19171274E-0,
   0.19792694E-0,
   0.20436252E-0,
   0.2110052E-0,
   0.21784622E-0,
   0.2248279E-0,
   0.23193012E-0,
   0.23914349E-0,
   0.24628897E-0,
   0.25341751E-0,
   0.26049717E-0,
   0.26749059E-0,
   0.27451376E-0,
   0.28163318E-0,
   0.28888608E-0,
   0.29629042E-0,
   0.30385477E-0,
   0.31157838E-0,
   0.31944162E-0,
   0.32745373E-0,
   0.33561501E-0,
   0.34400069E-0,
   0.3527234E-0,
   0.3618148E-0,
   0.37128028E-0,
   0.3811082E-0,
   0.39127042E-0,
   0.40173986E-0,
   0.41252411E-0,
   0.42360707E-0,
   0.43495789E-0,
   0.44654755E-0,
   0.4583567E-0,
   0.47038308E-0,
   0.48258172E-0,
   0.49490328E-0,
   0.50730166E-0,
   0.51971323E-0,
   0.53210513E-0,
   0.54451338E-0,
   0.55695607E-0,
   0.56956598E-0,
   0.58248092E-0,
   0.59563696E-0,
   0.60895395E-0,
   0.62232639E-0,
   0.63565275E-0,
   0.64883562E-0,
   0.66176633E-0,
   0.67443231E-0,
   0.68685388E-0,
   0.69918244E-0,
   0.71153517E-0,
   0.72382659E-0,
   0.73591442E-0,
   0.74762662E-0,
   0.75883973E-0,
   0.76954125E-0,
   0.77980778E-0,
   0.7897614E-0,
   0.79953847E-0,
   0.80922448E-0,
   0.81890551E-0,
   0.82858347E-0,
   0.83820569E-0,
   0.84758759E-0,
   0.85661781E-0,
   0.86543797E-0,
   0.87406894E-0,
   0.88250022E-0,
   0.89072378E-0,
   0.8986434E-0,
   0.90615436E-0,
   0.9132278E-0,
   0.91983244E-0,
   0.92600856E-0,
   0.93189758E-0,
   0.93758199E-0,
   0.94299446E-0,
   0.948024E-0,
   0.95263386E-0,
   0.95680475E-0,
   0.96052451E-0,
   0.96374833E-0,
   0.96659345E-0,
   0.96923301E-0,
   0.97170591E-0,
   0.97405582E-0,
   0.97616259E-0,
   0.9780375E-0,
   0.97983738E-0,
   0.98155683E-0,
   0.98294637E-0,
   0.98294637E-0,
   1.00000000E-0
   >
END-DEFINE
