* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION F-PENDING-REQUEST RETURNS (L)
  DEFINE DATA
  PARAMETER
  1 #CN   (N6)
  1 #PROCESS-NAME (A) DYNAMIC
  LOCAL USING OBJLERRQ
  END-DEFINE
*
FIND ERROR-QUEUE-V WITH MEMBER-CN = #CN
  IF ERROR-QUEUE-V.ERROR-STATUS = 'A' AND ERROR-QUEUE-V.PROCESS-NAME = #PROCESS-NAME
    F-PENDING-REQUEST := TRUE
    ESCAPE ROUTINE
  END-IF
END-FIND
*
END-FUNCTION
END
