* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION F-POLICY-STATUS RETURNS (A) DYNAMIC
DEFINE DATA
PARAMETER
1 #CN            (N6)
1 #INDEX         (I2) 
* 
LOCAL
1 ST-V VIEW OF A-STATUS
  2 ID-NUMBER
  2 STATUS (9)
END-DEFINE
*
FIND(1) ST-V WITH ID-NUMBER = #CN
  IF NO RECORDS FOUND
    RESET F-POLICY-STATUS
    ESCAPE BOTTOM
  END-NOREC
  F-POLICY-STATUS := STATUS(#INDEX)
END-FIND
END-FUNCTION
END
