* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION F-PROFILE-UPDATE-DATE 
DEFINE DATA  
PARAMETER 
  1 #CN   (N6) 
LOCAL USING OBJLWEBU 
END-DEFINE 
* 
FIND(1) WEB-ACCOUNT-INFO WITH MEMBER-CN = #CN 
  WEB-ACCOUNT-INFO.PROFILE-UPDATE-DATE := *DATN 
  UPDATE 
END-FIND   
* 
END-FUNCTION 
END 
