* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program CRMDRV.
/**
/** :author nguentchev
DEFINE DATA LOCAL
1 XML_PARSER_INPUT     (A) DYNAMIC
1 RESPONSE-DATA        (A) Dynamic
1 FUNCTION-NAME        (A) Dynamic
1 #CreateOrder         (A25) CONST <'CreateOrder'>
1 #CREATE-CONTACT      (A24) CONST <'CreateContact'>
1 #AuthenticateMember  (A25) CONST <'AuthenticateMember'> 
1 #CreditCardInfo      (A25) CONST <'CreditCardInfo'>
END-DEFINE
/* 
**DEFINE WORK FILE 12 "/usr/SAG/tmp/CRM/NewContact.xml" TYPE "UNFORMATTED"
DEFINE WORK FILE 12 "/usr/SAG/tmp/CRM/CreditCard.txt" TYPE "UNFORMATTED"
*
READ WORK FILE 12 XML_PARSER_INPUT
END-WORK
CLOSE WORK FILE 12
*
FUNCTION-NAME := #CreditCardInfo
CALLNAT 'MBRSRV' FUNCTION-NAME XML_PARSER_INPUT RESPONSE-DATA
PRINT RESPONSE-DATA
*
END