* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
* CRM Admin interface : Pass Member data to Sales CRM
************************************************************************
* NAME         : MBRCNTC                                               *
* AUTHOR       : Copyright: MetrostarSystems AAFMAA                    *
* DESCRIPTION  : Sends Contact/Member data to CRM                      *
************************************************************************
*        MODIFICATION LOG                                              *
************************************************************************
* USER   DATE      TAG  REASON
* NGG    20100128      Initial Creation
* NGG    20180131      Rewritten
*********************************************************

DEFINE DATA
PARAMETER
1 #CONTACT-ID         (N8)
1 XML_SERIALZE_OUTPUT (A) DYNAMIC
1 #CSV-LINE           (A) DYNAMIC
1 #CRM-Result         (A) DYNAMIC
1 #CRM-Request        (I4)
LOCAL
1 #Timeout          (A2) CONST <'-2'>
1 #Natural-error    (A2) CONST <'-3'>
1 #CRM-CONTACT-ID           (A) DYNAMIC
1 #XML                      (A) DYNAMIC
1 #Response                 (A) DYNAMIC
1 #Response-dspl            (A16)
1 #ISN                      (P8)
1 #SSN                      (A9)
1 #GENDER                   (A6)
1 P_PARMS
  2 P_ERROR_NUM           (I4)
  2 P_ERROR_LINE          (I4)
  2 P_ERROR_PROGRAM       (A32)
  2 P_ERROR_LIB           (A32)
  2 P_ERROR_DBID          (I4)
  2 P_ERROR_FNR           (I4)
  2 P_ERROR_TIME          (T)
  2 P_ERROR_PGM_TYPE      (A1)
  2 P_ERROR_PGM_TYPE_LONG (A11)
  2 P_ERROR_LANG          (I4)
  2 P_ERROR_LEVEL         (I4)
  2 P_ERROR_CLASS         (I1)
  2 P_ERROR_TYPE          (I1)
*
1 #ERROR-TIME             (A19)
1 #Owner                  (A20)

1 CNT-V VIEW OF A-CONTACTS
  2 CRM-CONTACT-GUI
END-DEFINE
*
ASSIGN #CRM-Request = 2
RESET #ISN
*
FIND (1) CNT-V WITH CONTACT-ID = #CONTACT-ID
  IF NO RECORDS FOUND
    compress 'No contact found' #CONTACT-ID INTO #CRM-Result
    ESCAPE BOTTOM
  END-NOREC
  #CRM-CONTACT-ID := CNT-V.CRM-CONTACT-GUI
  CALLNAT 'MBRDATA'
    #ISN
    #XML
    #CSV-LINE
    #Response
    #CRM-Request
    #CONTACT-ID
    #CRM-CONTACT-ID
END-FIND

* F1.
* FIND MEMBER WITH MEMBER-CONTACT-ID = #CONTACT-ID
*   IF NO RECORDS FOUND
*     RESET #ISN
*     CALLNAT 'MBRDATA'
*       #ISN
*       #XML
*       #CSV-LINE
*       #Response
*       #CRM-Request
*       #CONTACT-ID
*     ESCAPE BOTTOM
*   END-NOREC
*  IF MEMBER.PROCESS-IND = 'C'
*      AND MEMBER.INTRO-FLAG = 'A'
*    ESCAPE BOTTOM
*  END-IF
*   ASSIGN #ISN = *ISN (F1.)
*   CALLNAT 'MBRDATA'
*     #ISN
*     #XML
*     #CSV-LINE
*     #Response
*     #CRM-Request
* END-FIND
*
ON ERROR
/*
  CALLNAT 'USR2001N' P_PARMS
/*
  MOVE EDITED P_ERROR_TIME (EM=YYYY'-'MM'-'DD' 'HH':'II':'SS)
    TO #ERROR-TIME
/*
  COMPRESS
    'Error number:' P_ERROR_NUM
    'Error class:' P_ERROR_CLASS
    'Error line:' P_ERROR_LINE
    'Error program:' P_ERROR_PROGRAM
    'Error program type:' P_ERROR_PGM_TYPE
    'Error program type long:' P_ERROR_PGM_TYPE_LONG
    'Error program level:' P_ERROR_LEVEL
    'Language at error time:' P_ERROR_LANG
    'Error library:' P_ERROR_LIB
    'DBID:' P_ERROR_DBID 'FNR:' P_ERROR_FNR
    'Error type:'  P_ERROR_TYPE
    'Error time:' #ERROR-TIME
    INTO #CRM-Result
  ESCAPE ROUTINE
END-ERROR

END
