* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Subprogram ORDNCRTE.
/**
/** :author nguentchev
DEFINE DATA
PARAMETER
1 INPUT-DATA          (A) Dynamic        /* In
1 RESPONSE-DATA       (A) Dynamic        /* Out
1 MESSAGE-ID          (A) Dynamic        /* Out
LOCAL USING ORDAPARM
LOCAL
1 BLANK   (A1) CONST <' '>
1 J   (I4)
1 #ORDER
  2 CRMOrderID   (A) DYNAMIC
  2 UserCode     (A) DYNAMIC
  2 HeightFeet   (N2)
  2 HeightInches (N2)
  2 Weight       (N3)

END-DEFINE
/*         Parse the Order request from CRM
CALLNAT 'ORDNPARS' INPUT-DATA IASOrder
/*

/* All entities are independent and complete transaction
/* In case of error the order request can be resend and only
/*  missing data will be created.
/*         Create contacts
/*         Create contacts relationships
CALLNAT 'ORDNCNTS' IASOrder
FOR J 1 TO IASOrder.C@Contacts
  IF IASOrder.ErrorDescription (J) NE BLANK
/* Create an Error
    ESCAPE ROUTINE   
  END-IF
END-FOR
END TRANSACTION  /* Contacts data are stored in IAS
/*
/*    Create applications and Create application roles
CALLNAT 'ORDNAPPS' IASOrder
FOR J 1 TO IASOrder.C@Applications
  IF IASOrder.ErrorDescription (J) NE BLANK
/* Create an Error
    ESCAPE ROUTINE   
  END-IF
END-FOR
/*      
/*         Create payment
CALLNAT 'ORDNPAY' IASOrder
/*         Sync CRM with IAS data elements (asynch request). Can be done in NM/AI
END
