* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program TESTER.
/**
/** :author ttinger
/* TODO Enter your code here
DEFINE DATA
LOCAL

END-DEFINE

END
